{
  //SPECIAL DIALOGUE
  "patio_Sophia": "I'm really happy living here with you.$1#$e#%You pat Sophia's head.#$e#!!!$9",
  "spouseRoom_Sophia": "Hey, you!$4#$b#I'm deciding which manga book to read!$9#$e#Maybe I should finish the one I already started first!$1",
  "funReturn_Sophia": "I had a productive day today!$9#$e#I love you.$4#$b#*smooch*!!!$9",
  "funLeave_Sophia": "Hey, you! I'm running some errands today.$1#$b#I'll be thinking about you.$9#$e#Let's grab a drink at the saloon tonight! Gus is serving Grampleton orange chicken!$1",
  "OneKid_0": "I can't believe we're parents, @. Everything is so different.$9#$e#I'm so happy with you. It's...it's nice to have a family again.$1",
  "OneKid_1": "%kid1 laughs when I make funny noises and faces.$9#$e#I love how our home is always full of laughter!$8#$e#%You pat Sophia on the head. She smiles at you.",
  "OneKid_2": "Hey, you! I'm heading to Pierre's soon to pick up baby stuff.$1",
  "OneKid_3": "%kid1 was playing around in the dirt outside. Had to draw a bath.$0#$e#I feel like %kid1 will be a farmer someday, just like us.$1",
  "TwoKids_0": "I want to build a pillow fort for %kid1 and %kid2! Do you think they'd enjoy that?$1#$e#I know I would.$9",
  "TwoKids_1": "Found %kid2 digging around in my cosplay drawer earlier this morning.$0#$e#Maybe when %kid2 is older, we can do cosplays together!$1",
  "TwoKids_2": "Hey, you! We should bring %kid1 and %kid2 to the Pelican Town park sometime soon.$1#$b#It'd be fun!$9#$e#Could have a picnic too! Good excuse to eat snacks!$1",
  "TwoKids_3": "%kid1 and %kid2 get along well with each other.$1#$e#We need to make sure they both feel loved! Wouldn't want them getting jealous of each other.$1",
  
  //SEASONAL DIALOGUE
  "spring_1": "Do you smell the pollen and nectar in the air!? Spring has arrived!$1#$e#I need to drop by the vineyard soon. Gotta set up the grape trellises!$9#$b#Good luck today, silly! It'll be a busy day. Extra cuddles tonight!$1",
  "spring_13": "I still get nervous around large crowds of people...$2#$e#C-can we hold hands today at the festival?$4",
  "spring_24": "We don't have to go to the flower dance. I'm not a fan of... dancing.$2#$e#Maybe I can give you a private dance tonight?$4",
  "spring_28": "What happened to spring? It's already gone!$5#$e#We should go to the beach this summer!$1",
  "summer_1": "Hey, you! It's the first and busiest day of the season! Good luck today!$9#$e#I'll make dinner tonight. Don't worry.$1",
  "summer_11": "Do you know what you're bringing to the potluck today for the Luau?$1#$e#I'm pouring aged Blue Moon wine into the adult pot!$1",
  "summer_28": "Um. Would you like to watch those jellyfish tonight? We can hold hands on the dock.$4#$e#...Do you think the jellyfish sting?$0",
  "fall_1": "Fall will be hectic as usual for me! Gotta harvest all the grapes.$1#$e#O-oh! It's okay. You need to focus on the farm work here. I'll be thinking about you.$9",
  "fall_4": "Today was the day my parents died...$6#$b#I-I was alone for so long that I forgot what it's like to have a family.$12#$e#Thanks for being here for me, today.$13#$e#%Sophia is crying.#$e#%You hug Sophia. She smiles at you.",
  "fall_16": "The Pelican Town Fair is today! I just know you're gonna blow everyone away!$9#$e#I'll be showing off a new vintage wine.$1",
  "fall_27": "It's spoop day! Spooop! SPOOP!$9#$e#I wonder if the maze is different this year!$1",
  "fall_28": "Brrr... it's so cold. Supposed to snow lots and lots tonight.$2#$b#The weather man said so on the television!$1#$e#You know, cuddling is a good way to get warm...$4#$e#%Sophia has a glint in her eye.",
  "winter_1": "It snowed so much last night! Look outside!$5#$e#We should cuddle by the fireplace tonight. Maybe make some hot chocolate?$4",
  "winter_8": "I can feel it! You are gonna win the fishing contest today!$1#$e#If you win - extra cuddles tonight...$4",
  "winter_25": "Merry Winter Star, silly. I made you some coffee! It's just how you like it! [395]$4#$e#Let me know when you want to go to the town square.$4#$e#Oh. Um. You'll get a 'special' gift later.$4#$e#Nooo. It isn't something you open. You'll see soon. I think you'll like it!$4",
  "winter_28": "I'm sad the snow is leaving. I'll miss crunching when I walk in it.$2#$e#%You pat Sophia on the head.",
  
  //DAY DIALOGUE
  "Indoor_Day_0": "Hey, you! Good morning. Did you sleep okay?$1#$e#Thinking about maybe putting together a new cosplay soon!$9",
  "Indoor_Day_1": "*yawn* I'm so sleepy still.$2#$e#Have a nice day, silly.$1#$e#Oh. How could I forget?$4#$b#*smooch*!!!$9",
  "Indoor_Day_2": "Yay! You're finally up!$9#$e#Craving anything for breakfast?$1",
  "Indoor_Day_3": "If you're going out, mind picking up some snacks from Pierre's?$1#$e#I love snacks!$9",
  "Indoor_Day_4": "Hey, you! I made us some coffee.[395]$4#$e#Hope you have a productive day, silly!$1",
  "Outdoor_0": "I love the fresh air here. I'm used to the salty air blowing in from the ocean.$0",
  "Outdoor_1": "What a lovely day to read a book outside! It's beautiful.$1",
  "Outdoor_2": "We should turn all of the fruit you grow into wine! Do you think that's a good idea?$9",
  "Outdoor_3": "Don't overwork yourself, silly. If you need a cuddle break, just ask.$1#$e#*smooch*$9",
  "Outdoor_4": "Hey, you! Up to anything fun today?$1#$e#OoOoh. Sounds important!$8",
  "Rainy_Day_0": "It's raining! On days like this, I just want to cover myself with blankets and watch anime.$1#$e#Oh! And eat snacks!$9",
  "Rainy_Day_1": "Hey, you. Another rainy day!$1#$e#Come closer, silly.$4#$e#*smooch*$9",
  "Rainy_Day_2": "I wonder if Haley is up to anything today? Maybe I'll text her soon.$1",
  "Rainy_Day_3": "We should stay inside all day, watch movies and eat snacks!$9#$e#I was joking, silly.$1#$e#U-um! Unless you weren't!? Then we should totally do that!$5",
  "Rainy_Day_4": "D-do you remember when you found me crying in the rain? I'm happy you were there that day...$2#$b#I'll always treasure that moment, @.$1#$e#%You pat Sophia on the head. She smiles at you.",
  
  //NIGHT DIALOGUE
  "Indoor_Night_0": "You were so busy working today you missed dinner! Want some leftovers?$1#$e#Hehe! Here, silly![727 231 207 199]$9",
  "Indoor_Night_1": "*grumble* My tummy is speaking to me again.$2#$e#Wait, I think I can understand. It's saying... it's time for a snack soon?$1",
  "Indoor_Night_2": "I lived alone in my parents' house for so long. It was a little scary, being there by myself when it got dark.$0#$b#So many sleepless nights...$2#$e#But now I actually look forward to the sun going down. Gives me an excuse to get close to you.$1#$e#Um. Want to cuddle tonight?$4",
  "Indoor_Night_3": "*yawn* sooo sleepy. Want to go to bed soon, @?$1#$e#Maybe I'll read in bed for a bit. In the middle of a manga!$9",
  "Indoor_Night_4": "I can't decide what material to use for the cosplay outfit I'm working on.$0#$e#Hmm. Maybe I'll ask Emily, she's good at this stuff!$1",
  "Rainy_Night_0": "Hey, you! I was craving sweets today so I made dessert![232 234 223 220]$1#$e#*smooch*$9",
  "Rainy_Night_1": "It's perfect cuddle weather...$4#$e#Will I see you in bed soon, silly?$4",
  "Rainy_Night_2": "I finished the anime series I was watching today..$9#$e#It was a mini-series. Only five episodes...$0#$b#I hope they make more!$1",
  "Rainy_Night_3": "Oh, I'm glad you're back! I missed you so much.$1#$e#*yawn* Heading to bed soon? I washed the sheets today, so they're nice and fresh.$0",
  "Rainy_Night_4": "Hey, silly! I made dinner while you were out! [727 231 207 199]$1",
  
  //AFFECTION DIALOGUE
  "Good_0": "Come closer, @.$4#$e#Closer...$4#$e#*smooch*$9!!!#$b#Love you!$9",
  "Good_1": "I thought it'd be tough managing Blue Moon Vineyard but it actually isn't so bad.$1",
  "Good_2": "I always thought I'd be alone my whole life.$2#$b#I'm happy we found each other, silly.$1#$e#*smooch*$9",
  "Good_3": "H-hey, be careful down in the mines, okay? I can't imagine what I'd do if anything happened to you.$2#$e#%You tell Sophia not to worry. She smiles at you.",
  "Good_4": "Hey, you! Want to drink some aged Blue Moon wine tonight?$1",
  "Good_5": "Don't worry about me, silly! Go on and do your thing!$9#$e#I'll be fine here.$1",
  "Good_6": "I'm dyeing my hair again soon! Maybe I should change the color?$1#$e#Mmm... no, I'll keep it 'cotton candy pink'!$9",
  "Good_7": "Hey, hey! Um. Do you have a moment?$1#$e#Just... wanted to say I'm proud of everything you do.$9#$b#I love the life we started together. It's... like a magical paradise.$1#$b#Lets always be there for each other!$9",
  "Good_8": "We should go to a cosplay convention in Zuzu City sometime! You'd love it!$1",
  "Good_9": "Eek! A stranger!$2#$e#*giggle* I'm just being silly.$9#$e#Um. So, what kinda of farm work do you have today?$1",
  "Neutral_0": "Hey! Scarlett is coming over soon, is that alright?$1#$e#You're the best!$9",
  "Neutral_1": "Want to watch anime later? I'll even make us homemade snacks!$1",
  "Neutral_2": "Hey, you. I'm going to clean the house today.$1",
  "Neutral_3": "Blue Moon Vineyard is doing well. It's a bit tough managing it from here, but I don't mind.$1",
  "Neutral_4": "Do you want to live in Stardew Valley for the rest of your life, @?$0#$e#I was thinking maybe we'd move somewhere else later. Maybe the Fern Islands?$1#$e#We can talk more about it later. I definitely don't want to move anytime soon!$9",
  "Neutral_5": "Hi, silly. Keep up the good work!$1#$e#I'm always rooting for you.$9",
  "Neutral_6": "You know, I feel like my parents would be proud of me if they saw my life now.$1#$e#Your grandpa would be, too.$1",
  "Neutral_7": "Um. Sooo tell me that story again about how you got my mermaid pendant!$1#$e#A ghost at the beach! So spooky!$9",
  "Neutral_8": "*yawn* I-I don't know why. I'm so... *yawn* sleepy today.$2#$e#Maybe I'll take a nap.$1",
  "Neutral_9": "Hey! Always be you, okay?$9",
  "Bad_0": "@... do you still love me?$2#$e#...$2#$e#N-never mind. I just... feel really down today for some reason.$6#$e#%Sophia turns away from you.",
  "Bad_1": "I-I had a bad dream last night about my parents.$6#$e#I'm okay. It's just something that happens from time to time.$6#$e#...$12#$e#%You hug Sophia.",
  "Bad_2": "I have a doctors appointment soon...$2#$e#I don't wanna go.$6#$e#%You tell Sophia everything will be okay.",
  "Bad_3": "My tummy aches...$2#$e#I think I ate too many snacks.$3",
  "Bad_4": "You've been away so much lately...$2#$e#Did I do something wrong?$2",
  "Bad_5": "Hey... I'm hanging out with Victor tomorrow.$0#$e#What will we be up to? None of your business.$3#$e#%Sophia turns away from you.",
  "Bad_6": "Not now. I'm unhappy with you.$3#$e#You should clean more around the house. I'm not your maid.$3",
  "Bad_7": "S-sorry, @. Don't feel like talking right now.$2#$e#I said not now. Stop bugging me!$3#$e#%Sophia is ignoring you.",
  "Bad_8": "D-do you think I'm too clingy?...$2#$e#...$2#$e#%You hug Sophia and pat her head. She smiles at you.",
  "Bad_9": "I-I had trouble breathing this morning...$2#$b#I-I'm okay...$6#$e#%You hug Sophia."
}