
{
  //SPECIAL DIALOGUE
  "Introduction": "Oh my, aren't you a cutie! Welcome to the valley, dear.$6#$b#It's so exciting when someone new moves in!$1#$e#Have you met my son, Victor?$3",
  "divorced": "You got what you wanted, so leave me alone.$5",
  "danceRejection": "You wish to dance with me? Dear, I'm afraid I will have to decline.$6",
  "secondChance_Girls": "...Revive things, @?$6#$b#Sweetie...I've worked hard to get past what you did to me. Marriage is...even more important to me than to most people. You know that.$2#$b#...I'm willing to try again, but this is the last time.$3#$b#I do love you, sweetie. I hope I'm not making a mistake trusting you again.$2",
  "dumped_Girls": "Do you really have the audacity to be talking to me right now, @?$5#$b#I need some time after the way you treated me. And a drink.$2",
  "breakUp": "I knew this was a bad idea from the start.$2#$b#Thank you for being up front about your feelings.$0#$e#...$2",
  "pamHouseUpgrade": "Pam's apalling trailer is gone. I grew weary of setting my eyes on it everday.$6#$b#This will improve the image of Pelican Town, thanks to your patronage!$3",
  "pamHouseUpgradeAnonymous": "Pam's apalling trailer is gone. I grew weary of setting my eyes on it everday.$6#$b#This will improve the image of Pelican Town, thanks to an unnamed patron!$3",
  "stardrop_gift": "@. I put a special order in for this Stardrop fruit for you.$4#$b#It's as fresh as they come. I hope you enjoy it, sweetie. May it make your work a little easier.$3",
  "give_flowersA": "...You want to be with me? Really?$1#$b#Of course I want to be with you too. I just didn't think...Thank you. For taking the first step.$3",
  "give_flowersB": "Sweetie, I'm touched. Of course I'd love to.$1#$e#...Please be patient with me, though. It's been a while since I was involved with anyone.$3",
  "give_pendant": "...$2#$b#@...I never thought that I would get married again. I never even thought I'd be with anyone again at all.$2#$b#But spending time with you...it's made me feel things that I thought I had left behind a long time ago.$3#$b#Yes, @. I would love to marry you. And...this new chapter we're starting, I hope it's the happiest of all.$1",
  "rejectNPCA": "I don't think so, sweetie.$6",
  "rejectNPCB": "That's not going to happen.$6#$e#The conversation is done, @.$2",
  "reject_two_heartA": "I don't feel that way about you, dear. I'm sorry.$2",
  "reject_two_heartB": "We need to know each other a little better before we take that step, sweetie.$6#$e#I'm not opposed, but...I'm not ready to make that choice.$2",
  "reject_four_heartA": "The thought of dating someone again...I just don't think I can, sweetie.$2#$e#We can talk about it more another time.$2",
  "reject_four_heartB": "@, you're a great friend, but...$2#$b#I just need a little more time, sweetie. Let's get to know each other a little better.$2",
  "engageA": "Do you think I'm stupid, dear? I know you're engaged to someone else.$5#$e#Don't toy with me like that. It's unkind.$2",
  "engageB": "...@. What would your partner think?$2#$e#I'm disappointed in you, sweetie.$5",
  "marriedA": "Really, @? You're already married.$5#$e#I'm just going to pretend this never happened. I suggest you do the same.$5",
  "marriedB": "@...what are you doing? I'm not going to come between you and your spouse.$6#$e#Do you really think I'm the kind of person who would do that?$5",
  "refusal_knownA": "Oh, honey, marriage is a big conversation for us to have.$6#$e#Let's have a glass of wine and talk about it sometime.$0",
  "refusal_knownB": "I'm really not thinking about getting married again anytime soon, @.$6#$b#Maybe someday I'll be ready for that again.$2",
  "refusal_botherA": "...That's not happening anytime soon, dear.$6",
  "refusal_botherB": "Not now.$0",
  "refusal_no_heartsA": "Oh! I've heard that those pendants are a local romantic custom around here. How sweet.$6#$b#Are you planning to give it to someone?$1",
  "refusal_no_heartsB": "It's not funny to joke around about that, sweetie. Marriage means a lot to me.$2",
  "Resort_Entering": "Ah, the resort! What a sight to be seen!$1",
  "Resort_Leaving": "This trip was wonderful! I must come back here again soon.$3",
  "Resort_Shore": "The sunshine is doing wonders for my skin.$1#$b#Would you care to try my sunscreen, dear? It's made with organics.$3",
  "Resort_Chair": "This beach is quite exquisite!$3#$e#I wonder how much it'd cost to build a house here.$6",
  "Resort_Bar": "I may have had a drink too many...$4",
  "Resort": "My, my. I may actually prefer this resort over Sautine City.$1#$e#The community really makes it special, wouldn't you say?$3",
  
  
  //JOJA JOB QUESTION
  "spring_Thu": "Working a corporate job in the city was a different chapter of my life.$3#$q 8001/8002 joja_followup#You used to work for Joja, isn't that right?#$r 8001 50 joja_yes#Yes, I used to work there.#$r 8002 -50 joja_no#No. I never worked at Joja.",
  "joja_yes": "Hmm, that's what I thought. Mayor Lewis told me.$6#$b#Office job to farmer - what an incredible career change! I work as a stock trader in my free time, maybe 15 hours a week.$1#$b#You must feel so much freer to not be tied up in a corporate office, and able to do the work you love.$3#$b#I'm happy you found your passion, sweetie.$1",
  "joja_no": "That's strange. That isn't what Morris told me...$6",
  "joja_followup": "$p 8001#It was for you too, sweetie. I'm happy we were both able to move on.$3|It was for you too, sweetie. I'm happy we were both able to move on.$3",
  
  //SPECIFIC MAP AND COORDINATES DIALOGUE
  "Custom_JenkinsHouse_20_9": "%Olivia is concentrating on her yoga form.",
  "Custom_JenkinsHouse_19_5": "I'm in bed, dear. Leave at once!$5",
  "Custom_JenkinsHouse_5_8": "@, I'm using the restroom! Leave!$5",
  "SeedShop_21_20": "%Olivia is concentrating on her yoga form.",
  "Custom_SophiaHouse_6_22": "Hi, sweetie! I'm putting in an order to Sophia right now.$3",

  //SPRING AND GENERAL DIALOGUE
  "spring_1": "I'm happy it's spring again. I was growing very weary of the winter weather.$1",
  "spring_9": "Sometimes I miss how busy I used to be back in Zuzu City at my corporate job.$2#$e#I have so much free time here in the valley. It allows me to focus on my hobbies, but sometimes I can get lost in my thoughts...$3",
  "spring_12": "The Egg Festival is tomorrow! A good excuse to indulge in some vintage wine from my collection.$3",
  "spring_23": "Hi, honey. Spring is coming to an end soon. Do you know what crops you'll plant for summer?$3#$e#Marnie plants melons every year, and they're always delicious. I look forward to them.$1",
  "spring_28": "I think I may plant sunflowers in our backyard. When I see sunflowers, I feel like I'm really in the spirit of summer.$1#$e#Sunflower seeds make a healthy snack too!$3",
 
  "Mon": "I wonder if any of Victor's friends want a part-time job cleaning the house. It'd save me a lot of time.$6",
  "Mon2": "My schedule is quite busy, but I make sure to fit in time with Caroline and Jodi on Mondays and Thursdays. They're both close friends of mine.$3#$e#I try my best to stay away from Pam. She just doesn't sit well with me.$6#$e#Why? Dear, that's none of your business.$1",
  "Mon4": "I'm debating whether I should hire a landscaper. The backyard could use some attention.$0#$e#You want to talk more? I'm busy at the moment, dear.$6",
  "Mon8": "It's a joy to see you, @.$3#$e#Ciao!$1",
  "Mon10": "Hello, honey. Would you care to do yoga with me tomorrow at the acrobatics class?$3#$e#I can teach you some basic poses!$1",
  "Tue": "Hello, dear. Having a productive day today? Don't overwork and hurt yourself.$3#$e#I wouldn't want you moving away so soon.$6",
  "Tue2": "I've been practicing yoga for years. I can do advanced poses such as 'Lord of the Dance' and 'Lotus'.$1#$e#Staying healthy is important if you want a beautiful, flawless body like mine.$6",
  "Tue8": "Yoga is a physical, mental, and spiritual practice! Whenever you have some spare time, I'd love to teach you some poses.$3",
  "Wed": "Hi, sweetie. Happy Wednesday.$3#$e#Maybe if you're lucky, I'll give you a taste of some rare wine.$1",
  "Wed4": "I watered the plants in the house today. Healthy plants mean clean, fresh air in the house.$1#$e#It's not something money can buy.$3",
  "Wed10": "I fetched a bottle of wine from the cellar for you. It's a wonderful vintage.[348]$1",
  "Thu": "Sorry, dear. I'm too busy to talk right now.$0#$e#That means you can leave, @.$6",
  "Thu2": "Hi, @! I'm in cheerful and lovely mood today!$1#$e#Why? Because I made a lot of money this morning through a stock trade.$0",
  "Thu6": "Will you be at the saloon tomorrow, @? You may see me there. Victor goes every Friday to hang out with his friends.$3",
  "Thu8": "It's a joy to see you. How are you?$3#$e#Ooh, I see! Staying productive as always.$1",
  "Fri": "Hello, dear.$3",
  "Fri2": "Some of my stocks decreased in value this morning. I lost 30,000g,,.$2#$e#%Olivia isn't in a good mood to talk.",
  "Fri6": "I always indulge myself with a nice glass of wine on Fridays.$3#$b#Gus carries some rare vintages, and is always stocked with wine from Blue Moon Vineyard.$1",
  "Fri10": "Happy Friday, my love! You've been working so hard lately! You deserve a day off.$3#$e#Let me know if I can get you anything.$4",
  "Sat": "There's always too much work to be done around the house. I may hire a butler soon.$5#$e#Have a nice day, dear.$6",
  "Sat2": "I picked up painting as a hobby several years ago. Leah has given me some great pointers!$3#$e#She's truly a doll, wouldn't you say?$1",
  "Sat6": "Hi, honey. How is this Saturday treating you? You work too hard during the weekends.$3#$e#You should take a break every once in a while.$0",
  "Sat10": "I've been making so much progress on my art lately. I'm proud of myself.$1#$e#Have a wonderful day, my love!$3",
  "Sun": "You don't take days off, do you? I certainly don't want to distract you from your work.$6#$e#Go on ahead with your errands, @.$0", 
  "Sun2": "Time is money! You know this is true, @. I always check my stocks every day.$3#$e#Of course, you know this. It's the reason you never take a day off from working on your farm.$6",
  "Sun6": "I got lucky this morning trading and had a huge payout.$1#$b#I believe I'll spend it on a painting from my favorite trendy artist from the Fern Islands.$0",
  "Sun10": "It's so wonderful to see you! How is your day?$1#$e#*smooch* Did I make your day better?$3",

  //SUMMER DIALOGUE
  "summer_1": "Ah! Summer! I can finally show off my new bikini at the beach.$3#$e#I believe Caroline has a new bikini as well.$6",
  "summer_5": "My seamstress in Chestervale designed a beautiful dress for me.$1#$b#I'm looking forward to wearing it at the next town festival.$3#$e#Don't forget to compliment me when you see it, sweetie.$1",
  "summer_10": "The governor doesn't visit Stardew Valley often. It's an honor he's visiting us tomorrow.$1#$e#I expect you'll be on your best behavior and contribute to the soup.$3",
  "summer_17": "I donated 15,000g to a charity in Zuzu City yesterday.$1#$b#I understand not everyone is as fortunate as I am. I try to help where I can.$2#$b#You look surprised. I do care about more than just my own good fortune, sweetie.$0",
  "summer_22": "Hi, honey. Here's a little spending money. Go buy yourself some ice cream!$1[336]",
  "summer_28": "Will you be joining everyone to watch the moonlight jellies tonight, @?$3",
  "summer_3_1": "That was a horrible blast last night. Did that wake you up too, @?$0#$e#It sounded like an avalanche. I need to talk to Mayor Lewis.$2",

  "summer_Mon": "Hello, dear. How's your Monday? Is the week off to a good start?$3#$e#Oh. Me? It's going well. Thank you for asking.$6#$e#Has anyone ever told you that you're very polite?$1", 
  "summer_Mon4": "Susan gave me a freshly picked melon from her field today. She's an absolute sweetheart!$1#$b#Her crops are much healthier than Andy's.$6#$e#I don't think I'd ever eat any of his produce.$2#$e#That seems a little harsh? Oh, honey, I'm just trying to watch out for my health. But I know that you want to make everyone feel at home.$0",
  "summer_Mon8": "Hi, sweetie. You're working so hard to start off the week, and in this summer heat too.$3",
  "summer_Mon10": "I'm using a new sunscreen. It's doing wonders for my complexion.$3#$b#Let me know if you want try it.$1",
  "summer_Tue": "I'm part of the aerobics class at Pierre's. Yoga is an excellent way to focus the mind and body.$3#$e#It also keeps me healthy and slim.$1",
  "summer_Tue4": "I picked up fresh produce from Pierre this morning. He has the best organic selection.$3",
  "summer_Tue6": "Mayor Lewis was 5,000g over budget for the Egg Festival this year.$2#$b#I contributed my own money to ensure we could still host the festival.$0#$e#In return, he allowed me to use more community kegs next to the community center.$3#$e#We should all try to give back to the community when we can. Together, we're what makes this town special, dear.$3",
  "summer_Tue8": "Next time I get back from the Fern Islands, I'll bring some ringfruit for you.$1#$e#They're delicious, and make the perfect desserts. Pies, cakes, custards... anything you can think of!$3#$b#I always like giving gifts, but I especially love making sure you get a nice treat sometimes, sweetie.$1",
  "summer_Wed": "Sophia's latest batch of iridium-quality wine was superb. I must let her know.$1",
  "summer_Wed4": "I invested 30,000g in a startup company this morning. I have faith they're going to grow big!$1#$e#Tech companies are booming in Zuzu City.$3#$b#If you want to make easy money, now's the time to get into stocks, @.$1",
  "summer_Wed6": "If you ever want me to invest your money in stocks, I'll be happy to oblige, @.$1#$e#I do, however, take a 20 percent cut from any profits for consulting.$6",
  "summer_Wed8": "I may take a trip to Grampleton soon. The most divine weather you'll ever experience is under the shade of the tall redwood trees.$3#$e#Maybe we can take a trip there together sometime, honey.$1",  
  "summer_Thu": "Hello, dear. What do you think of my new earrings?$3#$b#I ordered these in the mail from Sautine City!$1",
  "summer_Thu8": "Caroline, Jodi and I may go swimming sometime soon. Caroline has a new swimsuit she wants to debut.$3#$b#You want to tag along? Of course, sweetie. You're always welcome.$1",
  "summer_Thu10": "Caroline and I are swimming at the beach soon.$3#$b#Would you care to join us, sweetie?$4",
  "summer_Fri": "I've been spending more time painting lately.$1#$e#There's so much to learn. So many different styles and techniques... it's a little overwhelming.$0 ",
  "summer_Fri2": "Andy made me feel uncomfortable at the saloon last night. He was staring at me constantly.$2#$e#I heard he's horrible at paying his tab. That's not too surprising.$6",
  "summer_Fri6": "Yoga is a great activity if you have high blood pressure or high cholesterol.$1#$e#I think Andy could use some yoga. Or at least a healthier diet.$6#$b#..I know I've spoken harshly of him before, but I worry about him. Ready-made Joja meals aren't a healthy choice.$2",  
  "summer_Fri10": "My, my. Your outfit is absolutely flawless today.$1#$e#If you need any tailoring done, I know someone in Chestervale who can assist!$3",
  "summer_Sat": "I received a hefty amount of junk mail this morning. I need to have a word with Mayor Lewis.$2#$e#Most of the mail I get are advertisements and scams.$5",
  "summer_Sat4": "Mayor Lewis listened to a number of my suggestions to improve the town. He's really a very good mayor.$3#$e#I love how much this place is beginning to feel like home, sweetie. Is it starting to feel that way for you, too?$3",
  "summer_Sat8": "Leah taught me several brushstroke techniques. I envy her artistic skills.$3#$e#If I apply myself more, maybe I'll be able to paint a portrait of you one day!$1",
  "summer_Sun": "I'm going to try a different yoga routine next Tuesday. Something to challenge myself!$3",
  "summer_Sun4": "Jodi told me Vincent isn't doing well in math. She has so much to worry about...$2#$e#I may ask Victor if he can tutor him. If not, I suppose I do have a knack for math from trading...$3",
  "summer_Sun8": "My other hobbies? Well...since we're friends...don't tell anyone, but...$0#$e#I'm in the middle of a romance novel. I read more literary novels too, but these are my favorite guilty pleasure.$4#$e#Have a wonderful day, dear.$9",
  
  // FALL DIALOGUE
  "fall_1": "Good luck on your fall harvest this year, @. If you sell any pumpkins to Pierre, I may pick some up!$3",
  "fall_9": "I'm visiting Blue Moon Vineyard tomorrow to order more wine from Sophia.$3#$b#I sometimes have Victor go, but I want to see the Gem Sea from the cliff. It's a beautiful view.$1#$e#I'd like to go with you sometime... will you join me there?$3",
  "fall_15": "You're participating in the fair tomorrow, sweetie? I wish you the best of luck!$1#$e#Caroline says Pierre's crops have been doing very well this year. It'll be a close call between you two.$6",
  "fall_17": "At the fair yesterday, I spoke with a tourist that came all the way from Pine-Mesa City!$1#$b#It's not as big as Zuzu City, but it's still bustling with activity and commerce.$3",
  "fall_22": "Despite the fact I was an accounting manager at Joja, I never shop at their stores, and never will.$0#$e#Their products aren't healthy, and they'd damage my complexion.$6",
  "fall_26": "Spirit's Eve is tomorrow, @!?$1#$e#Victor has a tendency to get lost in the maze. He always seems to get caught in rough situations.$6",
  "fall_28": "There's a dark story about the family that used to live in our house.$2#$e#I'm not allowed to talk to anyone about it.$6#$e#Yes, @. That includes you too.$6#$e#...$2#$e#%Olivia is now ignoring you.",

  "fall_Mon": "During fall, I may sometimes take trips in the forest to gather some mushrooms.$0#$b#I wish Victor enjoyed mushrooms as much as I did. I'd use them in just about every dish.$6",
  "fall_Mon4": "I saw %pet walking around town yesterday. Such an adorable animal!$1#$e#%pet reminds me of Dewey... Victor loved that cat so much.$2#$e#Has he told you about Dewey yet? ...Losing that cat broke his heart, poor thing.$2",
  "fall_Mon8": "You're working so hard, sweetie! This energy tonic from Doctor Harvey will help you get your energy back.[349]$3#$e#Have a wonderful day!$1",
  "fall_Tue": "Mayor Lewis is considering funding some dock repairs. The wood is quite old.$0",
  "fall_Tue2": "The beauty of yoga is the enhanced flexibility it gives you, @.$3#$b#Working the fields on your farm will certainly keep your muscles toned too.$1",
  "fall_Tue6": "I tried to get Victor to do yoga with me and he refused to even try it.$6#$e#I suppose I'll just stick to Tuesdays. Emily loves our yoga days.$3",
  "fall_Tue10": "%farm Farm must have an exceptionally astonishing landscape this time of year.$3#$e#Perhaps I could paint your farmhouse...?$4",
  "fall_Tue8": "I've been doing yoga for many years. It's helped tone my body and concentrate my mind to a balanced state.$3#$e#You should join us sometime, @.$1", 
  "fall_Wed": "I prefer red wine over whites. Reds have more minerals and vitamins, and the taste is much more complex.$3#$e#Sophia specializes in dry red wines. The weather in the valley is perfect for it.$1",
  "fall_Wed4": "Pierre makes spiced cider during fall. He doesn't sell it at the front counter.$3#$e#He only sells it to his closest friends. Luckily, Caroline and I have an excellent relationship.$1#$e#Next time, I'll pick a little extra up for you.$3",
  "fall_Wed8": "Caroline and Jodi are my best friends. We've been through so much together.$1#$e#The three of us are mothers. We see eye to eye on many things, and rely on each other for support.$3",  
  "fall_Thu": "Jodi baked me an apple pie yesterday. It was delicious! I need to make her something special too.$1",
  "fall_Thu4": "A silent auction is being held in Zuzu City today.$0#$b#I'm always on the lookout for more Gotoran china. It's quite exquisite.$1",
  "fall_Thu8": "Jodi's been stressed lately. I'm going to offer to watch Vincent for a day so she can take a break.$0#$e#Let me know if I can ever help you relax a little, @. I know you work hard.$3",
  "fall_Fri": "Fall is just the most marvelous season for fashion, don't you think, @?$3#$b#Dresses, jackets, layers...so many possibilities. I love it!$3",
  "fall_Fri6": "Do you ever go shopping to expand your wardrobe, sweetie?$0#$b#I know a few places where you can get quality clothes at a great bargain, if you ever want to go together.$3",
  "fall_Sat": "Marlon walked into the saloon with the wizard last night and they both went to the back room.$6#$b#A person wearing a brown cloak joined them, but their face was covered.$0#$e#I wonder what on earth was going on back there...$6",
  "fall_Sat6": "Such a chilly fall day. Want to join me in the saloon later for a little pick-me-up, sweetie?$3",
  "fall_Sat10": "I went foraging for fresh mushrooms and cooked what I found. I saved some for you, dear![205]$4#$e#I wish Victor enjoyed mushrooms as much as I do.$6",
  "fall_Sun": "It's such a shame all Gotoro Empire imports are banned. They produce exquisite art and wine.$2#$e#I hope this war with them ends soon. So much violence over such trivial differences...$2",
  "fall_Sun6": "Hi, sweetie. Is this Sunday treating you well?$1#$e#Always a pleasure, dear.$3",

  //WINTER DIALOGUE    
  "winter_1": "My, my. That snow storm last night blanketed the entire valley.$6#$e#Keep yourself warm, sweetie. I wouldn't want you catching a cold!$3",
  "winter_7": "Hello, honey. Are you walking with all of us to the ice fishing spot tomorrow?$3#$e#I'd love to see you compete against Willy.$1",
  "winter_13": "I broke one of my Gotoran dishes this morning. Now I need to spend 6,000g to replace it. They're getting even harder to find.$2#$b#It's important that we treasure the things that remind us of where we come from, don't you think?$0", 
  "winter_21": "Caroline had an argument with Pierre today and vented to me about it afterward.$2#$e#I hope their marriage is okay.$2#$b#They're both strong people. I know they'll get through this.$0#$b#...I should check in on her. I wonder if she's talked to Jodi yet...$0",  
  "winter_24": "Hi, @! Are you keeping yourself warm this winter? The Feast of the Winter Star is tomorrow.$3#$e#I got the perfect gift. For who? It's a secret, dear!$1",
  "winter_28": "Spring is almost here, @! I need to hurry up and decide on what plants I'm going to plant in our backyard this year.$1#$e#Have a wonderful day, dear. Good luck with your farming in this coming season.$3",

  "winter_Mon": "I almost slipped on some ice today.$6#$b#Be careful when you're walking outside, dear.$2",
  "winter_Mon4": "Do you shop at Joja, @?$0#$b#It's not that I'll judge you if you do, sweetie. I just know that they cut a lot of corners and the quality of their product suffers.$2",
  "winter_Mon8": "You're one of my favorite people to talk with, @.$1#$b#You always have a wonderful story to tell.$6#$e#Can you tell me about the mines again?$3",
  "winter_Mon10": "My, my. Quite the chilly day.$0#$b#Perhaps we could settle on the couch with a nice cup of hot chocolate? I have a lovely mix I order from Grampleton.$1",
  "winter_Tue": "Today has been extraordinarily busy. I've earned a glass of a good wine tonight.$6#$e#Yes? Can I help you?$0",
  "winter_Tue2": "My mother and father are visiting soon. Everything has to be perfect!$0#$e#...Maybe you'll meet them someday, sweetie. Then you'll understand.$6",
  "winter_Tue8": "I bought some potted plants from Marnie. They're doing wonderful in the kitchen.$1#$e#I'd get some chickens from her too, but I wouldn't have anywhere to put them.$0",
  "winter_Tue10": "You know, I could perhaps give you some private yoga lessons if you're interested.$4",
  "winter_Wed": "Robin built our fireplace. She's an exceptional carpenter, and can build just about anything.$1",
  "winter_Wed4": "Caroline and Jodi don't drink at the saloon very often. Those two are always so busy.$2#$e#I enjoy our chats, sweetie. Let's talk again soon. And maybe you can join me at the saloon sometime.$1",
  "winter_Wed8": "Winter in Pelican Town is beautiful. All of the colorful decorations alongside the bright white snow makes every day feel so festive.$3#$e#Gus, Pierre, and Mayor Lewis do a wonderful and tasteful job with their decorating.$1#$e#This is such a wonderful place to make a home, isn't it, @? I'm glad you settled here too.$3",
  "winter_Thu": "I've been trying to get Jodi and Caroline to come to the bathhouse with me.$1#$e#It'd be such a wonderful lady's night. Making sure to take time to recover is important.$6",
  "winter_Thu6": "It's great to take a break from working on %farm Farm during winter, isn't it, @?$3#$e#I know you enjoy your work, but it's important to take breaks to care for yourself.$0",
  "winter_Thu10": "Don't tell Caroline or Jodi, but I'm contemplating retiring from stock trading.$3#$e#I'd like to spend more time on my hobbies, friends, and with you, of course.$1",
  "winter_Fri": "I special order my painting supplies from the Fern Islands.$3#$b#They're expensive, but it's important to have high-quality tools.$6",
  "winter_Fri8": "I finally managed to order a vintage that's in high demand from a vineyard just north of Grampleton. They gave me an extra bottle!$3#$e#I want you to have it, dear. Everyone should get to enjoy nice things once in a while, especially you.[348]$1",
  "winter_Sat": "Although I retired young, I still dabble in stocks.$0#$e#I'm adept at making quick money from trading.$6",
  "winter_Sat4":"I purchase all of my jewelry from Sautine City. Their jewelers are unrivaled in their craftsmanship and attention to detail.$0#$e#I'll make sure to show you the next piece I order.$6",
  "winter_Sat8": "It's a joy to see you, @.$3#$e#Ciao!$1",
  "winter_Sun": "I feel as if I'm starting to get sick. This winter has been unusually cold.$2#$e#I need to pay a visit to Harvey. We're fortunate to have an experienced doctor in the valley.$0",
  "winter_Sun4": "Sometimes I worry that during my time at Joja, I did more harm to the world than good.$2#$b#Over time, Joja has been pushing unhealthy foods, making decisions that are damaging the environment...it's irresponsible. That's part of the reason I left.$0#$b#I'm glad the path my life took led to us becoming friends.$1",
  "winter_Sun8": "Are you all right, @? You look a little pale.$6#$e#...Make sure you're taking good care of your health, sweetie. You might want to check in with Harvey.$6#$e#I wouldn't want anything to happen to you.$2",

  //EVENT DIALOGUE
  "Olivia_event1": "Oh, why of course.$1#$b#The lovely animals on our farm.$3",
  "Olivia_event2": "Oh, your grandfather?$0#$b#I can't imagine a scenario where he wouldn't be.$3",
  "Olivia_event3": "Ah, yes. The friendships you've made...$1",
  "Olivia_event4": "Oh, my. Quite the topic, dear.$6",
  "Olivia_event5": "I'm hopeful she'll overcome this...$2",
  "Olivia_event6": "A part of me believes that...$2#$b#She's hurting. She's lost loved ones, too...$2",
  "Olivia_event7": "Her daughter just turned six. Suki's shown me pictures, and she's absolutely precious.$3#$b#I hope I can visit next time she's in the valley...$0",
  "Olivia_event8": "It is. I can't stop thinking about all those hurt people out there...$2"
  
}
