{
  //SPECIAL DIALOGUE
  "patio_Olivia": "%farm Farm is such a beautiful, relaxing place.$3#$e#I'm so happy to be here with you, honey. I love you, and the life we're building together.$1#$b#Good luck with your work today.$3",
  "spouseRoom_Olivia": "I'm trying some Gotoran painting techniques I read about, but they're giving me some trouble.$0#$e#Maybe I should ask Leah for some help. I hate to bother her with amateur questions, but...$6#$b#If I can master these techniques, I can paint a truly moving portrait of you, sweetie. I'd like to do that.$4",
  "funReturn_Olivia": "Did you have a good day today?$0#$e#I found a bottle of some rare wine I've wanted to try up for auction, and managed to snag it for a great price.$3#$b#We'll have to find something to celebrate, so we have an excuse to open it.$1",
  "funLeave_Olivia": "Good morning, honey.$3",
  "OneKid_0": "I took my eye off %kid1 for a moment today, and they managed to get into my painting supplies!$6#$b#Our walls narrowly escaped an explosion of creativity.$1#$e#Maybe %kid1 will grow up to be a painter, too...$3",
  "OneKid_1": "Storytime with %kid1 today was so much fun, @! We took turns being animals in the jungle and making noises.$1#$e#I'd forgotten what fun it can be, raising a child this young. They see the world very differently.$0",
  "OneKid_2": "%kid1 has been quite the handful today. We had a record-breaking tantrum at naptime.$6#$b#Victor never threw tantrums. Maybe they get it from you, honey...$2#$b#What were you like as a child, I wonder?$4",
  "OneKid_3": "%kid1 reminds me so much of Victor at this age. So fond of listening to stories.$1",
  "OneKid_4": "I was just looking at %kid1 today, and saw so much of both of us...the best of both of us.$3#$e#I love you, @.$3",
  "TwoKids_0": "I think %kid1 is jealous of %kid2 for taking up some of my attention.$2#$e#I'm afraid they probably picked up their jealous streak from me, honey. Sorry.$2",
  "TwoKids_1": "Today, %kid1 and %kid2 got into a little tussle.$6#$e#Don't worry, it all worked out for the best. They love each other very much.$3#$b#But now that you're here, sweetie, I could use a break...$1",
  "TwoKids_2": "You know, after Victor, I swore off having children, but I don't regret starting a family with you at all.$3#$b#This is a new chapter for me, and I'm so happy to be living it with you.$1",
  "TwoKids_3": "I really love our little family here, sweetie.$1#$b#Let's try to all go out together soon when you aren't too busy with work. Maybe to the beach, or the park? Victor can come too.$3",
  "TwoKids_4": "Two kids at once are certainly a lot to manage. I could hardly keep up with them today.$6#$e#I'm not as young as I used to be, @.$2#$b#...I hope that doesn't bother you...$2#$e#%You hug Olivia.#$e#!!!$9",
 
  //SEASONAL DIALOGUE
  "spring_Olivia": "As much as I miss the hustle and bustle of the city, I do love the valley in the spring.$3#$e#Before we moved here, I'd never tasted such clean air.$1#$b#Let's take a walk around the woods later if you aren't too busy. I love to see everything starting to grow again.$3",
  "spring_1": "Spring is here, sweetie! I opened a nice bottle of a dry white wine for us to celebrate.$1#$e#In the spring, you don't want to drink anything too heavy or too sweet.$6#$e#It should be like the flowers, fresh and just beginning to bloom.$3",
  "spring_13": "Are you participating in the egg hunt today, honey?$6#$e#I know you like to win, but it might be nice for you and Abigail to give the younger ones a chance.$6",
  "spring_24": "I can't decide which dress I should choose for the dance today.$1#$b#I want to make sure it goes well with what you're wearing.$3#$b#I wish we went dancing more. It's so enchanting, being in your arms, listening to beautiful songs and surrounded by friends.$8",
  "summer_Olivia": "My, it's warm today, isn't it?$3#$b#I'd like to go paint somewhere scenic. Maybe by the sea, so I can take a break and go for a dip if it gets too hot!$1",
  "summer_1": "Have you figured out what you'll be planting this season, sweetie? I want to send some of this summer's crops back home to my parents.$0#$e#They don't believe me when I tell them I'm living on a farm!$3",
  "summer_11": "I know you'll call me a fanatic, honey, but you should think about adding a little red wine to the festival soup.$6#$e#A little wine in soup makes the flavor nice and rich. It's good for more than just drinking!$3",
  "summer_28": "Truthfully, the jellies make me a little nervous. They can sting, you know.$2#$e#It'll be romantic as long as you're there to hold my hand.$3",
  "fall_Olivia": "Fall is such a wonderful season for foraging in the valley. Even the most expensive imported mushrooms can't beat what you can find in the wild here.$0#$e#You should pick some mushrooms for our dinner tonight, sweetie.$3",
  "fall_1": "I want to paint the leaves changing in Cindersap Forest. That way, we can remember how the autumn looks all year long.$3#$e#It's a great opportunity to learn how to use colors with more nuance. And what a lovely painting it would be, if done well!$1",
  "fall_16": "I hope your display does well today.$3#$b#I know how hard you've worked to put together a fantastic representation of your work. I'm sure the mayor will agree.$1",
  "fall_27": "I confess I don't really see the appeal of Spirit's Eve. The things that are meant to be scary always just seem a little silly.$0#$e#And many of the decorations are just a bit...tacky.$2",
  "winter_Olivia": "I look forward to the days I do yoga, especially at this time of year. I get so stiff in the winter.$0#$e#I'd never call myself old, but these last few years I've really felt the cold weather.$2",
  "winter_1": "Winter puts a nice blush on your cheeks, @. It's very sweet.$4#$e#What a lovely time of year.$3",
  "winter_8": "I made some mulled cider for us to take to the festival today.$0#$b#It'll keep you warm while you outfish that silly fisherman.$3",
  "winter_12": "Stay warm today, sweetie.$0#$e#I'll be waiting with a glass of red wine so we can both warm you up when you're done with your work.$3",
  "winter_25": "I hope that you got your secret person a nice gift, honey!$1",
 
  //DAY DIALOGUE
  "Indoor_Day_0": "I'm feeling lazy today. I'm tempted to just stay inside and read.$6#$e#I do miss our library sometimes. I could pick any shelf and find a fascinating story to disappear into for hours.$3",
  "Indoor_Day_1": "Can we get a bigger tv, honey?$0#$b#We have enough space, and it'd be nice in the evenings.$1",
  "Indoor_Day_2": "The other day, I found a mouse, sweetie. A mouse!$0",
  "Indoor_Day_3": "Would a different wallpaper look better in our living room...? Or maybe a nice shade of paint...$1",
  "Indoor_Day_4": "Sometimes I feel so cooped up at home.$6#$b#I should go into the city more, sweetie. And you should come with me sometime!$3",
  "Outdoor_Olivia": "The second I step outside, my fingers start itching to paint.$3#$b#Nature has such an incredible palette.$1",
  "Outdoor_0": "Sometimes I think about going into the forest to bring home some mushrooms to cook, but I'm afraid I'll wander too far in and get lost.$6#$e#Will you go with me sometime?$1",
  "Outdoor_1": "The air on the farm smells so clean.$3#$b#If Victor comes over, we should have a picnic outside. He could use some fresh air.$0",
  "Outdoor_2": "Have you ever encountered any wild animals here in the valley, sweetie?$0#$b#I'm terrified of bears. I hope I never meet one.$2",
  "Outdoor_3": "I'd like to take another tour of the local vineyards soon.$3#$b#Even though the valley is small, the people here who make wine are surprisingly professional.$3",
  "Outdoor_4": "Hmm...I wonder if this would make a decent backdrop for my next painting...$6#$b#What do you think, @? You have a good eye.$3",
  "Rainy_Day_0": "Rain in the city felt so different. It was in everyone's way.$0#$b#Here, the rain is good for the crops and makes the landscape glow. It's not what I'm used to, but it's nice.$3",
  "Rainy_Day_1": "Rainy days are a red wine kind of day, don't you think?$0#$b#A little wine can boost your immune system against things like colds, you know.$3",
  "Rainy_Day_2": "On gloomy days, I just try to remember that this weather is good for the plants. I find it so dreary, though...$0#$e#Don't stay out too late, sweetie. I could use some company today.$3",
  "Rainy_Day_3": "The moisture in the air on days like this makes it hard to paint. It stays wet for ages, and everything takes longer.$2#$b#I suppose I'll have to find something else to occupy my time.$0",
 
  //NIGHT DIALOGUE
  "Indoor_Night_0": "How was your day, dear?$0",
  "Indoor_Night_1": "We should play a board game some evening.$0#$e#Watch out. I'm very competitive, and I love winning.$6",
  "Indoor_Night_2": "Should I pour us red or white tonight?$3#$e#Me? I just want whatever you're in the mood for.$6",
  "Indoor_Night_3": "I'm tired today. Let's get to bed early, @.$2",
  "Indoor_Night_4": "The bottle I opened is almost empty. Last glass of the night, sweetie. Let's make it count.$4",
  "Rainy_Night_0": "Do you think we should check on Victor?$0#$b#He can get very moody on rainy nights. I'm afraid he got that from me.$2",
  "Rainy_Night_1": "I hope things dry out by tomorrow. I'd really like to go for a walk, but I don't want to muddy my shoes.$0",
  "Rainy_Night_2": "There are many rainy nights like this in the Gotoro Empire.$0#$e#I hope everyone there is okay.$2",
  "Rainy_Night_3": "Rainy nights make me think too much.$0#$e#Can you distract me, @? I don't want to get lost in my memories.$2#$e#I love you too.$4",
  "Rainy_Night_4": "Be careful if you need to go anywhere tonight.$0#$b#I'd hate for you to slip and fall in this weather.$2",
 
  //AFFECTION DIALOGUE
  "Good_0": "Sometimes I look at you and can't believe that we found each other. We've been so lucky.$3#$e#I love you, @.$4",
  "Good_1": "@, I really didn't expect to find love again this late in life.$3#$b#I know I'm not old, but...I had settled into the idea of being alone.$2#$e#I'm glad I get to be with you, instead.$3",
  "Good_2": "Do you know what, @? You make me a better person.$3#$b#I can be...difficult. And snobby. But you've taught me a lot about being more patient and compassionate, sweetie. Thank you.$3",
  "Good_3": "You're the only one who knows how to pull me out of a bad mood quickly.$0#$b#I don't know why, but I feel like you really understand me. Thank you.$3",
  "Good_4": "Sometimes I look at you and can't believe that we found each other. We've been so lucky.$3#$e#I love you, @.$3",
  "Good_5": "Do you think we can take a vacation soon?$0#$b#Something romantic. Maybe the Isles.$4#$e#I want to see all the most beautiful places in the world with you, sweetie.$3",
  "Good_6": "I don't regret giving up trading to come live with you on the farm.$3#$b#I've found so much peace here with you.$1",
  "Good_7": "Do you ever dance, @? Besides the Flower Festival?$0#$e#When I'm with you, I'm in the mood to dance. Maybe we can take lessons sometime.$3",
  "Good_8": "In the city... everything moved so fast. I was always on my way somewhere, never pausing to pay attention to the world around me.$0#$e#It feels nice to slow down and enjoy life with you, @.$3",
  "Good_9": "Last night I had a dream about us growing old together.$0#$b#I know it's a little corny, sweetie. But it made me think about painting a portrait of us in our future, happy together.$3",
  "Neutral_0": "Can we take a trip to the desert sometime?$3#$e#I'd like to try some fresh cactus fruit.$1",
  "Neutral_1": "I'm thinking of putting together a group order for the town from some far-away vineyards. We could get a few cases for fairly cheap.$0#$b#We have a nice little community here, don't we?$0",
  "Neutral_2": "I'll be cleaning the farmhouse today, sweetie. Try not to track mud in on the floors.$0#$e#I know you're careful.$3",
  "Neutral_3": "Have you ever met the wizard who lives south of town?$0#$e#You're braver than I am. I admire your ability to befriend even the strangest people.$3",
  "Neutral_4": "I'd like to introduce you to some of my friends in the city sometime.$0#$e#I'm sure you'd get along well.$3",
  "Neutral_5": "Victor dropped off a book for you, sweetie.$6#$b#He said he thinks you'll enjoy it - it's a memoir from the early days of the Adventurer's Guild.$3#$e#I'm glad you two are getting along.$1",
  "Neutral_6": "One of the people who I met while I was a trader called today to tip me off on a great investment.$3#$e#It's a little tempting, but I'm fine where I am.$3",
  "Neutral_7": "Let's invite Victor over for dinner soon.$0#$b#I don't want him to feel like I'm leaving him behind by joining our family with yours. He should feel welcome here, too.$0",
  "Neutral_8": "I need to go into the city and pick up some painting supplies soon.$0#$e#I special order most of my supplies, but I still like to look around locally to see if anything unique pops up.$0",
  "Neutral_9": "Another day in the valley...$0#$b#The days seem to run together here, sometimes. We should do something soon to shake it up a little.$3",
  "Bad_0": "I had to scrap the painting I've been working on today. I just couldn't get it right.$2#$e#Maybe I'll take a break from painting for a while. I feel like I'm not making any progress at all.$2",
  "Bad_1": "Too bad wine can't solve all of my problems. But it can try.$2#$e#Don't worry, I'm kidding. I won't drink too much, even when I'm down.$0",
  "Bad_2": "I'm not feeling well. I should see Doctor Harvey.$2#$b#You might want to stay away, in case it's contagious.$2",
  "Bad_3": "I'm in a terrible mood, sweetie. I'd avoid me, if I were you.$5#$e#You didn't do anything wrong. I just get this way sometimes.$2",
  "Bad_4": "It's days like these that make me want to just stay in bed.$2#$b#Or shop. Maybe I'll take a trip into the city to cheer myself up.$6",
  "Bad_5": "The war with the Empire rages on, and the victims just keep piling up.$2#$b#It hurts to think about all of those people suffering.$2",
  "Bad_6": "I saw you talking to her in town, you know.$2#$b#Who? I shouldn't have to tell you. You know who.$5",
  "Bad_7": "Can't you see I want to be left alone?$5#$e#...I'm sorry, sweetie. I just need some space.$2",
  "Bad_8": "I dropped one of my rarest Gotoran china pieces today and it shattered.$5#$e#I'm furious with myself. It's irreplaceable.$2#$e#I don't want to think about it anymore.$2",
  "Bad_9": "I do love you, but some days I just think about Edward and how sad it all was...$2#$e#I'll tell you more about him someday... but not today.$2",
}