{
  "marriage.000": "Here for a visit? You're welcome here, as always. My apologies if I'm a little distracted.$0",
  "marriage.001": "If you wait just a moment, I'll let you take a taste of the potion I'm working on! Nothing dangerous, I promise you.$0#$b#We're trying to perfect a recipe that provides long-lasting night vision.$0",
  "marriage.002": "Oh, what a nice surprise! And good timing. I was about to disappear into a pile of books.$0",
  "marriage.003": "You're the most welcome distraction I've had all day.$0#$b#Lewis makes some very strange requests sometimes...$2",
  "marriage.004": "Ah, hello, @! You're welcome to stay while I work. I find your presence calming.$0",
  "marriage.005": "It's always a pleasant surprise when you come to visit me at my tower. I trust your day is going well.$0",
  "marriage.006": "I'm taking a break from teaching Morgan the next set of spells at the minute.$0#$b#They're performing very well in their lessons, but teaching magic wears me out a little.$0",
  "marriage.007": "Today, I'm teaching Morgan a number of different spells to transform one kind of fruit into a different kind.$0#$b#We're both more than a little hungry.",
  "marriage.008": "I have to keep reminding myself that Morgan is young. They have tremendous potential, but they need some time to grow into it.$0",
  "marriage.009": "It's been a long few days collecting mushrooms in the forest, but Morgan and I finally get to do some experimenting with new potion recipes today.$0",
  "marriage.010": "Morgan's potionmaking skills are coming along nicely. They mixed up an elixir of healing earlier that was just as good as anything I can produce.$0",
  "marriage.011": "Today, Morgan and I are brewing a potion of luck. Hopefully they don't make the same mistake they did last time.$0#$b#They spent a week tripping over every branch in the forest, and I broke *two* of my favorite mirrors.$5",
  "marriage.012": "Ah, I'm glad you stopped by! I wanted to let you know I might run late tonight.#$b#Today, Morgan and I have to take a trip deeper into the forest than usual for one of our lessons.$0",
  "marriage.013": "Morgan and I are assessing the wards in the forest west of here today.$0",
  "marriage.014": "I'm just finishing up here, @! I'm looking forward to spending the evening with you.$0",
  "marriage.015": "Just one more attempt at finishing this potion before I give up. At least it hasn't actually *exploded* yet.$0",
  "marriage.016": "I'll be home soon, I promise. I need to clean up a little around here first.#$b#I'm afraid that the more exciting magical research becomes, the more of a mess it makes.$0",
  "marriage.017": "I do wish Camilla would call me by my name, instead of 'Razzy.' ...No, don't you dare.$3",
  "marriage.018": "I haven't looked outside yet, but I hope Camilla took more care with where she landed this time.$0#$b#Last time I lost my favorite blackberry bush.$2"
}