{

"spring_Mon": "%Treyvon: I own a wholesale store in downtown Grampleton. I call it \"Treyvon's Essentials\".#$e#%Treyvon: I have a contract with \"Marnie's Ranch\" in Stardew Valley. I purchase milk and wool from her for my store.",
"spring_Tue": "%Treyvon: How's the farming life in Stardew Valley?#$e#%Treyvon: I'm glad it's working out well for you.",
"spring_Wed": "%Treyvon: Our neighbors are a friendly bunch. Sometimes we get together and have a BBQ!",
"spring_Thu": "%Treyvon: You better not be a fan of the Buffalos! This is a Tunnlers household!#$e#%Treyvon: *chuckle* We take gridball very seriously.",
"spring_Fri": "%Treyvon: I always look forward to reading the \"funnies\" in the weekend newspaper.#$e#%Treyvon: Do you have a newspaper delivery in your hometown?",
"spring_Sat": "%Treyvon: Ever heard of 'Sakura Vineyard' on the Grampleton coast? It's a popular tourist spot during this time of the year.#$e#%Treyvon: *chuckle* It's a bit too much on the expensive side for us.",
"spring_Sun": "%Treyvon: My pickup truck is my livelihood. I take good care of her.#$e#%Treyvon: Hank and I are looking into getting another car so he doesn't have to use my truck for work.",

"summer_Mon": "%Treyvon: Hey there, sport. What's going on in your neck of the woods?#$e#%Treyvon: Pelican Town sounds like a lovely community. Hank and I will need to visit the valley someday.",
"summer_Tue": "%Treyvon: Scarlett used to help out at my shop until she became a farmhand for folks in the valley.",
"summer_Wed": "%Treyvon: Most of our furniture was bought locally.#$e#%Treyvon: You won't find a finer table anywhere but from Grampleton!",
"summer_Thu": "%Treyvon: The tree shade helps keep Pondwood cool during hot summer days.",
"summer_Fri": "%Treyvon: Take a break from your farm work every now and then. It's important to avoid burning yourself out.",
"summer_Sat": "%Treyvon: Some folks spotted a coyote nearby. Give me a holler if you see it.#$e#%Treyvon: It's strange. They usually don't come near here because of all the dogs in the suburbs.",
"summer_Sun": "%Treyvon: Ah, nice of you to pay us a visit. Let me know if you need anything.#$e#%Treyvon: Do you and Scarlett have any plans today?",

"fall_Mon": "%Treyvon: My pickup truck is my livelihood. I take good care of her.#$e#%Treyvon: Hank and I are looking at getting another car so he doesn't have to borrow my truck for work.",
"fall_Tue": "%Treyvon: I've heard about %farm Farm in the paper. I didn't know you were famous!",
"fall_Wed": "%Treyvon: I'm incredibly proud of who Scarlett has become. She's my little angel.#$e#%Treyvon: I get the feeling she wants to own a farm someday, just like you.",
"fall_Thu": "%Treyvon: The latest news about the war has been grim lately...#$e#%Treyvon: I hope one day this all comes to an end and everyone can return home to their families.",
"fall_Fri": "%Treyvon: I could possibly contract with your mayor to purchase goods from your farm for my shop. What kind of products does %farm Farm produce?#$e#%Treyvon: Ah, you make a large variety of things. I can just imagine what your grange display looks like.",
"fall_Sat": "%Treyvon: Ah, visiting Scarlett today?#$e#%Treyvon: You two have fun, all right?",
"fall_Sun": "%Treyvon: How's the farming life in Stardew Valley?#$e#%Treyvon: I'm glad it's working out well for you.",

"winter_Mon": "%Treyvon: We're getting hit by a blizzard soon. Stay bundled up out there and be safe.",
"winter_Tue": "%Treyvon: Hey there, sport. What's on the agenda today?",
"winter_Wed": "%Treyvon: Be sure to shut the door on your way in. Don't want to heat up the whole neighborhood now!",
"winter_Thu": "%Treyvon: This time of year always gets me in the mood to curdle up by a fire with a nice cup of hot chocolate.",
"winter_Fri": "%Treyvon: You better not be a fan of the Buffalos! This is a Tunnlers household!#$e#%Treyvon: *chuckle* We take gridball very seriously.",
"winter_Sat": "%Treyvon: Our heating bill is a tad higher this year. I wonder if she's messing with the thermostat again...",
"winter_Sun": "%Treyvon: I bet you have a lot of free time during winter.",

}
