{

"spring_Mon": "%Hank: The Tunnlers are doing great this year! They just might make it to the finals!",
"spring_Tue": "%Hank: Treyvon and I worked hard to pay off this house. It feels good knowing it's ours.",
"spring_Wed": "%Hank: Hey, you're a farmer, right? Tell me... why did the chicken cross the road?#$e#%Hank: To get to the other side! Haha!#$e#%Hank: Wouldn't you agree that was an \"eggsellent\" joke?#$e#%Hank: Well, it was funnier in my head.",
"spring_Thu": "%Hank: Hmm. I should mow the lawn soon.#$e#%Hank: We bought a rechargable LV2103 lawn mower last year. It does the job.",
"spring_Fri": "%Hank: The Pondwood suburbs are nice and quiet, which is just what I like.#$e#%Hank: Lot's of critters call this place their home too. I once saw a bear in our backyard.",
"spring_Sat": "%Hank: I gotta head over to \"Homeland Depot\" soon to pick up supplies for a new job.#$e#%Hank: I build and repair a range of things for a bunch of individuals and businesses!",
"spring_Sun": "%Hank: Hey, it's good to see you.#$e#%Hank: *chuckle* I'm sure you didn't come all this way just to visit me. Scarlett should be around somewhere.",

"summer_Mon": "%Hank: My husband and I painted the house ourselves. We almost went with a blue color scheme.#$e#%Hank: It used to be white, which I wasn't a fan of.",
"summer_Tue": "%Hank: Hey. Good to see you.",
"summer_Wed": "%Hank: I'm trying out this new diet plan. It's going well.#$e#%Hank: Ever heard of the keto diet? It's where you cut out all the carbs and replace them with protein and fat.",
"summer_Thu": "%Hank: I want to install a pool someday on our property. It'd cost an arm and a leg, but I feel like it'd be well worth it.#$e#%Hank: Think about all the pool parties we could have! We'd be the coolest house in the suburbs.",
"summer_Fri": "%Hank: Scarlett is home today if you're lookin' for her.",
"summer_Sat": "%Hank: You won't find better hardwood south of Grampleton.#$e#%Hank: Lot of folks take up forestry as a profession in the region.",
"summer_Sun": "%Hank: The new gridball season is starting soon. Can you believe they traded Jackie? Utter fools!",

"fall_Mon": "%Hank: I don't want to see you snooping around our room, alright?#$e#%Hank: We value our privacy.",
"fall_Tue": "%Hank: When I was your age I worked a bunch of odd jobs.#$e#%Hank: In a strange way, I'm still doing the same thing but professionally!",
"fall_Wed": "%Hank: I always appreciate the colors of this season.#$e#%Hank: One of our neighbors down the road goes crazy with their Spirit's Eve decorations. It's really a sight to behold.",
"fall_Thu": "%Hank: There's nothing but bad news overseas. I somehow feel like it's worse than it actually is.",
"fall_Fri": "%Hank: Everyone in Pondwood is trustworthy. You'll find most folks leave their doors unlocked.",
"fall_Sat": "%Hank: *sigh* I need a vacation soon. I heard the Fern Isles are nice this time of year.",
"fall_Sun": "%Hank: Our 'EVA POWER 2000 Leaf Blower' makes yard cleanup easy. Much better than using a rake.",

"winter_Mon": "%Hank: *cough* *cough* I think this weather is getting the better of me...",
"winter_Tue": "%Hank: Scarlett loves goat cheese and cherries. If you want to get on her good side, try gifting her those things.#$e#%Hank: Haha, me? I'm more of a steak kind of guy.",
"winter_Wed": "%Hank: Don't touch the thermostat.#$e#%Hank stares at you with a serious look on his face.",
"winter_Thu": "%Hank: It gets cold here during this time of the year. Warm yourself by the fire.",
"winter_Fri": "%Hank: I'm on call for a job today. Not much to do besides enjoying a hot drink and watchin' gridball.#$e#%Hank: Are you a Tunnlers fan? We have seasonal passes to the games.",
"winter_Sat": "%Hank: Gotta shovel snow off the driveway soon. You can't let it build up too much.",
"winter_Sun": "%Hank: *chuckle* I'm sure you didn't come all this way just to visit me. Scarlett should be around somewhere.",

}