
{
  //SPECIAL DIALOGUE
  "Introduction": "Oh, hey there! You're the new owner of %farm Farm!$1#$b#I'm Victor. It's a pleasure to meet you... @, is it?$3",
  "danceRejection": "Sorry. I'm not sure if I even want to dance myself...$0",
  "divorced": "@... you... you broke my heart. I put my life into you and you... do this to me?$2#$b#Please...$2#$b#Tell me what I did wrong. What did I do? Did I hurt you?$2#$e#@, please...$2",
  "secondChance_Boys": "You want to give our relationship another go, @?$6#$b#I'm not so sure about this...$2#$b#You really hurt me when you divorced me, @. I should take more time to think about this, but...$2#$b#I want to give us another chance too!$3#$b#I feel like we can both learn from our mistakes and build our relationship into something healthy.$4#$b#This will require effort from both of us, but I believe we can make it work.$3",
  "dumped_Boys": "@, don't talk to me...$2#$b#We are not friends. Not after what you did...$2",
  "breakUp": "Wh-what? A wilted bouquet?$2#$b#Ugh. It was something stupid I did, wasn't it?$2#$e#So, we're back to being friends I guess?$0",
  "pamHouseUpgrade": "I'm impressed Robin can build a house that fast.$0#$b#I wonder how she does it?$1",
  "pamHouseUpgradeAnonymous": "I'm impressed Robin can build a house that fast.$0#$b#I wonder how she does it?$1",
  "stardrop_gift": "Hey there, sweetie. I bought this stardrop fruit for you.$4#$b#It came all the way from the Fern Islands! It's fresh from a healthy Cellstar tree.$1#$b#I love you, honey.$4",
  "give_flowersA": "You want to date me, @? I feel the same way! I was a bit too nervous to make the first move.$4#$b#I'm happy you did, @. You just made me the happiest person alive!$1",
  "give_flowersB": "I didn't know you felt the same way, @. This makes me so happy!$4#$e#I'm a bit nervous, aren't you?$4",
  "give_pendant": "!!!$7#$b#You... you want to get married? Is this you proposing to me, @!?$7#$b#I accept! I'm so excited to spend the rest of my life with you. I'll let Mayor Lewis know. Oh, I need to let my mom know too!$1",
  "rejectNPCA": "Uhh... no thanks, @.$0",
  "rejectNPCB": "I don't feel the same way, @. I'm sorry.$2#$e#What else do you want me to say? I said no.$0",
  "reject_two_heartA": "@, I don't like you that way. I don't mean to disappoint you.$2",
  "reject_two_heartB": "I don't think it's a good idea for us to date, @.$0#$e#I don't know you well enough.$0",
  "reject_four_heartA": "I'm not ready for a commitment like this. I'm sorry, @.$2#$e#I said I'm not ready.$5",
  "reject_four_heartB": "@, I... really like you but...$2#$b#I don't think I'm ready to date you. I'm sorry.$2",
  "engageA": "Uhh... I'm going to pretend you didn't just do that.$0#$e#Leave me alone, @.$5",
  "engageB": "Are you trying to cheat on your spouse with me!? What's wrong with you?$5#$e#You're disgusting. Get away from me.$5",
  "marriedA": "@? What are you doing? What would your spouse do if I told them you just tried this on me?$5#$e#I won't tell your spouse. Please. Just... stop.$2",
  "marriedB": "You want to marry me? You're already married, @. Please stop.$2#$e#@. Are you drunk or something? Go away before I tell your spouse.$0",
  "refusal_knownA": "I think we need to spend more time together before we can take that step, @.$6#$e#Sorry. I didn't mean to bring down your mood. It's important I'm transparent about this.$2",
  "refusal_knownB": "It's a little too early for this, don't you think?$0#$e#I appreciate the thought, @.$6",
  "refusal_botherA": "Uhh... It's still a no, @. Sorry.$0",
  "refusal_botherB": "Perhaps some day.$1",
  "refusal_no_heartsA": "That looks pretty. Did you buy it from a ghost on the beach?$0#$b#I've read books about mariner ghosts that sell mermaid pendants.$6",
  "refusal_no_heartsB": "So. Here's what's going to happen, @. I am going to walk away and pretend you never did that.$0",
  "Resort_Entering": "What a beautiful remote beach!$1",
  "Resort_Leaving": "There's sand stuck in my hair...$2#$b#Nothing a hot shower can't solve! Back to Stardew Valley!$1",
  "Resort_Shore": "I wonder what those other islands out there are like...$1",
  "Resort_Chair": "Have you explored much of the island, @?$3#$b#A place like this is bound to harbor a great many mysteries.$1",
  "Resort_Bar": "Gus has quite the tropical drink menu! I think I'll have the 'Ring Fruit Sunrise'!$1",
  "Resort": "I've read about that volcano in an adventurer book.$3#$b#A clan of dwarves used lava as an energy source!$1",
  
  //SPECIFIC TILE DIALOGUE
  "Custom_JenkinsHouse_23_25": "Sophia and I are watching 'My Villain Academia' today. Should be interesting.$3",
  "Custom_JenkinsHouse_31_11": "I had fun watching anime with you, Sophia.$3",
  "Custom_JenkinsHouse_21_39": "It was great hanging out with you, Sophia.$1",
  "SebastianRoom_5_9": "Greetings, @. We're playing 'Solorian Chronicles'.$1",
  "Saloon_40_18": "Perhaps I'll indulge myself with some top shelf wine soon.$1",
  
  //EMPLOYMENT QUESTION - SPRING YEAR 1 ONLY
  "spring_Wed_1": "It's been some time since I graduated from Pellcar University.$6#$b#My mother has been nagging me to get a job somewhere. Anywhere.$2#$e#I understand I need to find a job but... I just... I need more time.$2#$q 1001/1002 jobquestion_followup#Do you think I'm lazy because I haven't found a job yet?#$r 1001 50 jobquestion_no#You aren't lazy, Victor. You need more time to decide what you want to do. Look at me! I didn't know what I was doing until recently.#$r 1002 0 jobquestion_neutral#You could try out a part-time internship to see if it's something you like. At least your mom would get off your back?#$r 1002 -125 jobquestion_yes#I wouldn't call it lazy but... you've been out of school for over a year, Victor.",
  "jobquestion_no": "That's right. You used to work in accounting at Joja. You completely switched gears and became a farmer.$3#$b#Your story gives me hope for my future, @. Thank you.",
  "jobquestion_neutral": "I could possibly look into that. Feel out the work environment. See if I enjoy it.$6",
  "jobquestion_yes": "Hmm... I see. You're right. I need to apply myself more.$2",
  "jobquestion_followup": "$p 1001#I need to apply myself more to following my dreams!$1|I need to ponder to myself for a while, @. Thank you for the chat.$6",
  
  //ZUZU CITY QUESTION
  "summer_Thu": "I've been thinking of my life back in Zuzu City. It was so... chaotic and noisy.$0#$e#Living here in the valley is certainly different from the city.$1#$q 3001/3002 city_followup#Do you miss living in the city?#$r 3001 15 city_yes#Yes, I do.#$r 3002 15 city_no#No, I don't.",
  "city_yes": "Not surprising. Cities have all the jobs. Unless you're willing to be self-employed it's difficult to make a living out here.$0",
  "city_no": "I have some family in Zuzu City. My mother and I take trips to visit them once in a while.$3",
  "city_followup": "$p 3001#I appreciate our chats, @.$1|I appreciate our chats, @.$1",
  
  //SPECIFIC MAP AND COORDINATES DIALOGUE
  "JenkinsHouse_31_5": "Uhh... this is a little weird. Can't you see I'm in bed?$2",
  "JenkinsHouse_6_8": "I'm brushing my teeth.$0",
  "BlueMoonVineyard": "Quite the view of the Gem Sea. Sophia has the best view in town.$1",
 
  //SPRING AND GENERAL DIALOGUE
  "spring_1": "Happy spring, @.$3#$e#What are your goals for this year? I want to read at least one book a week.$1",
  "spring_15": "There are eight bridges in Stardew Valley. Over half of those are in Pelican Town.$3#$b#There are also many small wooden makeshift bridges everywhere, such as the one at the beach.$1#$e#It's incredible that bridges can allow different communities to connect with one another.$1",
  "spring_23": "I wonder if Sophia is bringing her special iridium-quality wine to the flower festival?$0#$e#I'm not that great at dancing.$2",
  "spring_28": "Summer can't come soon enough. I'm looking forward to going to the beach more often.$1",
  
  "Mon": "Hey there. How's your Monday?$0#$e#I need to write a lot of emails today. I'm not looking forward to it.$2",
  "Mon6": "I'm in the middle of reading a book about sightings of mysterious creatures in the Gem Sea.$3#$b#This book has been in my family for a long time!$1",
  "Mon10": "I have bridge schematics to look over tonight.$0#$e#I'm looking forward to it!$3",
  "Tue": "Ugh... I need to go to Pierre's for groceries soon. I don't know why my mother doesn't just hire a butler already.$6#$e#Hey, are you thinking about a part time job?$1#$e#Oh. That was... rude wasn't it? Apologies, @. I lost my composure.$2",
  "Tu2": "*sigh*... Tuesday. This is the day when I do laundry.$2",
  "Tue6": "How's your day, @? Do anything productive?$1#$e#I may work more on one of my projects later.$1#$e#It's good to keep yourself busy with something.$3",
  "Wed": "Uhh. Hi.$0#$e#Can I help you?$0",
  "Wed2": "I hope the day is treating you well.$3",
  "Wed8": "@, I was just thinking about you.$1#$e#You always seem to keep yourself busy. You're a good role model.$3",
  "Wed10": "Hey. Here's a bottle of wine from the cellar.[348]$1#$e#Uhh. I'll see you around. Let me know if you like it!$3",
  "Thu": "Have any plans today? I think I may continue work on a project I'm in the middle of.$0",
  "Thu6": "It's good to see you, @. I accomplished a lot today! I hope you did too.$1",
  "Fri": "Greetings, @! I hope the day is treating you well.$0",
  "Fri6": "I'm quite good at Journey of the Praire King, if I say so myself!$3#$e#It's because I play video games a lot.$1",
  "Sat": "So, are you enjoying living in Stardew Valley?$0#$e#That's great.$0#$e#...$0#$e#Uhh. Alright. Great chat. I'll see you around I guess?$2#$e#Bye, @.$0#$e#%Victor doesn't want to chat anymore.",
  "Sat2": "Although it's the weekend, I have a ton of work to do today.$2#$e#It's what I get for procrastinating.$0#$e#Might play some Personable 5 later.$3",
  "Sat6": "I have a lot of free time today. Should I start a new book? Or perhaps pick up one of the video games I've been playing?$0#$e#I think I may play some games!$1",
  "Sat10": "I had a dream last night where I was living away from home.$0#$e#It was strangely invigorating.$1",
  "Sun": "Uhh. Hi.$0#$e#Nice day today, isn't it?$0#$e#...$0",
  "Sun2": "Have any plans for today?$1#$e#Me? I think I may keep playing through the Legend of Lonk. I'm stuck in a water dungeon right now.$0",
  "Sun8": "Video games are amazing in their own unique way, same with books.$3#$e#Nothing else really pulls you into a completely different world.#$b#It's healthy to take a break from reality, wouldn't you say?$1",
  "Sun10": "Ever thought about building more bridges at %farm Farm?$3#$e#Oh. Just asking for uhh... reasons.$2#$e#%You give Victor a skeptical look.#$e#Hah. Nothing gets past you, does it, @?$3",
  
  //SUMMER DIALOGUE
  "summer_1": "Summer in Stardew Valley is alright. Not too warm. Not too cold.$3#$e#It's perfect.$1",
  "summer_3_1": "Did you hear that explosion last night? Joja blew up the rocks blocking Susan's house.$6",
  "summer_11": "My mother and I pour some of our best wine into the adult food pot.$1#$e#It only takes one bad ingredient to ruin all of the soup. Be careful what you put in it.$2",
  "summer_15": "My mother was a senior accounting manager at Joja's International Shipping Branch.$3#$e#She received a lot of money and bonuses at her job, then made even more when she cashed out her stock.$1#$b#She does daily stock trading now. I can't see myself trading.$0#$b#Stock trading sounds a bit unfulfilling in my opinion, but we each have our destiny.$1",
  "summer_24": "My seamstress in Chestervale made this shirt for me. I always custom order my clothes from her.$3#$e#Your outfit looks great on you. Where did you buy it from?$1",
  "summer_28": "Moonlight jellies are some of the most beautiful creatures in the Gem Sea.$3#$b#I look forward to seeing them each year.$1",

  "summer_Mon": "This summer heat is blazing this year. Good thing we have a high-powered AC.$0", 
  "summer_Mon2": "I was at Pierre's a couple days ago and I saw Susan buy over 200 bags of seeds.$6#$b#I bet next season will be profitable for her.$3#$e#I'll see you around, @.$1",
  "summer_Mon4": "I accidentally dropped one of my mother's fancy wines yesterday...$2#$b#Had to spend some of my allowance to buy another iridium-quality bottle at Blue Moon Vineyard from Sophia.$6",
  "summer_Mon8": "I know that I am kind of a 'nerd', but you don't judge me for it.$1#$e#You're a good friend, @.$3",
  "summer_Tue": "I received an email today with a job offer from a reputable architecture firm.$6#$b#It's all the way across the country and I'm not comfortable traveling that far away.$2",
  "summer_Tue4": "Hi, @. I'm just thinking at the moment.$6#$e#I umm...$2#$b#sometimes I... feel like people are nice to me just because I'm wealthy. It's hard to trust people.$2",
  "summer_Tue6":  "... Look. It's not like I think having money makes my life harder, it's that it comes with its own set of-$5#$b#Oh! @!$7#$e#Sorry. I didn't see you there. I was... continuing an argument I had earlier.$2#$e#I just want to be ready with my response the next time they start that fight with me.$2",
  "summer_Tue8": "I worked on a complex math problem for a big chunk of my day today.$0#$e#I'm happy to say I solved it. I always welcome an intellectual challenge!$1#$e#I do enjoy our chats. Have an excellent day, @!$1",  
  "summer_Tue10": "I'm learning a lot apprenticing with Ralph, Grampleton's bridge engineer.$1#$e#They definitely don't teach you everything in school.$3",
  "summer_Wed": "Hi, @. How is this summer heat treating you?$1",
  "summer_Wed4": "I discovered a note today in our library. My mom has notes on Gotoro wine storage techniques.$2#$b#She could get in trouble if the wrong people found out. It's banned material in the Ferngill Republic.$0#$e#Don't tell her I told you this.$6",
  "summer_Wed8": "It's great to see you. I hope you're having a productive day today!$1#$e#Oh, me? I'm trying my best to stay cool in this summer heat.$3",
  "summer_Thu": "Hmm... I need to think about what I need to do today.$0",
  "summer_Thu4": "Sometimes I reminisce about my engineering curriculum at Pellcar University.$6#$b#Life was so simple back then.$2#$e#No one told me 'adulting' would be like this. You're off on your own with no one to guide you.$0",
  "summer_Thu8": "Did you dream about being a farmer when you were young, @?$0#$e#I admire you a lot for following your passion this way. More than you know.$3#$e#You're one of the most dedicated people I've ever met. I feel like I have a lot to learn from you.$3",
  "summer_Thu10": "Want to grab a drink together at the saloon tomorrow?$3",
  "summer_Fri": "...Sorry, @. I have a lot on my mind today. I'm not exactly in the best mood.$2#$e#Can you leave me alone?$2#$e#@... I'm serious.$5#$e#...$5#$e#You know what? Here's a chunk of money. Go buy yourself a couple drinks and leave.[336]$2",
  "summer_Fri4": "I guess I get my moodiness from my mother. Sometimes, we end up just spending our evenings sulking in silence together.$2#$e#I hope you don't take it personally when I'm short with you, @. You know I enjoy your company when my own mood isn't getting in the way.$3",
  "summer_Fri8": "We should get ice cream together sometime soon.$1#$e#Alex said they have a new 'plant based' ice cream. It's apparently healthier for you.$3",
  "summer_Sat": "I tipped Gus 800g for my drink the other day.$6#$b#He mentioned the saloon isn't doing that well financially because some people aren't paying their tabs.$2",
  "summer_Sat4": "Did you know that a huge part of the Ferngill Republic Industrial Revolution was because of dwarvish technology?$1#$b#Scientists were able to replicate their gadgets and modernized them for human applications.$3#$e#Talk to you later, @.$3",
  "summer_Sat8": "There's part of a dwarvish novel I recently finished that described the ancient cities of the dwarves in the Cascadian Mountain range.$1#$e#Their cities were once huge hubs of commerce for the ancient dwarvish people.$7#$b#To this day, we still don't know that much about them...$2#$b#We find their gadgets here and there and know some of their history, but that's really it.$0#$e#I'll see you around, @.$3",
  "summer_Sun": "News said the Ferngill Republic Investigative Agency wants to clear-cut forests here in Stardew Valley.$5#$b#The agency strongly believes they can find magical artifacts that will turn the tide of war with the Gotoro Empire.$0#$e#That wizard in the tower isn't allowing them to proceed.$6",
  "summer_Sun4": "Oh, hey! What's on your agenda today?$1",
  "summer_Sun10": "Hey, @. I have leftover material from a project. Do you want it?$1#$e#Here! I'm positive you'll find a way to make use of it.[335]$3",
  
  //FALL DIALOGUE
  "fall_1": "Fall is finally here. The colors of this season are beautiful.$1",
  "fall_8": "There are eight bridges in Stardew Valley. Over half of those are in Pelican Town.$3#$b#There are also many small wooden makeshift bridges everywhere, such as the one at the beach.$1#$e#It's incredible that bridges can allow different communities to connect with one another.$1",
  "fall_15": "Hey, @. Looking forward to the Stardew Valley Fair tomorrow?$3#$b#You're setting up a grange display right?$0#$e#Well, good luck! I'm positive you'll do great.$1",
  "fall_27": "Spirit's Eve is my favorite festival. I wonder how difficult and scary the maze will be this year...$1#$e#The wizard uses magic to summon the maze. It makes you wonder what else he has the power to do.$0",
  "fall_28": "Winter's on its way... I always think I can smell it in the air, but maybe that's just wishful thinking.$0#$e#Winter is an excellent time to have your own library, @.$3",

  "fall_Mon": "I heard rumors that the family that lived in our house before us didn't get along with Mayor Lewis.$0#$e#My mother knows about it, but won't tell me.$6",
  "fall_Mon4": "Sometimes I get too caught up in thinking about the past to think about the future.$0#$e#I guess it can feel like the shadows the past cast over us make it hard to see.$2#$e#...Eh, sorry for being dramatic, @. I appreciate you putting up with the nonsense I talk about when I'm feeling glum.$3",
  "fall_Mon8": "Hey there. If you want a cup of coffee, feel free to drop by some time.$3#$e#I appreciate your company.$1",
  "fall_Tue": "Maru helped me solve a calculus problem yesterday with my project. She has a very unique way of approaching things.$3#$b#Very resourceful!$1#$e#Have a nice day, @.$3",
  "fall_Tue4": "Having a dilemma with a project I'm coding. It has to do with a compiling error.$0#$e#I love troubleshooting problems. It just means there's something concrete to fix and work toward.$1",
  "fall_Tue10": "*yawn* I was up all night working on new bridge plans.$0#$e#It was fun!$3",
  "fall_Wed": "I'm going to visit Sophia tomorrow at her vineyard.$3#$b#While I'm there, I'll pick up some more of her iridium-quality wine. It's one of my mother's favorites.$1",
  "fall_Wed6": "It's a chilly day today. Keep yourself bundled up, @.$1",
  "fall_Wed10": "My mother is serving mushrooms with dinner tonight...$2#$e#Maybe we could plan a dinner at your house?$1#$e#I make exquisite spaghetti!$3",
  "fall_Thu": "Marlon was with several monster hunters from Castle Village the other day.$0#$b#I could have sworn I also saw the Wizard with them too.$1#$e#I think they were having a secret meeting or something.$6",
  "fall_Thu2": "My mother and I moved to Stardew Valley from Zuzu City.$6#$b#The valley is quiet compared to the urban environment.$3#$e#You used to live in Pine-Mesa City right? You can understand what I mean.$1",
  "fall_Thu8": "Do you ever get scared when you're heading off to adventure, @?$0#$e#...I've probably said this before, but I really envy your bravery. I feel so useless sometimes.$2#$e#I should find my own way to make meaning in the world? Wise words, probably. Let's see if I listen to them.$3",
  "fall_Fri": "It's good to see you, @. I feel like taking a hike up to the summit tomorrow.$1#$b#The view up there is amazing during this time of year.$3",
  "fall_Fri6": "My mother picked up painting as a hobby some several years ago.$0#$b#She's developed a lot as an artist.$3#$b#It really goes to show that practice makes perfect.$1#$e#Just look at how much you've learned from when you started farming!$1#$e#I hope you have a great day, @.$3",
  "fall_Fri8":  "Do you... think you could ever teach me one of your skills, @?$0#$e#Oh, none in particular, but I watch my mother picking up new skills and I'm envious.$0#$e#It'd be nice to try something new soon.$0",
  "fall_Sat": "The homeless guy that lives in the tent in the mountains looks familiar to my mother.$0#$e#She thinks she has seen him somewhere else before. Weird, right?$0",
  "fall_Sat4": "I saw Linus walking around Pelican Town last night. I felt bad , so I offered him 1,000g.$2#$b#He... turned it down. Said he didn't need it because the valley gives him everything he needs.$0#$e#I guess I'm just... not sure what he meant by that.$6",
  "fall_Sat8": "If you're up for learning something new, just let me know!$1",
  "fall_Sun": "I'm reading a book called 'Legends of the Dwarves'. It's about several dwarvish mountain ranges and advanced ancient technology.$3#$b#One of those mountains is here in Stardew Valley, Corneal Mountain!$1",
  "fall_Sun4": "*sigh* I have chores to do today. I'm not looking forward to it.$2",
  "fall_Sun8": "Hey, @! How's work going on %farm Farm?$3#$e#That's good to hear!$1", 

  //WINTER DIALOGUE    
  "winter_1": "That was quite the snowstorm we had last night. I can't see a single blade of grass anywhere.$6#$e#Be sure to bundle up and stay warm, @.$3",
  "winter_7": "Ready to make the trek into the forest tomorrow for the ice fishing festival, @?$1#$e#I enjoy walking with everyone to Cindersap Forest.$1#$b#It gives me an opportunity to talk to Sophia and Sam. I don't see them very often.$3",
  "winter_17": "I bought magical totems from a blue cloak figure at the market last night.$3#$b#That person looked strangely familiar...$0#$e#I think it might be the Wizard from 'The First Slash' in the Fern Islands.$1",
  "winter_24": "I wonder who my secret gift giver is this year for the Feast of the Winter Star.$0#$e#I hope it's Sophia!$1",
  "winter_28": "Winter is almost over. Can't wait to spend more time outside and enjoy the weather.$3",

  "winter_Mon": "Hey, I'm in the middle of something.$6#$e#...$0#$e#Uhh... here. This'll buy you a game of Prairie King.[384]",
  "winter_Mon4": "Ever wonder what the elves were like? I'm reading a book about them.$1#$b#They used to be the most prominent race on the planet until they went extinct. No one knows why they disappeared.$0",
  "winter_Mon8": "I was playing Journey of the Prairie King a couple days ago and almost beat it.$1#$b#Apparently, if you beat the game, there's a chance you'll get the arcade machine delivered to you.$3#$e#If I really wanted it, I'd just buy it though.$0#$e#...No, you're right. It wouldn't be the same. I shouldn't lean on being able to just buy whatever I want. Sorry.$2",
  "winter_Mon10": "Do you tailor your own clothes? Your outfit is sharp.$1",
  "winter_Tue": "Most of our furniture was handcrafted in Grampleton.$3#$b#The artisan woodworkers there are some of the best in the world.$1",
  "winter_Tue4": "I sure could go for a peppermint coffee.$3#$e#If there's anything I enjoy about winter, it's the seasonal food and drinks.$1",
  "winter_Tue8": "Hi, @. We should grab a peppermint coffee together sometime.$1#$b#I'll pay for your coffee! Gus uses organic peppermint candy.$3",
  "winter_Wed":  "Once you study physics for long enough, it's hard not to look at the world and start calculating how it works in your head.$0#$e#No, it's not necessarily a bad thing.$0",
  "winter_Wed4": "When I was attending university, there was a professor teaching my advanced physics class named R. Peterson.$3#$b#He used to work closely with a wizard at the Fern Islands archipelago.$1#$b#You'd be amazed at how the laws of physics apply to the magical world too.$7",
  "winter_Wed8": "I wonder if there are any book shops in Zuzu City I haven't visited yet...$0#$e#I'm always looking to expand our book collection, especially when it comes to the intersections of magical and scientific theory.$0#$e#Did you just yawn, @?$1",
  "winter_Thu": "*sigh* I've had a rather rough day today. Playing some video games would be a great way for me to unwind a little.$2",
  "winter_Thu4": "I love reading about history, fiction or not.$3#$e#It's nice to dive into a different world and lose yourself in it for a while.$0",
  "winter_Thu8": "I designed a prototype trestle bridge for fun today in a simulation program I created. These types of bridges are useful if you need to cross over marshes or shallows.$1#$e#Trestle bridges are cheaper to build than other types of bridges because they use wooden supports instead of stone or steel.$3#$e#It does sound a bit like a video game, doesn't it? You'd be surprised how many skills you learn in games come in handy elsewhere.$3",
  "winter_Fri": "The game developer of Journey of the Prairie King, ConcernedMonkey, is making another game!$1#$b#Given how amazing JPK is, I must say I am absolutely looking forward to playing it.$3",
  "winter_Fri4": "I wonder what I should pick up at Pierre's during my next trip?$0#$e#I'm thinking spaghetti ingredients!$1#$e#Do you ever make spaghetti? It's delicious! I'll share my recipe for sauce with you sometime.$1",
  "winter_Fri8": "Hmm... do you think anyone would be interested in a bridge-making simulation game, @?$0#$e#...I feel like a lot of people might assume it would be boring, but I bet I could make it fun.$3",
  "winter_Sat": "My mother made 80,000g last night from a stock trade. I think she's going to spend it on expensive wine again.$0",
  "winter_Sat4": "I like wine, but not quite as much as my mother does.$3#$e#Well...I'm not sure if there's anyone in the world who likes wine as much as she does.$1",
  "winter_Sat8": "I spend a lot of time with my mother, since we live together.$0#$b#We don't have much in common, so sometimes it's a little...tense.$2#$e#I just feel like I'm more willing to compromise for her than she is for me.$2",
  "winter_Sat10": "Hey. Want some leftover spaghetti?$1#$e#Here!$3[224]#$e#Maybe we can grab a meal together next time?$3",
  "winter_Sun": "I've been procrastinating on my coding project. Perhaps I should get back into it today?$0#$e#It's always a pleasure to see you, @. Have a nice day.$3",
  "winter_Sun4": "I'm building a computer for someone in Chestervale, the same city where I get my clothes tailored.$3#$b#He has a lot of RAM in his build. Probably running a lot of processes that suck up memory, like video rendering.$0#$e#Building computers is a hobby of mine! I'm happy some people seek me out to put together components for them.$1#$e#Let me know if you ever want me to put together a machine for you, @. Friends get a discount.$3",
  "winter_Sun8": "Hey there, @. Certainly a chilly day today.$0#$e#Visit the house sometime. I'll make you a cup of coffee.$1",
  }
