
{
  //SPECIAL DIALOGUE
  "Introduction": "Um... Greetings! My name is Morgan. I'm a pupil of Magnus Rasmodius. What's your name?$0#$e#It's been a pleasure!$1",
  "Resort_Entering": "Whoa! The volcano looks so big this close!$5",
  "Resort_Leaving": "Nyahaha! That was fun! I want to visit the island again soon!$3",
  "Resort_Shore": "The birds act kinda strange...$0#$e#I duck my head as they fly by.$8",
  "Resort": "Can you feel the mana here, @? It's really strong.$1#$e#I think it's coming from the volcano!$5",

  //SPRING DIALOGUE	
  "spring_12": "Magnus and I are traveling deep into the forest tomorrow.$1#$b#I won't be attending the town festival.$0#$e#He found a place with a really high concentration of raw magic. I'm excited!$3",
  "spring_28": "Will you grow starfruit this summer?$1",
  
  "Mon": "Um. Hi.$5#$e#...$0#$e#%Morgan doesn't feel like talking.",
  "Mon4": "Magnus is teaching me about the magical properties of mystical ancient plants.$3#$e#He tells me the valley used to be full of them a long time ago.$1",
  "Tue": "Hello.$0#$e#You're a little strange.$1",
  "Tue2": "Magnus is giving me an exam soon. I'm ready to pass it!$1#$e#I want to protect people.$1",
  "Tue8": "Hi, @! Are you well today?$1#$e#Um. Here! I brewed a potion for you![773]$1",
  "Wed": "You visit a lot.$5#$e#Are you a mage too?$0#$b#I sense your magic.$1",
  "Wed4": "Hi there, @!$1#$e#Oh. I'm gonna meditate soon to refresh my mana.$1",
  "Thu": "Do you like my hat?$1#$e#Magnus made it for me!$3",
  "Thu2": "Magnus told me there's forest sprites deep in the woods.$1#$b#Their magical powers are intertwined with the valley.$3",
  "Thu8": "Have you experienced anything magical on your farm?$0#$e#Oh. I see!$1",
  "Fri": "I drank a really weird elixir to strengthen my bond with the forest spirits.$2#$e#You drank one too!?$5",
  "Fri4": "I'm learning how to brew potions!$1#$b#Maybe I can make potions for you someday, to help with your adventures!$3",
  "Sat": "Marlon's visiting tomorrow!$1#$b#He's so cool!$3#$e#Why aren't you more like him?$0",
  "Sat4": "I wonder how Mom and Dad are doing...$9#$e#Gah!$5#$e#%Morgan is shocked.",
  "Sat10": "Magnus said I can't join him and Marlon on their expeditions. I'm not strong enough.$0#$e#That just means I need to get stronger!$4",
  "Sun": "So much pollen in the valley compared to home.$0#$e#Oh, where's home for me?$1#$b#Everton!$3#$b#It's a town in the mountains up north.$1",
  "Sun4": "Magnus and I are visiting a place called 'Sprite Spring'. He's gonna introduce me to his forest sprite friends.$1#$e#One of them goes by 'Claus'. He gave Magnus the ancient seeds for his arcane studies.$1",
  "Sun8": "Hey! We should brew potions together sometime.$1#$b#It'd be a lot of fun!$7#$e#I don't blow anything up anymore. Usually. ...I've gotten better, anyway.$1",
  
  //SUMMER DIALOGUE
  "summer_10": "So. You all throw a bunch of random stuff in a pot and then eat it?$0#$e#Sounds gross.$5",
  "summer_27": "Do you believe in merpeople?$0#$e#There's many mysteries in the world!$1",
  
  "summer_Mon": "I'm going on a special quest to gather something called 'fiddlehead' in the forest.$1#$b#Magnus needs it for a potion.$3",
  "summer_Mon6": "There's a lot of mana floating around in the forest during summer. I can feel it.$0#$e#Do you feel it too?$1",
  "summer_Tue": "Sometimes I ask Magnus if Vincent or Jas can come visit. He always says no.$2",
  "summer_Tue6": "Do you think the big melon outside looks tasty?$1#$e#Sometimes I want to take a bite out of it.$1#$b#But I know I'd get in trouble.$2",
  "summer_Wed": "I still struggle to cast magic...$2#$b#Do you think I'll get better?$2#$e#%You tell Morgan they can do it!#$e#Thanks, @.$3",
  "summer_Wed6": "Are you able to cast magic?$0",
  "summer_Wed8": "I'm going on a field trip tomorrow!$3#$e#I asked if you could come but Magnus said no.$0",
  "summer_Thu": "*yawn*...$3#$b#I didn't sleep much last night.$0#$e#Why? I was practicing magic!$1#$e#Don't tell Magnus!$5",
  "summer_Thu8": "I'm getting really good at brewing potions. Here's one for you![773]$3#$e#Oh. Here's another![773]$1",
  "summer_Fri": "Have you heard of a place called 'Castle Village'?$0#$b#I'm not allowed to visit until I'm older...$8",
  "summer_Fri8": "There's a witch that visits us. She doesn't really talk to me.$0#$e#Her name is Camilla.$8#$b#She gives me the creeps.$5",
  "summer_Sat": "I hope we aren't having frog soup for dinner tonight...Again...$5",
  "summer_Sat8": "Jas likes to play jumprope by the large cherry tree. She's always so happy.$1#$e#She's a good friend!$3",
  "summer_Sun": "I'm a little behind on my reading...$0",
  "summer_Sun6": "We destroyed some really big diamonds this morning during an experiment.$1#$e#Marlon brings us rare gems and monster loot for our studies!$3",
  
  //FALL DIALOGUE
  "fall_15": "Welwick is running her clairvoyance booth tomorrow.$1#$e#Magnus says she's really powerful.$0",
  "fall_26": "I might start learning how to summon creatures tomorrow!$3#$e#%Morgan is jumping with excitement!",
  "fall_28": "Can you feel the air getting all tingly?$0#$e#I sense... snow arriving.$1",
  
  "fall_Mon": "Did you know Magnus built the tower on a 'magical field'?$0#$e#It helps him focus his mana!$3",
  "fall_Mon6": "I want to go out and play with Jas and Vincent.$0#$e#I have important studies today though...$6#$b#Maybe this weekend.$1",
  "fall_Tue": "I'm going on a very important quest to gather potent magical mushrooms in the forest!$3#$e#This is my chance to show Magnus I'm reliable.$1#$e#%You tell Morgan they can do it. They smile at you.",
  "fall_Tue6": "I made my first totem!$3#$b#They're really hard to make.$1#$e#Have you ever crafted one?$0",
  "fall_Tue10": "Hey, @!$3#$b#I made this totem for you. It'll warp you back to %farm Farm.[688]$1",
  "fall_Wed": "Fall colors are very pretty.$0#$b#The trees remind me of home.$1#$e#...$2#$e#I want to see my parents.$2",
  "fall_Wed6": "Maybe I can teach you magic some day? I think you'd do great! You already have lots of potential.$3#$e#You would need to register as a mage with the Ferngill Ministry of Magic though.$0#$b#The rules are strict.$5",
  "fall_Thu": "Do you know anything about Andy?$0#$b#I don't think he likes magic.$0#$e#Maybe I should pull a prank on him?$3#$e#%You explain to Morgan they shouldn't pull a prank on Andy.#$e#Oh. Um. Sorry. I won't. Don't tell Magnus.$2",
  "fall_Thu8": "I secretly casted a little spell on Andy's farm to improve the soil.$0#$e#Um. Don't tell anyone. I could get in big trouble.$1",
  "fall_Fri": "Magnus is teaching me the 'Merlin Doctrine'. It's like a big rulebook for mages.$0#$e#It's reeeeeally boring.$2",
  "fall_Sat": "Do you like my new hat?$1#$e#Oh? You think it looks the same?$8",
  "fall_Sat6": "There's a blocked warp with the sign scratched off in the warp hall. I wonder what it was?$0#$b#Magnus forbids me from asking about it. But he'll tell me someday.$4",
  "fall_Sun": "I want to try fire magic but I'm not allowed to.$8#$e#Magnus says it's very hard to control.$0",
  "fall_Sun8": "Marlon and Magnus were talking and I overheard them. Something about a big battle across the ocean.$0#$e#There's a mage they know who's fighting on the 'other side'. I don't know what that means.$0",
  
  //WINTER DIALOGUE
  "winter_1": "There's residents here who don't like magic users.$0#$e#Who? Um.$0#$b#I can't tell you that.$0#$e#Sorry, @. I'm not allowed.$0#$e#Stop it!$4#$e#%Morgan is now ignoring you.",
  "winter_7": "The area where the ice fishing festival takes place has a great mana pool too.$1#$e#Um. Magnus and I will be nearby. Try to find us!$1",
  "winter_24": "Magnus said I'm not allowed to give magical gifts.$2",
  "winter_28": "I'm gonna miss the snow...$0",
  
  "winter_Mon": "Do you enjoy fighting monsters more than farming?$0#$e#Marlon says you're always in the mines.$0",
  "winter_Mon10": "I want to introduce you to my parents someday. I've told them so much about you!$3#$e#%You smile to Morgan and they smile back.",
  "winter_Tue": "Since it's freezing outside, I'm gonna convince Magnus to let me try fire magic.$1#$e#Hmm, you're right. I guess it could be dangerous.$2",
  "winter_Tue8": "I hope monsters, dwarves, and humans can be friends someday.$1#$e#Meeting Krobus made me realize we can all be friends.$1",
  "winter_Wed": "My home, Everton, has a monster problem just like Stardew Valley.$0#$b#So many of them are underground in the mountains.$0#$e#Monsters are scary...$2#$b#I-I want to be strong one day to fight them and protect everyone.$0",
  "winter_Wed8": "Um. I made this potion today. I want you to have it!$1[773]",
  "winter_Thu": "I've asked Magnus about adopting an animal from Marnie's. He said 'maybe'!$3",
  "winter_Thu10": "If you're caught in a blizzard, use this to get home!$1[688]#$e#I would be sad if anything bad happened to you.$2",
  "winter_Sat8": "Do you have any animals on your farm?$1#$e#Marnie lets me pet hers! They're really cute!$3",
  "winter_Sun8": "I wanna go play in the snow with Jas and Vincent!$3#$e#We play 1v2 because I'm too good at snowball fights.$1",
  
  //EVENT DIALOGUE
  "morgan_event1": "Mmm...$9#$b#I'm in a strange place far away from my home and family...$9",
  "morgan_event2": "Mmm...$9#$b#I guess that's what it is, isn't it?$9#$b#loneliness...$9",
  "morgan_event3": "...$9#$b#...$0#$b#Thanks.$1",
  "morgan_event4": "I know there's hardships I must surpass.$0#$b#It just isn't easy...$9",
}
