{
	"Name": "Junimo Scroll",
	"Description": "There's strange junimo symbols you don't recognize on this golden scroll. Perhaps the wizard can decipher it?",
	"Category": "Mineral",
	"Edibility": -300,
	"EdibleIsDrink": false,
	"EdibleBuffs": null,
	"CanSell": false,
	"Price": 200000,
	"IsColored": false,
	"GiftTastes": {
		"Like": [
			"MarlonFay",
			"Wizard",
			"Krobus",
			"Wizard",
			"Dwarf"
		],
		"Dislike": [
			"Olivia",
			"Andy",
			"Victor",
			"Susan",
			"MorrisTod",
			"Alex",
			"Elliott",
			"Harvey",
			"Sam",
			"Sebastian",
			"Shane",
			"Abigail",
			"Emily",
			"Haley",
			"Leah",
			"Maru",
			"Penny",
			"Caroline",
			"Clint",
			"Demetrius",
			"Evelyn",
			"George",
			"Gus",
			"Jas",
			"Jodi",
			"Kent",
			"Lewis",
			"Linus",
			"Marnie",
			"Pam",
			"Pierre",
			"Robin",
			"Sandy",
			"Vincent",
			"Willy"
		]
	},
	"NameLocalization": {
		"de": "Junimo-Schriftrolle",
		"es": "Pergamino Junimo",
		"fr": "Parchemin Junimo",
		"hu": "Junimo tekercs",
		"it": "Scorrimento Junimo",
		"ja": "ジュニモスクロール",
		"ko": "주 니모 스크롤",
		"pt": "Rolagem Junimo",
		"ru": "Свиток Junimo",
		"tr": "Junimo kaydırma",
		"zh": "Junimo滚动"
	},
	"DescriptionLocalization": {
		"de": "Es sind seltsam Junimo-Symbole, die Sie nicht auf dieser Walze nicht erkennen golden. Der Assistent kann sein in der Lage, es zu entziffern?",
		"es": "Hay extraños símbolos junimo que no reconoces en este rodillo dorado. Quizás el mago pueda descifrarlo?",
		"fr": "Il y a d'étranges symboles junimo que vous ne reconnaissez pas sur ce rouleau doré. Le sorcier est peut-être capable de le déchiffrer ?",
		"hu": "Vannak furcsa junimo szimbólumok, amelyeket nem nem ismeri fel ezen a hengeren golden. Lehet, hogy a varázsló képes megfejteni?",
		"it": "Ci sono strani simboli di Junimo che non si non riconoscere su questo roloto d'oro. Il mago potrebbe essere in grado di decifrarlo?",
		"ja": "奇妙な しないjunimoシンボル このローラーで認識されません ゴールデン。ウィザードは それを解読することができますか？",
		"ko": "이상하다 당신이하지 않는 junimo 기호 이 롤러를 인식하지 못합니다 황금. 마법사는 그것을 해독 할 수 있습니까?",
		"pt": "Existem estranhos símbolos junimo que você não não reconhecer neste rolo dourado. O assistente pode ser capaz de decifrá-lo?",
		"ru": "Есть странные символы Junimo, которые вы не не узнавать на этом ролике золотой. Волшебник может быть в состоянии расшифровать это?",
		"tr": "Garip var yapmadığın junimo sembolleri bu silindirde tanımıyor altın. Sihirbaz deşifre edebilir?",
		"zh": "有奇怪 您不懂的junimo符号 在此辊子上无法识别 金。该向导可能是 能破译吗？"
	}
}
