{
  "FairhavenFarm.000": "Is it true Andy's house got refurbished? I wonder what it looked like before.$0",
  "FairhavenFarm.001": "A portion of these strawberries will be turned into jam!$0",
  "FairhavenFarm.002": "*phew* I think I'll need a break soon.$0",
  "FairhavenFarm.003": "Hey there! I'm working for Andy today.$0",
  "FairhavenFarm.004": "It's tempting to visit Sophia right now.$1",
  "FairhavenFarm.005": "Being near the river helps me cool off.$1",
  "FairhavenFarm.006": "Andy is super strong! He carried four bags of fertilizer all at once.$1",
  "FairhavenFarm.007": "It must be nice living on the outskirts of town. You get a taste of civilization and nature.$0",
  "FairhavenFarm.008": "I've seen a bunch of families of crows nesting in the trees eyeing up Fairhaven Farm.$0#$b#It's a good thing there's a scarecrow!$1",
  "FairhavenFarm.009": "*phew* I have a lot of work to get done today.$0",
  "FairhavenFarm.010": "Hey there! I'm about to head home. My train is arriving soon.$0#$e#I think I'm hitting the hay as soon as I get back.$1",
  
  "EmeraldFarm.000": "Hey there! I'm working for Susan today.$1#$e#Up to anything cool?$0",
  "EmeraldFarm.001": "*phew* I have a lot of work to get done today.$0",
  "EmeraldFarm.002": "Susan always makes fresh lemonade after a hard days work!$1",
  "EmeraldFarm.003": "*sniff* *sniff* Smell that? This fertilizer has a pungent scent!$0",
  "EmeraldFarm.004": "Hey, what are you up to on a hot summer day like this?$1#$e#I'm working Susan's crop fields today. It's tough work!",
  "EmeraldFarm.005": "Have you ever tried Susan's melons? They're large and juicy!$0",
  "EmeraldFarm.006": "*phew* I think I'll need a break soon.$0",
  "EmeraldFarm.007": "We're gonna process these hops to flavor beer with a tangy bitterness!$1#$e#It's what makes a pale ale.$0",
  "EmeraldFarm.008": "I wonder what it's like to live next to the train tracks?$0#e#I don't think I'd ever get a good night's rest..$2",
  "EmeraldFarm.009": "Hey, it's awesome you're here. Anything cool going on?$0",
  "EmeraldFarm.010": "I might use the bathhouse after I'm done today. I'm working up a sweat!$1",
  
  "BlueMoonVineyard.000": "Hey there! I'm helping Sophia today.$1",
  "BlueMoonVineyard.001": "Sophia needs help with the grape harvest during fall.$0",
  "BlueMoonVineyard.002": "I love the view of the Gem Sea here!$1",
  "BlueMoonVineyard.003": "Lot of work to do while I'm here.$0#$b#If you're gonna stick around, mind helping out?$1",
  "BlueMoonVineyard.004": "Funny you showed up! Sophia and I were just talkin' about you.$1#$e#Can't tell you! my lips are sealed!$1",
  "BlueMoonVineyard.005": "It's a nice day today! Perfect for vineyard work!$0#$e#Well, time to get to it.$1",
  "BlueMoonVineyard.006": "I'd like to go into town to see what the hot gossip is, but I'm busy here.$0",
  "BlueMoonVineyard.007": "Hey there! I'm helping Sophia today.$1",
  "BlueMoonVineyard.008": "Sophia and I ate a bunch of waffles this morning for breakfast!$1#$e#Knowing her, we're gonna have grampleton orange chicken for dinner.$0",
  "BlueMoonVineyard.009": "We're turning these grapes into wine soon.$1",
  "BlueMoonVineyard.010": "It doesn't take too long to get here by train.$0",
  "BlueMoonVineyard.011": "*phew* What a day.$0",
  "BlueMoonVineyard.012": "Isn't Sophia's cosplay room cool or what?$0",
  "BlueMoonVineyard.013": "Whoa! She didn't tell me she had this volume!$1",
  "BlueMoonVineyard.014": "*yawn* I'm ready to hit the hay.$0",
  "BlueMoonVineyard.015": "Hey! Sophia and I were just talking about some stuff.$0",
  "BlueMoonVineyard.016": "Bye, Sophia!$1"
}