{
"Introduction": "Ah, it's farmer @. Welcome to the valley. My name is Morris, manager of the Joja Mart in Pelican Town.$0#$b#If you need cheap, quality seeds, there's no better place than Joja Mart!$1#$e#I wouldn't bother with Pierre's store. Joja seeds are much better than his.$3",

//SPECIFIC TILE DIALOGUE
"Town_43_59": "50 percent off coupons! Come get them while they last!$1",
"Town_44_59": "Buy a Joja Membership today and save big on your next purchase!$1",
"Town_42_59": "Stocking up on seeds for next season? Find the town's cheapest seeds at Joja Mart!$1",
"Town_43_60": "At Joja, we consider everyone part of our family.$1",

//SPRING AND GENERAL DIALOGUE

"spring_1": "This year will be the best year yet for Joja Corp.$1#$b#Our profits have done nothing but go up and up. I look forward to my stock options paying out.$4",
"spring_12": "Mayor Lewis always ropes off the Joja side of town during festivals.$3#$e#No. I will not participate in the egg hunt.$3",
"spring_23": "No. I'm not attending that dance festival.$3#$e#...$2",
"spring_28": "Almost time to change the stock in the store. I'm looking forward to the summer season.$0",

"Mon": "And another productive work week begins. I hope Shane performs better this week than last.$0#$e#I swear that boy gets lazier every day. Maybe I'll dock his pay.$3",
"Mon2": "Have you picked up any of our seeds this season, @?$1#$b#They really are high-quality. Just ask Andy, if you don't believe me!$4",
"Mon6": "Keep up the good work, @.$1", 
"Tue": "If you need cheap seeds, there's no better place than Joja Mart.$5",
"Tue2": "I have a giant stack of accounting to get through today.$0#$b#Lot's of people think paperwork is boring. I wouldn't call it exciting, but I do like to see the numbers balance out when we're running the store efficiently.$4",
"Tue8": "You set a good example the other farmers in the valley should follow.$1#$e#Keep up the good work, and don't forget to shop at Joja!$1",
"Wed": "Pierre's store is closed today. Might as well shop at Joja!$5#$e#Our products are far superior to anything he sells.$3",
"Wed2": "Pierre takes a day off on Wednesdays. Unfortunately for him, I work every day of every week!$5#$e#Now is the perfect opportunity to pick up some of our seeds!$1",
"Wed8": "Ah, @. Pleasure to see you. Do you need any farm supplies?$4#$e#Since Pierre's is closed today, Joja can supply you with any seeds and farming equipment you may need!$1",
"Thu": "I've been reading up on different strategies for optimizing the arrangement of department stores.$4#$e#Joja is pretty firm about things being consistent between locations, but I wonder if I have some room to maneuver and try some new things out...$5",
"Thu2": "*yawn* Five hours of sleep isn't quite enough for a full day of work.$2#$e#Well, back at it!$1",
"Thu8": "Hi, @. Thank you for speaking with me! How fares your day?$0#$e#No one else around here strikes up as much conversation as you do.$1",
"Fri": "Hello. Working hard, are we?$0#$e#Yes, of course I am too.$1",
"Fri2": "I've had a productive week. I may get a glass of that Blue Moon Vineyard wine at the saloon.$1",
"Fri6": "*sigh* Certainly could use a drink tonight, especially with the overtime I've put in this week.$2#$e#Sometimes I feel as if... I'm not welcome in Stardrop Saloon. I always get dirty looks when I go in there.$2#$e#Luckily, I keep a special stash of wine under my desk.$1",
"Fri10": "Ah! @! A glorious week at has been.$1",
"Sat": "Joja is the superior choice over Pierre's!$5",
"Sat2": "I remember when I had Saturdays off, back when I was just a grunt low in the Joja ranks.$4#$e#Much has changed since then.$1",
"Sat8": "@, I appreciate that you take time out of your day to talk to me. It makes a real difference for me.$1#$e#Keep up to good work contributing to our community!$4",
"Sun": "Err... Hello.$4#$e#Do you need something?$3#$e#Ah, seeds!? Joja has you covered! We have the best selection in town!$5",
"Sun2": "I recommend purchasing Joja stocks. They just keep on climbing!$4#$e#Oh, you don't invest? A shame.$0",
"Sun8": "Is your farm turning a profit yet this season, @?$0#$b#I don't mean to pry. I'm just curious about how the revenue cycle works for you.$4",

//SUMMER DIALOGUE
"summer_1": "Ahh, the summer has arrived. My favorite season.$1#$b#Why? People love to shop during the summer. The sun puts them in a good mood, and we keep the store nice and cool so they come in to get out of the heat.$4",
"summer_10": "Still need something to drop into the festival's soup, @?$0#$b#Joja Mart has plenty of options to choose from for tasty meals.$4",
"summer_28": "...I don't like looking at the jellyfish.$2#$e#I don't know why. They just make me feel strange.$3",

"summer_Mon": "Pelican Town is underdeveloped. I hope some day that will change.$0#$e#%Morris has a glint in his eye.", 
"summer_Mon6": "...There is something about this place, though. Don't get me wrong, I'm dedicated to expanding Joja here, but...$0#$e#You see it, don't you? Pelican Town is special. I'm starting to get it.",
"summer_Tue":  "Hi, @. Perfect day to make money.$1",
"summer_Tue2": "*yawn* I didn't get any sleep last night. Too much work to get done.$0#$e#%Morris yawns again.",
"summer_Tue6":  "Pulled another all nighter making sure everything at the store was perfect last night. I'm... very... tired today...$2#$e#%Morris closes his eyes.",  
"summer_Tue10":  "I spent a large sum of my recent paycheck to make improvements to the Joja store.$0#$b#Corporate won't give me another dime to make renovations.$3",
"summer_Wed": "There's several markets Joja could enter into in Stardew Valley if we want to expand.$4#$e#Perhaps we could sell fish, or furniture?$1",
"summer_Wed6":  "I enjoy drafting up development plans. Finding the most effective use of funds is rewarding.$0#$e#You do the same on %farm Farm, don't you? The start of a new season is quite the task.$1",
"summer_Thu": "I wonder how many customers Joja will gain this year.$4#$e#Our family grows larger every season.$1",
"summer_Thu8": "...I've been thinking, @. We call Joja a family, but I'm not sure that's really true anymore.$2#$e#%Morris looks troubled.",
"summer_Fri": "Joja's melon seeds will certainly increase your profits, @. I highly recommend purchasing them!$1",
"summer_Sat": "I purchased ice cream from that Alex boy yesterday. It was delicious.$1#$b#Perhaps Joja should start selling ice cream. Maybe there's a market for it?$5",
"summer_Sat6": "The ice cream stand ran by Alex is marvelous!$1#$e#I do enjoy watching the community thrive with their small businesses.$1",
"summer_Sun": "Shop at Joja and enjoy our air conditioning!$1",
"summer_Sat6": "Need to cool off? Joja Mart has the finest air conditioning system in the valley! Come on in out of the heat.$4",

//FALL DIALOGUE

"fall_1": "Fall is here, and it's time for summer clearance sales.$0#$e#At Joja Mart? Certainly not. But I like to hunt around for bargains elsewhere.$4",
"fall_15": "Are you participating in this town festival tomorrow, @?$0#$e#...Maybe I'll come. I'd like to see what you're growing on your farm, and it'd be useful to know what kind of things the mayor likes.$0",
"fall_23": "It isn't too late to purchase bok choy seeds.$0#$b#You'll have enough time to reap the harvest before winter starts!$1",
"fall_27": "When I was young, Spirit's Eve was my favorite holiday.$0#$b#I always dressed up as the same thing: An accountant.$1",
"fall_28": "Another year almost over.$1#$e#I'll need to get my finances in order for taxes soon. I hope there's nothing too time-consuming to deal with.$0",


"fall_Mon": "Tried any of our fall seeds yet, @?$0#$e#Guaranteed to improve your crops!$1#$e#Your money back? No, it's not that kind of guarantee. Just a turn of phrase.$0",
"fall_Mon4": "Ah, @. Just who I wanted to see.$1#$b#I wanted to suggest purchasing our current batch of yam seeds.$4#$e#Andy has reported he's harvesting silver quality yams! Buy them while they're still in stock!$1",
"fall_Mon8": "Andy is one of our best customers. I really feel like he's part of the family.$1#$e#...And I see him struggling to fit in here. I do too.$2", 
"fall_Tue": "Today has been dreadfully busy for me, cleaning up the mess my staff made.$3#$e#I wish I could dine on lobster bisque this very moment.$2#$b#Perhaps I'll visit my favorite five star restaurant in the city this week.$1",
"fall_Wed": "My mind is bursting with ideas for improving the store!$1",
"fall_Wed8": "I spent a large sum of my recent paycheck to make improvements to the Joja store.$0#$b#Corporate won't give me another dime to make renovations.$3", 
"fall_Thu": "If you're ever looking for part-time work, @, we're always hiring!$0#$e#...Yes, I know you left Joja once already. That doesn't mean you have to leave forever.$3",
"fall_Thu8": "It's difficult to find good help around here. The town's just so small...$2#$e#I know you'd never come back and work for us again, but it was a big loss for Joja to lose a hard worker like you.$2",
"Fall_Fri": "A few of my staff have started asking if they can get out earlier on Fridays.$0#$e#I said no, of course.$2",
"fall_Fri6": "My staff have started demanding to be let out early on Fridays again.$0#$e#I don't know how to explain to them that the earlier they get out, the later I have to stay...$2#$e#%Morris sighs.",
"fall_Sat": "We desperately need to restock. Looks like I'm staying late on a Saturday again...$0",
"fall_Sat6": "Maybe we should start stocking some alcohol at Joja...$4#$e#Well, it'd be easier than going to the saloon. Maybe we could even open a bar of our own!$1",
"fall_Sun": "@, consider going to Joja.net and taking our online survey.$1#$e#You'll have a chance to win a prize worth 500G!$1",
"fall_Sun8": "Have you seen our website lately, @? We just had a big redesign!$0#$e#Since you're a friend, I'll give you our staff code for a twenty percent discount. Just type in JOJAFAMILY at checkout 1.$1#$e#Twenty percent isn't very much? Well... it's better than what we usually get...$2", 

//WINTER DIALOGUE

"winter_1":  "It gets dreadfully cold here in the winters. I can't get used to it.$0#$e#Maybe we should have a special sale on heaters. That'd bring people in. And I could put up a stand with hot cocoa...$4#$e#%Morris looks deep in thought.",
"winter_7": "Are you going to go ice fishing tomorrow at the festival?$0#$e#...I don't spend as much time taking in the local social scene as I should. Maybe I'll come watch.$0",
"winter_24": "I'm planning to slip a few Joja gift cards under the tree. I hope people notice them.$1",
"winter_28": "Ready for a new year, @? I hope it's a profitable one for both of us.$0",

"winter_Mon": "I take the shuttle to work every day from my home.$0#$e#Live here? No, I've never considered it...$0",
"winter_Mon6": "Watch out for ice on the roads, @.$2#$b#Almost slipped on my way to the night shuttle last night.$4",  
"winter_Tue": "I appreciate having the time to think of new business plans during winter.$0",
"winter_Tue6": "Any chance you could take a look at a marketing campaign I'm working on sometime?$0#$e#You seem to get along well with the townspeople here. I'd love your help figuring out how to reach them.$4",
"winter_Wed":  "If you need a good place to warm up, I recommend shopping at Joja!$1",
"winter_Wed4": "Hello, @. Cold day today.$0#$e#Make sure you stay bundled up!$1",
"winter_Thu": "I've dedicated this winter season to planning Joja's new strategy! This coming year will be the strongest yet for Joja!$1",
"winter_Thu6": "I'm pitching my new strategy at the big Joja manager summit next week...$0#$e#Wish me luck, @. My ideas aren't always well-received.$2",
"winter_Fri": "Ever slip and fall in front of anyone in the winter and get laughed at?$0#$e#.... No, me neither.$2",
"winter_Fri8": "Do you feel appreciated for the work you do on your farm, @?$0#$b#You work all alone, but everyone's so kind to you.$0#$e#I wish my staff understood exactly how much work I put in to running the store...$2",
"winter_Sat": "Weekends? I don't even know the meaning of the word!$1#$e#%Morris's smile fades quickly.",
"winter_Sat4": "I'm bone-tired lately. I should take a vacation soon...$0#$e#But when I'm away, all I do is worry about the store. Or come up with new ideas!$0",
"winter_Sun": "Another Sunday, another day of finishing up the weekly stock...$0",
"winter_Sun6": "We've had some money from the register go missing lately...$0#$e#I don't want to accuse anyone. I'm not that heartless.$2",

}