{
  //SPECIAL DIALOGUE
  "Introduction": "Hey there. You're that new owner of %farm Farm. My manager held a meeting about you!$0#$b#I work part-time at Joja Mart.$1#$e#Err. Forget what I said about that meeting. It could get me in trouble.$4",
  "pamHouseUpgrade": "Do you think that lady will be nicer to me at work now?$4",
  "pamHouseUpgradeAnonymous": "Do you think that lady will be nicer to me at work now?$4",
  "Town_92_44": "%'Employee Entrance'",
  "BusStop_12_8": "%Bus Driver: Either get on the bus or step off sir.^%Bus Driver: Either get on the bus or step off ma'am.",
  "Resort_Entering": "This island is so cool!$1",
  "Resort_Leaving": "I'm gonna tell my mom and dad about this place!$1",
  "Resort_Shore": "The water feels really nice on my feet. I think I'll go swimming!$0",
  "Resort_Chair": "It's really awesome your community has fun get-togethers like this.$0#$e#My hometown is boring...$4",
  "Resort": "I forgot to put on sunscreen.$4#$e#I think I got sunburned. My back's all itchy$4",
  
  
  //SPRING AND GENERAL DIALOGUE
  "Mon": "Hey, @! How's Claire doing?$0",
  "Tue": "Uhh. Hi.$0",
  "Tue2": "My mom packed me a big lunch today.$0#$e#She packed 'cheez curls', my favorite chips!$1",
  "Tue8": "Hi, @. Keeping yourself busy as always.$0#$e#Well, see you around.$6",
  "Sat": "*sigh*... I don't want to work today.$2#$e#Oh. Hey. Can I help you?$4",
  "Sat2": "Hey. What do you think about Claire, my co-worker?$0#$e#She's really cool.$6",
  "Sat6": "Hey @! How are you!?$1#$e#I'm pepped up on the coffee my mom brewed this morning!$1#$e#Have a fantastic day!$1",
  "Sun": "I sometimes take the bus here to check out books from the library.$0#$e#That guy with the goatee doesn't talk much.$0",
  "Sun2": "Hmm...$4#$e#...$4#$e#Oh! Hey!$1#$b#Just thinking to myself. Don't mind me.$0",
  "Sun6": "Got a big test comin' up! Need to prepare myself.$1#$e#Your town's library has a bunch of interesting books.$0",
  
  
  //SUMMER DIALOGUE
  "summer_Tue": "We're havin' clearance sales soon. 5 percent off!$1",
  "summer_Tue2": "Claire mentioned the air conditioning in the store is too much for her.$2#$e#My manager won't turn it down, though. He says it attracts customers.$3",
  "summer_Tue8": "I could see myself moving to Stardew Valley when I'm older.$0#$e#I'm not cut out for farm work like you though.$1",
  "summer_Sat": "There's a bunch of pretty sights here, particularly the Gem Sea.$0#$e#I just have a view of empty plains and boring old mountains back home.$4",
  "summer_Sat2": "My dad sort of made me get a part-time job.$4#$e#At least I can buy myself cool stuff now.$0",
  "summer_Sat8": "My mom packed me a couple tacos. I don't mind sharing![213]$0#$e#Her cooking is the best.$1",
  "summer_Sun6": "I don't really need to come all the way here to study at your library. There's one close to my house.$0#$b#I just want an excuse to travel more.$4",
  "summer_Sun8": "There's a bunch of interesting people in the valley. Are you friends with many people?$0#$e#I live in the countryside. Not too many folks out there.$0",
  
  
  //FALL DIALOGUE
  "fall_Tue": "Hi sir.^Hi ma'am.",
  "fall_Tue2": "My mom always says 'manners are key'. I try my best to be polite to everyone.$0#$e#Maybe that's why I got the job at Joja Mart.$0",
  "fall_Tue8": "I gotta work hard while I'm young! Future Martin will appreciate me!$1",
  "fall_Sat": "*yawn* I was up all night playing video games and now I'm regretting it...$2#$e#I did level up my character though.$1",
  "fall_Sat8": "I used to make a bunch of stupid mistakes at work, but I've gotten better.$0#$e#Hey. I appreciate you talking to me!$1",
  "fall_Sun": "*yawn*...$2#$e#Oh. Hey there. How may I help you?$0",
  "fall_Sun4": "All my close friends are online. I talk to them just about everyday.$6#$e#I want to meet them in real life eventually, but plane tickets are expensive...$0",
  "fall_Sun8": "Hey there, @. You know, I could maybe talk to my manager and get you some good discounts!$0",
  
  
  //WINTER DIALOGUE
  "winter_Tue": "This job is a pretty good resume builder.$0", 
  "winter_Tue8": "Sometimes I catch Claire humming a pleasant tune to herself...$6#$e#Oh. Err. Can I help you with anything @?$0",
  "winter_Sat4": "My mom is knitting a scarf for me.$0#$e#I hope it isn't too big this time...$4",
  "winter_Sat8": "I don't often drop by your town's saloon. We should grab a bite to eat sometime!$0",
  "winter_Sun4": "What's it like owning a farm during winter? You must have a bunch of free time on your hands.$0",
  "winter_Sun8": "Hey @. Don't overwork yourself!$0",
  
  
  //EVENT DIALOGUE
  "martin_event1": "Th-that's.. Uh. I'm doing some research, it's...$4",
  "martin_event2": "... Yeah. Not much to do, at home, and this place has...$0",
  "martin_event3": "...Yeah, you're probably right.$6",
  "martin_event4": "I mean, definitely a little weird. But I've got a good reason...$0",
  "martin_event5": "Thanks, @. I'll go get her.$0",
  "martin_event6": "... Okay, it's your choice. Gunther will probably let her rest at the museum, I guess.$3",
  "martin_event7": "Yeah... I guess I really do.$6",
  "martin_event8": "... That's not fair, @.$3"

}
