{
	"Name": "Aged Blue Moon Wine",
	"Description": "Sophia's aged hand-crafted wine from Blue Moon Vineyard. It comes in a prestigious basket riddled with leaves, with a shiny bow to wrap it all together. Makes a wonderful gift!",
	"Category": "ArtisanGoods",
	"Edibility": 100,
	"EdibleIsDrink": true,
	"CanSell": false,
	"EdibleBuffs": {
		"Farming": 0,
		"Fishing": 0,
		"Mining": 0,
		"Luck": 7,
		"Foraging": 0,
		"MaxStamina": 0,
		"MagnetRadius": 0,
		"Speed": 0,
		"Defense": 0,
		"Attack": 0,
		"Duration": 600
	},
	"Price": 10000,
	"IsColored": false,
	"GiftTastes": {
		"Love": [
			"Olivia",
			"Victor",
			"Gus",
			"MarlonFay",
			"Susan",
			"MorrisTod",
			"Elliott",
			"Lewis",
			"Wizard",
			"Harvey",
			"Leah",
			"Alex",
			"Sam",
			"Shane",
			"Abigail",
			"Emily",
			"Haley",
			"Caroline",
			"Clint",
			"Demetrius",
			"Evelyn",
			"George",
			"Jodi",
			"Kent",
			"Linus",
			"Marnie",
			"Pam",
			"Pierre",
			"Robin",
			"Sandy",
			"Willy"
		],
		"Like": [
			"Sebastian",
			"Maru",
			"Andy"
		],
		"Neutral": [
			"Sophia"
		],
		"Dislike": [
			"Jas",
			"Vincent"
		],
		"Hate": [
			"Dwarf",
			"Krobus",
			"Penny"
		]
	},
	"NameLocalization": {
		"de": "Oude Blauwe Maan Wine",
		"es": "Vino de luna azul envejecido",
		"fr": "Vin vieilli de Blue Moon",
		"hu": "Idős kék hold bor",
		"it": "Vino invecchiato Blue Moon",
		"ja": "熟成ブルームーンワイン",
		"ko": "세 블루 문 와인",
		"pt": "Vinho envelhecido da lua azul",
		"ru": "Выдержанное синее лунное вино",
		"tr": "Yaşlı Blue Moon Şarabı",
		"zh": "陈年蓝月酒"
	},
	"DescriptionLocalization": {
		"de": "Sophia's gerijpte handgemaakte wijn van Blue Moon Vineyard. Het wordt geleverd in een prestigieuze mand vol met bladeren, met een glanzende strik om alles samen te wikkelen. Een geweldig cadeau!",
		"es": "Vino artesanal envejecido de Sophia de Blue Moon Vineyard. Viene en una prestigiosa canasta plagada de hojas, con un lazo brillante para envolverlo todo. ¡Es un regalo maravilloso!",
		"fr": "Le vin artisanal vieilli de Sophia de Blue Moon Vineyard. Il se présente dans un panier prestigieux criblé de feuilles, avec un noeud brillant pour tout envelopper. Fait un merveilleux cadeau!",
		"hu": "Sophia érlelt kézzel készített, a Blue Moon Vineyard borából. Ez egy tekintélyes kosár, amely tele van levelekkel, és egy fényes íjjal borítja össze. Csodálatos ajándékot nyújt!",
		"it": "Il vino invecchiato fatto a mano di Sophia da Blue Moon Vineyard. Viene fornito in un prestigioso cestino pieno di foglie, con un fiocco lucido per avvolgere tutto insieme. Fa un regalo meraviglioso!",
		"ja": "ソフィアのブルームーンヴィンヤードからの熟成手作りワイン。それは、葉をちりばめた一流のバスケットに入っています。素敵な贈り物になります！",
		"ko": "블루 문 포도밭에서 소피아의 세 손으로 만들어진 와인. 그것은 잎으로 가득 찬 유명한 바구니에 들어 있으며, 그것을 모두 감싸기 위해 반짝이는 활이 있습니다. 멋진 선물을 만듭니다!",
		"pt": "O vinho artesanal envelhecido de Sophia da Blue Moon Vineyard. Ele vem em uma cesta de prestígio, cheia de folhas, com um laço brilhante para embrulhar tudo isso. Faz um presente maravilhoso!",
		"ru": "Выдержанное вручную вино Софии с виноградника Голубой Луны. Он поставляется в престижной корзине, пронизанной листьями, с блестящим бантом, чтобы обернуть все это вместе. Делает замечательный подарок!",
		"tr": "Sophia'nın Blue Moon Vineyard'dan elde hazırlanmış el yapımı şarabı. Hepsini sarmak için parlak bir yay ile yapraklarla dolu prestijli bir sepet içinde geliyor. Harika bir hediye yapar!",
		"zh": "从蓝月亮葡萄园索菲亚的年龄手工制作的酒。 它装在一个久负盛名的篮子里，上面布满树叶，上面有一个闪亮的蝴蝶结，将它们包裹在一起。 制作精美的礼物！"
	}
}
