{

    //Configs
    "Config.MistEffects.name": "Nebeleffekte",
    "Config.SandboxLayout.name": "Sandbox-Layout",
    "Config.RemoveFences.name": "ZäuneEntfernen",
    "Config.RemoveGrassStretch.name": "GrasstreifenEntfernen",
    "Config.RemoveLandExpansionPond.name": "TeichDerLanderweiterungEntfernen",
    "Config.GrassCropField.name": "GrasAckerfeld",
    "Config.HeavyDebris.name": "SchwererSchutt",
    "Config.LargerBridgeToGrandpasShed.name": "GrößereBrückeZuOpasSchuppen",
    "Config.LargerGreenhouse.name": "GrößeresGewächshaus",
    "Config.RemoveGreenhouseObjects.name": "GewächshausObjekteEntfernen",

    "Config.MistEffects.description": "Fügt an Regentagen Nebel zu vielen Karten hinzu. Dies beeinträchtigt die Leistung, also deaktiviere dies, wenn du an Regentagen Verzögerungen feststellst.",
    "Config.SandboxLayout.description": "Verwandelt das Ackerland in ein riesiges Schmutzfeld, ähnlich dem Standardbauernhof. Perfekt für Spieler, die volle Kontrolle über das Kartendesign wünschen.",
    "Config.RemoveFences.description": "Entfernt vorgefertigte Zäune auf dem Bauernhof.",
    "Config.RemoveGrassStretch.description": "Entfernt den langen Grasstreifen neben dem Ackerfeld.",
    "Config.RemoveLandExpansionPond.description": "Entfernt den Teich aus dem später im Spiel erweiterten Bereich des Bauernhofs",
    "Config.GrassCropField.description": "Verwandelt das große Schmutzfeld in Gras.",
    "Config.HeavyDebris.description": "Füllt die Hoflandschaft mit einer Fülle von Ressourcen.",
    "Config.LargerBridgeToGrandpasShed.description": "Verlängert die Höhe der geflickten Brücke um 1 Kachel, sodass sie besser mit vom Spieler gelegten Wegen mit einer Höhe von 2 Kacheln verbunden ist.",
    "Config.LargerGreenhouse.description": "Macht das Gewächshaus etwas größer, mit ausgewiesenen Obstbaumplätzen.",
    "Config.RemoveGreenhouseObjects.description": "Entfernt statische Objekte wie Pflanzen und Fässer aus dem Inneren des Gewächshauses.",


    //Strings
    "FarmString": "Opas Hof_Bescheiden großes Ackerland mit bebaubarem Gras, verschiedenen Orientierungspunkten, Abkürzungen zu umliegenden Gebieten und Geheimnissen, die es zu entdecken gilt.",
    "DeedGift": "%Das muss jemand anderem gegeben werden...",
    //Grandpa's farm quests.
    "GF.Bridge.01": "Steinbrücke",
    "GF.Bridge.02": "Robin braucht 900 Steine, um eine Brücke auf meinem Grundstück zu bauen. Das wird das Reisen zum Schuppen viel einfacher machen!",
    "GF.Bridge.03": "Stein bei Robins Truhe in ihrer Werkstatt abgeben.",
    "GF.Event8.01": "Hallo, @!$1#$b#Ich habe ein Steinmetzmagazin gelesen und wurde inspiriert, mich selbst daran zu versuchen!#$b#Wenn du mir den Stein liefern würdest, könnte ich eine kleine Brücke zu deinem Schuppen bauen.$0#$b#Wie klingt das?$1",
    "GF.Event8.02": "Um auf Nummer sicher zu gehen, denke ich, dieses Projekt wird 900 Stück Stein erfordern.#$b#Du kannst den Stein in meiner Lagerkiste in meiner Werkstatt abgeben!$0",
    "GF.Event10.01": "Morgen, @! Du hast all den Stein gesammelt, den ich angefordert habe!$1#$b#Ich fange morgen früh mit der Brücke an!$0",
    "Clint.GoldBar.01": "Ein seltsamer Auftrag",
    "Clint.GoldBar.02": "Clint braucht 30 Goldbarren für ein Projekt. Im Gegenzug wird er Gestrüpp in der Nähe meines Schuppens entfernen. Er sagt, dort gibt es etwas Besonderes!",
    "Clint.GoldBar.03": "Goldbarren in Clints Barrenregal abgeben.",
    "Lewis.Commission.01": "Ich freue mich darauf. Danke!$0",
    "Commission.02": "Hmm... Ich frage mich, wie ich das Gold für seinen Auftrag bekommen soll.$2",
    "Commission.03": "Hey, @. Du kommst gerade rechtzeitig.$0",
    "Commission.04": "Ich muss 30 Goldbarren für ein... Projekt beschaffen. Ich habe mich gefragt, ob du interessiert wärst, da du ja ein Abenteurer bist.$0",
    "Commission.05": "Als Bezahlung dachte ich, ich könnte eines meiner neuen Werkzeuge benutzen, um Gestrüpp auf deinem Hof zu entfernen.$0#$b#Dieser große Schuppen von dir liegt in der Nähe natürlicher heißer Quellen. Ich würde dir einen Weg freimachen.$0",
    "Commission.06": "Großartig. Danke für die Hilfe. Du kannst die Goldbarren in mein Barrenregal in der Ecke dort legen.$0",
    "Commission.07": "Oh. Was ist das Projekt? Darüber kann ich nicht wirklich reden.$0",
    "Morris.Commission.01": "Wunderbar. Ich erwarte die Ergebnisse!$1",
    "Commission3.01": "Hey, äh.. Ich habe mich im Dickicht bei deinem Schuppen umgesehen. Sieht so aus, als hätte ich Recht gehabt. Es führt tatsächlich an einen schönen Ort...$0#$b#Ein Weg wird bis morgen freigeräumt sein. Danke nochmal für deine Hilfe, @.$0",
    "Commission3.02": "Ich hinterfrage nicht wirklich, was die Leute bei mir in Auftrag geben.$0#$e#Viele heiße Quellen in den Bergen. Es ist toll, dass eine in der Nähe deines Grundstücks ist.$0",
    "Expansion.Order.01": "Meine Ackerfläche erweitern",
    "Expansion.Order.02": "Unterzeichnen Sie die Besitzurkunde und leisten Sie eine direkte Zahlung von 250.000g über das rote Hauptbuch.",
    "Expansion.Order.03": "Gib die Besitzurkunde bei Lewis ab.",
    "Expansion.Event1.01": "Jemand klopft an die Haustür.",
    "Expansion.Event1.02": "Hallo, @. Fleißig auf dem Hof heute, wie ich sehe.$0#$b#Darf ich einen Moment deiner Zeit in Anspruch nehmen? Es gibt etwas, worüber ich mit dir reden möchte!$0",
    "Expansion.Event1.03": "Folge mir dorthin, hinter diese Zäune.$0",
    "Expansion.Event1.04": "So einen Zaun bin ich schon lange nicht mehr gesprungen!$1",
    "Expansion.Event1.Morris.04": "Hmm...$0",
    "Expansion.Event1.05": "Du bewirtschaftest %farm Farm nun schon seit ein paar Jahren. Hast du schon einmal über eine Erweiterung nachgedacht?$0#$b#Hier neben deinem Grundstück gibt es viel gutes Land.$0",
    "Expansion.Event1.06": "Das sind ungefähr ein Morgen, was am Ende 250.000g kosten würde.$0#$b#Besuche mich in meinem Anwesen, wenn du deine Entscheidung getroffen hast, @.$1",
    "Expansion.Event1.Morris.06": "Das sind ungefähr ein Morgen, was am Ende 250.000g kosten würde.$0#$b#Besuche mich im JojaMart, wenn du deine Entscheidung getroffen hast, @.$4",
    "Expansion.Event1.07": "Soll ich den Hof erweitern?",
    "Expansion.Event1.08": "#Den Hof erweitern.#Den Hof nicht erweitern.",
    "Expansion.Event1.09": "In Ordnung. Ich kaufe kein weiteres Land. Ich sollte Lewis Bescheid geben.",
    "Expansion.Event1.Morris.09": "In Ordnung. Ich kaufe kein weiteres Land. Ich sollte Morris Bescheid geben.",
    "Expansion.Event1.10": "Ah, du musst dein Ackerland nicht erweitern? Danke, dass du mich informiert hast, @.$0#$e#Manche Gebiete von Stardew Valley sollten einfach so bleiben, wie sie sind.$0",
    "Expansion.Purchased.01": "In Ordnung. Ich kaufe mehr Land. Ich sollte Lewis Bescheid geben.",
    "Expansion.Purchased.02": "Der Bodenwert in Stardew Valley ist im letzten Jahr in die Höhe geschossen.$0",
    "Expansion.Event2.01": "Entschuldigung, habe dich über dem Spülbecken nicht gehört. Musste mir gründlich die Hände waschen.$0",
    "Expansion.Event2.02": "Also, du hast dich entschieden, mehr Eigentum zu kaufen? Freut mich zu hören.$0#$b#Wenn es jemanden gibt, der dieses Land gut nutzen wird, dann bist du das.$1",
    "Expansion.Event2.03": "Benutze das rote Hauptbuch, um die Besitzurkunde zu kaufen, und gib sie mir dann zur Genehmigung.$0",
    "Expansion.Event2.04": "Ich freue mich darauf zu sehen, was du mit dem Platz machst, @.$0#$b#Nun, ich muss mich um etwas kümmern. Such mich später heute mit dieser unterschriebenen Urkunde auf.$0",
    "Expansion.Event2.05": "Dieser neue Teich, den du haben wirst, ist an einem großartigen Ort.$1#$e#Ah, was musste ich erledigen? Nichts, was dich angeht.$0#$e#...$3#$e#%Lewis ignoriert dich jetzt.",
    "Expansion.Event3.01": "Gute Nachrichten, @. Der Antrag für die Erweiterung deines Hofes wurde genehmigt.$0#$b#Das Land wird gerodet und morgen einsatzbereit sein!$1",
    "Expansion.Event3.02": "Mit diesem neu erworbenen Land könntest du viel anfangen.$0#$e#Vielleicht Schweine züchten und Trüffelöl herstellen! Das ist eine sehr wertvolle Handwerksware.$1",
    "Morris.Order.01": "Meine Ackerfläche erweitern",
    "Morris.Order.02": "Unterzeichnen Sie die Besitzurkunde und leisten Sie eine direkte Zahlung von 250.000g über das Bücherregal in meinem Büro.",
    "Morris.Order.03": "Gib die Besitzurkunde bei Morris ab.",
    "Morris.Purchased.01": "In Ordnung. Ich kaufe mehr Land. Ich sollte Morris Bescheid geben.",
    "Morris.Purchased.02": "Der Bodenwert in Stardew Valley ist im letzten Jahr in die Höhe geschossen!$5#$e#Ob du es glaubst oder nicht, du bekommst dieses Land tatsächlich zu einem ziemlich guten Preis.$0",
    "Morris.Expansion2.01": "Ah, ja? Bitte komm rein!$1",
    "Morris.Expansion2.02": "Also, du hast dich entschieden, mehr Eigentum zu kaufen? Freut mich zu hören.$0#$b#Wenn es jemanden gibt, der dieses Land gut nutzen wird, dann bist du das.$1",
    "Morris.Expansion2.03": "In diesem Bücherregal befindet sich ein Hauptbuch. Kaufe die Besitzurkunde und gib sie mir dann zur Genehmigung.$0",
    "Morris.Expansion2.04": "Ich freue mich darauf zu sehen, was du mit dem Platz machst, @.$0#$b#Nun, ich muss mich um etwas kümmern. Such mich später heute mit dieser unterschriebenen Urkunde auf.$0",
    "Morris.Expansion2.05": "Land zu erschließen ist aufregend, nicht wahr?$1",
    "OpeningEvent.01": "Du bist endlich hier!",
    "OpeningEvent.02": "@! Ich freue mich, dich wiederzusehen! Es sind ein paar Monate her.$4#$b#Ich kann nicht glauben, dass heute dein Einzugstag ist! Jeder in der Stadt ist aufgeregt, dass du offiziell ein Einwohner von Stardew Valley bist.$0",
    "OpeningEvent.03": "Ich habe die Brücke repariert, die Elektrizität im Häuschen wiederhergestellt, die meisten Zäune restauriert und die anderen verschiedenen Aufgaben erledigt, die du mir aufgetragen hast!$0#$b#Lass uns rüber zu %farm Farm gehen, damit ich es dir zeigen kann. Ich habe auch noch eine Überraschung!$1",
    "OpeningEvent.04": "Komm, schau dir den Hinterhof an!$1",
    "OpeningEvent.05": "Lewis und ich haben den Hinterhof aufgeräumt und ich habe einen Haustierbereich für dich gebaut!$0#$b#Das ist unsere Art, dich im Tal willkommen zu heißen, @!$1",
    "OpeningEvent.06": "Lewis ist noch im Häuschen und bereitet ein paar Dinge für dich vor.$0#$b#Da er beschäftigt ist, ist das eine gute Gelegenheit für mich, dir die reparierte Brücke zu zeigen!$1",
    "OpeningEvent.07": "Entschuldige die Äste. Wir hatten letzte Woche einen Sturm.$5#$b#Als du die Brücke vor ein paar Monaten das letzte Mal gesehen hast, war sie teilweise eingestürzt. Ich habe mein Bestes getan, sie zu reparieren.$0#$b#Das war nicht so einfach. Ich habe schon Holzbrücken repariert, aber keine Steinbrücken.$2",
    "OpeningEvent.08": "Also, mit den Reparaturen an Brücke, Zaun und Versandkiste, der Wiederherstellung von Strom und Wasser im Häuschen...$0#$b#Der Überholung des Häuscheninneren, der Renovierung des Kamins und der Landvermessung...$5",
    "OpeningEvent.09": "Die Gesamtkosten belaufen sich auf 103.500g.$5",
    "OpeningEvent.10": "$q -1 null#(Ich werde nur noch 500g übrig haben)#$r -1 0 robin_event3#Ich habe gerade genug. Ich habe jetzt kein Geld für die Reparaturen am Gewächshaus.",
    "OpeningEvent.11": "Lewis sollte jetzt gleich fertig sein. Wir sollten zurück zum Häuschen gehen.$0",
    "OpeningEvent.12": "Ich hole Lewis. Er ist drinnen.$1",
    "OpeningEvent.13": "Ah, du bist hier!",
    "OpeningEvent.14": "Es ist schon eine Weile her, seit wir uns das letzte Mal gesehen haben, @.$1#$b#Ich hoffe, die Verbesserungen, die wir an %farm Farm und dem Häuschen deines Großvaters vorgenommen haben, erleichtern dir das Einleben.$0#$b#Deine Möbel und Habseligkeiten sind vor ein paar Tagen angekommen! Alles ist drinnen.$1",
    "OpeningEvent.15": "Robin, hast du @ die Verbesserungen hier draußen gezeigt?$0",
    "OpeningEvent.16": "Das habe ich! @ ist mit der geleisteten Arbeit zufrieden!$1",
    "OpeningEvent.17": "Das ist gut zu hören!$1",
    "OpeningEvent.18": "All diese Jahre reichen aus, damit Ackerland so wird. Du wirst verschiedene Werkzeuge brauchen, um anzufangen.$0",
    "OpeningEvent.19": "Clint, der örtliche Schmied, hat Werkzeuge hergestellt, die dir helfen, Schutt und Bäume zu beseitigen.$0#$b#In deinem Häuschen gibt es eine Axt, eine Spitzhacke, eine Hacke, eine Sense und eine Gießkanne!$1",
    "OpeningEvent.20": "Es wird viel Arbeit sein, %farm Farm wieder zu dem zu machen, was es einmal war, @. Dein Großvater wäre stolz auf dich.#$b#Morgen solltest du dich den Dorfbewohnern vorstellen. Jeder im Tal weiß, dass du gerade erst eingezogen bist.$1",
    "OpeningEvent.21": "Demetrius, mein Mann, freut sich darauf, dich kennenzulernen, @! Komm bei unserem Haus in den Bergen vorbei, wenn du Zeit hast!$1",
    "OpeningEvent.22":  "Die anderen Bauern freuen sich, einen weiteren Kultivator im Tal zu haben.$1#$b#Du solltest bei Gelegenheit auch ihre Höfe besuchen.$0",
    "OpeningEvent.23":  "Wir gehen jetzt, damit du dich einleben kannst.$0#$b#Wenn du Fragen oder Bedenken hast, weißt du, wo du uns findest.$1",
    "OpeningEvent.24":  "Wenn dir kalt wird, kannst du den Kamin benutzen. Er funktioniert jetzt prima!$1",
    "OpeningEvent.25":  "Wir sehen uns morgen. Richte dich ein!$1",
    "Cave.01":"Hallo @! Ich habe gute Nachrichten für dich. Vor ein paar Tagen habe ich einen Durchbruch in meiner Forschung zur lokalen Umwelt erzielt.$h#$b#Ich erspare dir die technischen Details und komme zum Punkt... Du kennst doch diese leere Höhle da drüben, ein Stück südöstlich? Nun, ich habe eine Möglichkeit, sie in etwas Nützliches zu verwandeln... für uns beide.#$b#Ich möchte die Höhle so einrichten, dass sie einige lokale Arten anzieht. Auf diese Weise kann ich sie in einer kontrollierteren Umgebung beobachten. Und du kannst ernten, was auch immer sie produzieren.#$b#Ich kann die Höhle entweder so einrichten, dass sie Pilze oder Fruchtfledermäuse anzieht. Die Fledermäuse werden manchmal Früchte für dich zum Sammeln zurücklassen.",
    "Cave.02": "In Ordnung! Ich werde es sofort für dich einrichten! Das sollte gar nicht lange dauern.$h#$b#Danke, dass du mir das erlaubt hast.",
    "Cave.03":"Ich bin gespannt, was mit dieser Höhle passiert. Du nicht auch?#$e#Ich hoffe, du bist mit meiner Arbeit zufrieden.",
    "MarnieEvent.01": "Hallo @! Jetzt, da du Nutztiere besitzt, dachte ich, ich verrate dir ein kleines Geheimnis.$0",
    "MarnieEvent.02":"Sie werden nicht aus den eingezäunten Bereichen deines Hofes entkommen, also kannst du sie ruhig offen lassen!$1",

    //Robin Dialogue Additions. 
    "Robin.01": "Gern geschehen, @!$1",
    "Robin.02": "Danke, @!$1",
    "Robin.03": "Entschuldige, dass es so teuer war, @...$2#$b#Allein die Brückenreparaturen beliefen sich auf 45.000g. Die Steinplatten, die ich gekauft habe, und die gemietete Ausrüstung waren nicht billig.$5",
    "Robin.04": "Ähm... ja, kein Problem.$2",

}
