{
//Special Dialogue
"breakUp": "I believe that's... for the best.$2#$e#It's hard to have a relationship when you don't see each other often...$2",
"divorced": "I thought we'd grow old together...$2#$e#%Lance turns away from you.",
"dumped_Guys": "Hello, @.$2#$e#...$2",
"secondChance_Guys": "I'm willing to give this a second chance...$5",
"highlandsDwarf": "You saved that dwarf, @. You're a bonafide hero.$1#$e#*chuckle* They told me everything.$5#$e#I had no idea they were imprisoned in the caverns, forced to watch as their treasures were devoured by that terrible monster.$6",
"Resort_Entering": "I haven't had a day off in weeks. I'm looking forward to this.$0",
"Resort_Leaving": "*chuckle* My spirit feels rejuvenated. Time to head home.$5#$e#Would you care to walk home together? Let's put the totems and scepters away.$1",
"Resort_Shore": "The First Slash is about 2,000 miles south west of where we are.$0#$e#You should relax with me, dear. Feel the hot, warm sand between your toes.$5",
"Resort_Chair": "My skin is appreciating the weather today.$5",
"Resort_Bar": "This pineapple cocktail is refreshing.$0#$e#Care for a sip?$1",
"Resort": "You should lay down and relax with me. Feel the hot, warm sand between your toes.$5#$e#The First Slash is about 2,000 miles south west of where we are.$1",

//Galdoran Outpost
"Mon": "We are the spearhead that'll enforce a safe world.$0",
"Mon4": "Hello there, @. What kind of business do you have this far away from civilization?$1",
"Mon6": "We're organizing some more experienced groups to head deeper into the Badlands soon to deal with some... issues we're having.$6#$e#I'm not at liberty to discuss the details.$5",
"Mon8": "Do you train every day? If you don't keep your reflexes sharp, you could get caught off guard out on the battlefield.$0",
"summer_Mon8": "Some regions of Galdora are rich with platinum and palladium deposits.$0#$e#What makes these metals precious is that they don't react with the atmosphere.$1#$b#They're an important resource in magical equipment and research.$0",
"fall_Mon8": "I've been fortunate enough to discover dozens of magic relics during my time.$0#$e#It's only a matter of time until you discover your own too.$1",
"winter_Mon8": "There's several places I want to show you once Camilla gives you permission to enter Castle Village.#$e#I wonder if she's waiting for something. Or it could be some kind of bizarre test...#6#$b#That's just the sort of thing she'd do.$5",
"Mon10": "Gazing at the crimson horizon together on top of an outpost...$5#$b#Now this is a moment I can treasure.$4",

//Stardew Valley
"Tue": "I own an outpost far up north, in the highlands.$0#$e#Perhaps one day, you'll join me there.$1",
"Tue2": "The First Slash could certainly use someone with your talents...$0",
"Tue8": "I've been contemplating buying property and building a house somewhere around here.$0#$b#I'm enjoying my time here immensely.$1",
"summer_Tue8": "Bountiful amounts of mushrooms grow in some of the lower mine floors.$1#$e#I'm curious why that is...$5#$b#Perhaps I'll pursue studying them and unearth the reason.$0",
"fall_Tue8": "The valley is in good hands with your wizard, Magnus Rasmodius.$1#$e#*chuckle* We always give him a warm welcome when he visits The First Slash.$0",
"winter_Tue8": "The dwarf in the mines was kind enough to sell me hand-crafted bombs.$0#$e#Dwarfs make the finest bombs out of any species. It's how they carve through mountains to make their homes.$1",
"Tue10": "*yawn*...$5#$b#I didn't get much sleep last night. I was exploring the mountains.$0#$e#*yawn*...$5#$b#I feel like I could just rest my head in your lap...$5#$e#%Lance is dozing off.",
"Wed": "Marlon contracted me for some jobs suitable only to a combat mage, such as myself.$0#$e#I'm not at liberty to discuss the details.$5",
"Wed2": "Some parts of the world act on their own accord...$5#$e#For the most part, the Ferngill Republic is a safe place. But even it has its dark corners...$0",
"Wed4": "I'd feel out of place walking around Pelican Town. I'm comfortable here at the guild, though.$0#$b#They're always the same wherever you go.$5",
"Wed8": "The biggest adventure you can ever take is to live the life of your dreams.$0",
"summer_Wed8": "I had an expedition with Marlon in the mines recently. He's impressive with a sword.$0",
"fall_Wed8": "I purchased elixirs from that dwarf in the mines. Here, take one [773].$0#$e#It's quite invigorating.$5",
"winter_Wed8": "Stardew Valley takes their festivities quite seriously. Everyone participates in decorating, it seems.$5#$e#In Castle Village, we have our own festivals. Perhaps one day you can join us.$0",
"Wed10": "Hello, my darling. I trust you have adventure guild business today?$1#$e#Be safe out there.$0",

//Ginger Island
"Thu": "I was trained in the magical arts by my master.#$b#You show some real potential...$1",
"Thu4": "Your abilities are perplexing.$0#$b#Are you hiding your true power from me?$1#$e#*chuckle*...$5",
"Thu6": "Patrolling the islands has its benefits...$0#$b#Beautiful weather, tropical fruits straight from the vine, breathtaking sights, the smell of fresh ocean air...$5",
"Thu8": "I have a hypothesis monsters were attracted to the raw power of Mount Kohldur.$6#$e#Unable to defend themselves from hordes of monsters, the dwarfs fled their home in search of a new one.$6",
"summer_Thu8": "I found this cinder shard while adventuring. You can have it [848].$0#$e#It's a useful resource for trading and crafting.$5",
"fall_Thu8": "Even today, adventurers such as yourself are still making new discoveries.$1#$e#The world is filled with many mysteries. With a collective effort, we can hope to eventually unravel it all.$0",
"winter_Thu8": "My guild isn't within my teleportation range, so I have a hidden warp rune around here.#$e#I fancy the idea of building a beach house near it someday...$5",
"Thu10": "I really should stop by the beach house more often. Perhaps we can cook a meal together and enjoy the sun setting on Gem Sea's horizon.$4",
"Fri": "Perfect day for dungeon crawling.$0#$b#Good luck, adventurer.$5",
"Fri2": "The world is a big place. I hope to one day explore it all.$0",
"Fri4": "There's many adventurers who hail from The First Slash, including me.$5#$e#I'll take you with me there someday.$1",
"Fri8": "Even I still get nervous stepping into the unknown. I have faith in my magical abilities to see me through whatever I might encounter, though.$0",
"summer_Fri8": "I'm somewhat fortunate I get to patrol Ginger Island.$5",
"fall_Fri8": "Galaxy Souls are required to perfect a magical weapon.$0#$b#They are the highest form of raw magical energy we know of.$1",
"winter_Fri8": "I sense a powerful presence on the island. I can't quite make it out...$6",
"Fri10": "I'm happy we found each other in this wild game we call life.$4",

//Highlands
"Sat": "There's a powerful monster on the peak of the mountain.$6#$e#I've found some opportunities to study it.$5#$b#Under the cover of fog, I witnessed it gobbling up treasure!$1#$e#I've tried sparring with it, but its resolve was stronger than I anticipated.$2#$b#Be careful if you try fighting it, @.$6",
"Sat6": "Thanks to your help, I've been able to make good progress on my monster crop research.$0",
"Sat8": "The mountain caverns here are rich in copper, iron, and gold. It was once the home to a colony of dwarfs.$0#$e#At some point... monsters moved in. I wonder what happened? There must be a reason.$6",
"summer_Sat8": "There is something very satisfactory about being the first person to discover a new monster.$0",
"fall_Sat8": "Did you come all the way out here to see me?$1#$e#Good luck adventuring, @.$0",
"winter_Sat8": "The snowfall here is heavy during winter.$0#$b#We are in the highlands, afterall.$5",
"Sat10": "Your visits spark a lot of joy in me.$0#$e#It'd be cramped, but we could share the bed tonight.$4",
"Sun": "Green mushroom monsters come out of hiding when it rains. They stay around the ruins.$0#$e#They are teeming with arcane energy - perfect for my research.$5",
"Sun4": "The air is thin here in the Highlands.$0",
"Sun6": "I'll admit, it can get quiet and lonely out here.$2#$b#It's a welcome sight to see you.$0",
"Sun8": "Monsters are more than horrid beasts with claws. We can learn more about them...$6",
"summer_Sun8": "These lands would make for a great vacation spot if they were absent of monsters.$0",
"fall_Sun8": "There's a famous tavern in Castle Village run by a dame named Eleanor.$0#$e#Ekon makes any opportunity to stop by. I believe he may have a thing for her...$5",
"winter_Sun8": "The golems and slimes here recolor their appearances with the changing seasons.$0#$e#I marvel at the possibility that they evolved to camouflage themselves.$0",
"Sun10": "There are many great powers in this world, but none surpass the power of love.$1#$e#*chuckle*...$5"

}
