{
  //SPECIAL DIALOGUE
  "patio_Lance": "The monster crops are in good health.$0",
  "spouseRoom_Lance": "I was awarded these monster statues for my achievements in the field.$0#$e#*chuckle* Some colleagues of mine believe they're monsters in stasis...$5",
  "funReturn_Lance": "How was your day, my love?$1#$e#My day was well. I managed to find time to continue my research.$0",
  "funLeave_Lance": "I have guild business today. I'll be back tonight.$0",
  "OneKid_0": "We both need to be strong for %kid1.$0",
  "OneKid_1": "I've taken on many roles in life, but I've never been a parent until now.$1",
  "OneKid_2": "I hope %kid1 likes books when they get older.#$b#Reading books when I was young was what sparked my interest in research. I never stopped reading.$5",
  "OneKid_3": "When our child is old enough, we should travel the world together.$0",
  "OneKid_4": "%kid1 has a lot of fight in them. Maybe they'll become an adventurer someday.$1",
  "TwoKids_0": "I have faith our children will adopt the best parts of both of us.$5#$e#*chuckle* %kid1 has your eyes.$1",
  "TwoKids_1": "I'll always wholeheartedly and unconditionally love our beautiful children.$0#$e#They will grow and change over the years and we will be with them at every step of the way.$1",
  "TwoKids_2": "When I was outside, I found %kid2 covered in dirt. I drew them a bath.$0#$e#*chuckle* I know someone like that...$5",
  "TwoKids_3": "We're both out of the house pretty often.$6#$b#What do you think about hiring a babysitter?$0#$e#I know a good lad in town who's looking for a part-time job.$1",
  "TwoKids_4": "I'm thankful %kid1 and %kid2 get along well.$1",
  
  //SEASONAL DIALOGUE
  "spring_Lance": "The smell of fresh air and feeling of sunshine on your face during this time of the year is soothing to the soul.$0",
  "spring_1": "I can feel the valley teeming with life. Spring has arrived...$0#$e#Without winter, spring wouldn't be as appreciated.$5",
  "spring_13": "I believe the Egg Festival is today.$5#$e#This will be a good opportunity for me to strike up a conversation with the valley residents.$1", 
  "spring_24": "I've prepared for the flower dance ceremony and will gladly take your hand in dance, my darling.$1",
  "summer_Lance": "Ah... I do enjoy hot weather.$5",
  "summer_1": "The beginning of summer takes a heavy toll on a farmer.$0#$b#Take this, my dear. It'll help keep your stamina up [349].$1#$e#Good luck today, my love.$4",
  "summer_11": "I've prepared a special dish using an old family recipe for the potluck.$0",
  "summer_28": "Don't forget about the gathering on the beach tonight, my love.$0",
  "fall_Lance": "The valley is alive with color... it sings to the soul.$0",
  "fall_1": "Do you feel it too? The trees have all entered a great slumber.$0#$e#The smallest breeze showers us with leaves.$5",
  "fall_6": "I'm craving a bowl of roasted butternut squash...$1#$e#*chuckle* Perhaps it's Autumn taking its effect on me.$5",
  "fall_16": "You've worked hard this year, my love.$1#$b#I'm looking forward to your grange display showcasing your accomplishments.$0",
  "fall_27": "Summoning a maze requires an immense amount of mana.$0#$e#I'd need to drink a special potion to achieve that power, but only for a brief moment.$5",
  "winter_Lance": "Winter is a season where one can recover and prepare for the next year.$0",
  "winter_1": "The valley was blanketed in snow last night.$0",
  "winter_8": "Magic is the most effective way to fish. That's how I do it.$0",
  "winter_12": "I wonder what merchandise the Night Market vendors will have this year?$0",
  "winter_24": "I have something special planned for you tomorrow...$1",
  "winter_25": "I traded for this in Castle Village just for you. It's a 'Galaxy Soul' [896].$0#$e#It'll make you stronger.$1#$e#Ah, what did I trade? That's... a secret.$1",
  
  //DAY DIALOGUE
  "Indoor_Day_Lance": "I appreciate being able to kick back and relax.$1",
  "Indoor_Day_0": "This house is certainly cozier than the outpost in the highlands.$0",
  "Indoor_Day_1": "The refrigerator is always well-stocked with products of the farm.$0#$e#I used to eat nothing but field rations. Now I feel like a king!$1#$e#The field rations aren't that bad...$5",
  "Indoor_Day_2": "What's on the agenda today?$0",
  "Indoor_Day_3": "It's not common for me to find free time.$0#$e#I wonder what I'll spend my day doing...$5#$e#%Lance is pondering to himself.",
  "Indoor_Day_4": "I took the liberty of cleaning the house this morning.$1#$e#It was very quick. I used a rather simple spell.$0",
  "Outdoor_Lance": "Don't overwork yourself. Take this elixir. It'll rejuvenate you.[773]$1",
  "Outdoor_0": "I cast a protective spell on the farmland to shield it from aphids.$0#$e#In large numbers, these insects can weaken plant growth.$6",
  "Outdoor_1": "Maybe I'll do some exploring today? There's so much of the valley I haven't seen.$0",
  "Outdoor_2": "I've come to truly appreciate how tranquil the valley is.$0",
  "Outdoor_3": "There isn't anyone else I know who works as hard as you do.$5#$e#I hope you have an eventful day, my love.$1",
  "Outdoor_4": "I don't know much about cultivating crops.$0#$e#I just enjoy seeing you work...$5",
  "Rainy_Day_0": "The farmland will get a nice welcomed drink from this drizzle.$0",
  "Rainy_Day_1": "Wipe your feet before coming back inside. I don't want you tracking in mud.$1",
  "Rainy_Day_2": "When it rains, I just want to bury my nose in a book with a hot beverage.",
  "Rainy_Day_3": "Without rain, there is no life...$5",
  
  //NIGHT DIALOGUE
  "indoor_Night_Lance": "Welcome home, my love.$0",
  "Indoor_Night_0": "I've heard tales of the perilous 'Skull Cavern' dungeons. Are they as dangerous as they say?$0",
  "Indoor_Night_1": "I'm happy to see the end of this day. My body is ready for a long slumber.$0",
  "Indoor_Night_2": "I tried my hand at cooking. Luckily we had all the ingredients I needed. [244 242 907 905 240]$0",
  "Indoor_Night_3": "*chuckle* I heard cackling outside. She must be flying tonight...$5#$e#Every mage in our circle is aware of Magnus' breakup. It was very dramatic. Quite the event.$0",
  "Indoor_Night_4": "We should light a nice fire and curl up in front of it after dinner.$4",
  "Rainy_Night_Lance": "I enjoy falling asleep to the sound of gentle rain hitting the roof.$5",
  "Rainy_Night_0": "Our house is well insulated from the weather outside.$0",
  "Rainy_Night_1": "How was your day? Did you have a run-in with any monsters?$1",
  "Rainy_Night_2": "I wonder if it's raining in the highlands too...$6#$e#The outpost can take care of itself. My magical barriers will keep the monsters at bay.$0",
  "Rainy_Night_3": "Only mages with a high ranking are allowed to make a 'Nexus'.$5#$e#The Highlands, Stardew Valley, and Ginger Island are roughly in the same region. So I don't require one.$0",
  "Rainy_Night_4": "*yawn* Shall we head to bed, my darling?$0",  
  
  //AFFECTION DIALOGUE
  "Good_0": "You are my most precious treasure.$4",
  "Good_1": "Sharing my life with you has made me realize how much happier I am now.$0#$b#I thought of myself as a nomad, but you make this house feel like a home.$1#$e#I cherish every moment with you.$4",
  "Good_2": "Living on this farmland with you is quite the adventure.$1#$b#I hope it is for you too, my love.$1",
  "Good_3": "There's a famous monster researcher in Galdora who owns the monster museum.$0#$e#Some of my research and findings are showcased there.$1",
  "Good_4": "My master was a Dragon Knight. I became his pupil at a very young age when my arcane potential was discovered.$0",
  "Good_5": "I crafted this totem for you. It'll bring rain clouds that'll water the farmland. [681]$0",
  "Good_6": "I'm always interested to hear about your day.$1",
  "Good_7": "Did you do something with your hair? You look charming today.$1",
  "Neutral_0": "I'm not fond of watching TV or distracting myself with modern contraptions.$0#$e#I do however enjoy watching movies at the cinema.$1#$b#There's something magical about moving pictures... It captivates the mind.$5",
  "Neutral_1": "Your Grandpa's shrine smells like magic.$0#$e#This farmland has a mysterious history...$5",
  "Neutral_2": "Magnus studies ancient fruit and I study monster crops...$5#$e#In a strange way, our work is somewhat similar.$1",
  "Neutral_3": "The saloon owner is so warm and welcoming. It makes one feel at home while enjoying good food and drink.$0#$b#I can see why his business is as successful as it is.$1#$e#I've been trying to go into town more lately.$5",
  "Neutral_4": "I need to visit my guild soon. I'm running low on mana elixirs.$0",
  "Neutral_5": "Do you ever wonder where we'll move to in the future?$0#$e#Maybe we'll purchase our own private island and live out our days there...$5",
  "Neutral_6": "Where do you think monsters come from, @?$0#$e#Legends say they come from dark ancient magic.$5#$e#I believe there's more than meets the eye.$0",
  "Neutral_7": "The saloon has a fine seasonal selection of draft beer. Better than most taverns I've been to.$5",
  "Bad_0": "Sometimes I feel like I'm a ghost to you...$2",
  "Bad_1": "*sigh* I destroyed expensive rare metals during a magical experiment.$2#$e#Such a terrible waste...$2",
  "Bad_2": "We're both out of the house so often, I rarely see you...$6#$e#I know we both live busy lives, but we still need to find time with each other.",
  "Bad_3": "Could I be better? Can I do better? Ugh...$2",
  "Bad_4": "Not now, @.$3",
  "Bad_5": "Do you ever get the feeling we rushed into this too quickly?...$2",
  "Bad_6": "...$6#$e#%Lance is ignoring you.",
  "Bad_7": "I thought we promised each other we would talk things out if it got bad...$2"
}