
{ 
  //SPECIAL DIALOGUE
  //"Introduction": "You must be Mr. @. Pleasure to meet you.$5^You must be Ms. @. Pleasure to meet you.$5",
  "pamHouseUpgrade": "I can't say I was surprised in the slightest when Robin told me you were the one responsible for funding Pam's new home.$1",
  "pamHouseUpgradeAnonymous": "Robin outdid herself with that beautiful home design for Pam.$0#$e#Now I wonder... just who is this mysterious patron? Perhaps I've met them before!$1#$e#%Gunther smiles at me and tips his hat.",
  "Resort_Entering": "Willy takes pride in that boat of his. Overheard it was his father's.$0",
  "Resort_Leaving": "Perhaps I'll secure a private tour of the island sometime...$0",
  "Resort_Shore": "Have you met my colleague? He excavates here on the island.",
  "Resort_Chair": "Many mysteries on this island, ripe for disovery.$0",
  "Resort_Bar": "Thank you kindly for bartending, Gus.$1",
  "Resort": "%Gunther is busy investigating an artifact.",
  
  //SPRING AND GENERAL DIALOGUE
  "spring_1": "*sniff* Pollen...$2",
  "spring_12": "Penny and the kids have been painting eggs in the library.$1",
  "spring_23": "I wonder what Pierre is selling tomorrow at his stand...$5",
  
  "Mon": "Oh, hello Mr. @!$5^Oh, hello Ms. @!$5#$b#How fares the farm work?$1",
  "Mon2": "*yawn* Hello, Mr. @!$5^*yawn* Hello, Ms. @!$5#$b#Forgive my drowsiness. I was researching ancient artifacts all night.$5#$e#When one is exploring the unknown... it is easy to lose track of time!$1",
  "Mon10": "We received a donation for the remarkable artifacts and minerals on display...$5#$b#Here's a portion of it, Mr. @ [336]^Here's a portion of it, Ms. @ [336]",
  "Tue": "Lost relics of the past are buried under the very earth we walk upon...$5#$e#Mayor Lewis told me he saw you digging up artifacts around town.$5",
  "Tue6": "I'm pondering over a research article's credibility...$5#$b#The fellow who wrote it is questionable.$5#$e#Farewell, Mr. @.$5^Farewell, Ms. @.$5",
  "Wed": "I'm fluent in several languages, including dwarvish.$5#$b#One must understand different languages to unravel the secrets of the past.$1",
  "Wed8": "Did you hear the news? An explorer discovered artifacts in Calico desert!$1#$e#These findings are especially significant to the field.$5",
  "Thu": "*sigh* Some folks never put books back properly...$2#$e#Oh, don't mind my comments Mr. @.$5^Oh, don't mind my comments Ms. @.$5",
  "Thu8": "Perhaps good food and drink is in order for a week of hard work!$1#$e#Have you had the 'shooting comet' cocktail?$5",
  "Fri": "Some day I'll make a groundbreaking discovery!$1",
  "Fri6": "Find any ancient-looking objects lately?$5#$e#There's many secrets buried underneath the soil here in Stardew Valley.$1",
  "Sat": "Penny tutors Jas and Vincent in the library several days a week.$5",
  "Sat4": "The artifacts and minerals you've donated are aiding me in my research, Mr. @.$5^The artifacts and minerals you've donated are aiding me in my research, Ms. @.$5#$e#Thank you.$5",
  "Sun": "Are you finished with farm work today?$5#$e#I have research to conduct tonight... I'm getting closer to a huge discovery!$1",
  
  //SUMMER DIALOGUE
  "summer_1": "Hot and Humid today...$2",
  "summer_10": "The governor is partaking in the festivities tomorrow.$1#$e#The governor is an astonishing public official. He maintains a higher than above-average approval rating.$5",
  "summer_28": "There's a book in the library detailing the scientific findings of moon jelly fish.$5#$b#Truly remarkable aquatic creatures.$1",
  
  "summer_Mon": "You might find buried objects on your farm.$5#$e#Lot's of history at %farm.$5",
  "summer_Mon6": "Slimes have prevailed for some 40,000 years. You may discover petrified slimes in your adventures.$5#$e#Haha! Monsters existed far before humans.$1",
  "summer_Sat": "You may discover ancient swords in the western forest.$5#$e#There was a battle long ago...$5#$e#Farewell, Mr. @.$5^Farewell, Ms. @.$5",
  "summer_Sat6": "Birds are vocal today.$5#$e#Ah. That reminds me... I need to refill the bird feeder.$1",
  
  //FALL DIALOGUE
  "fall_1": "Ah... do you hear that?$5#$b#The rustling sound of leaves travelling with the wind.$1",
  "fall_5": "Willy shared a fishing story with me the other day.$1#$e#He was river fishing late at night in town...$5#$b#Suddenly... a glowing light from the river snatched the bait from his fishing rod!$1#$b#He tells me it was the doing of the 'Angler'.$5",
  "fall_15": "Mayor Lewis says some couple dozen tourists are partaking in the festivities tomorrow.$5",
  
  "fall_Tue": "I made incredible discoveries while pursuing my research at university as a young lad.$5#$e#Good day, Mr. @.$0^Good day, Ms. @.$5",
  "fall_Tue8": "Thank you for your donations, Mr. @.$5^Thank you for your donations, Ms. @.$5#$e#You've done so much for one person!$1",
  "fall_Fri": "Dwarvish gadgets sparked industrial revolutions across the globe.$5#$e#Their technology shapes the modern world we reside in.$1#$b#Oil and coal are dirty... but they meet our societies energy needs.$5",
  "fall_Fri8": "Sometimes I step outside to gaze at the community garden. Folks have put in a lot of work.$5#$b#If I see a crow land in there, I run out to scare it off!$1",
  
  //WINTER DIALOGUE
  "winter_1": "If you find yourself fatigued from the cold, consider visiting the library.$5#$b#The fire will keep you warm.$1",
  "winter_24": "Many folks are excited for the Winter Star Festival.$1#$e#I'm assisting Gus with food preparations.$5",
  "winter_28": "Snow is clearing soon.$5#$e#Good luck with the farming season Mr. @.$5^Good luck with the farming season Ms. @.$5",
  
  "winter_Tue": "Hmmm...$2#$e#...$2#$e#Oh, hello. I'm pondering about a... dilemma in my research.$5#$e#Good day, Mr. @$5^Good day, Ms. @.$5",
  "winter_Tue8": "Clint told me he feels like an archaeologist at times.$5#$e#Well, that's because of the geodes you're having him open for you.$1",
  "winter_Thu8": "I'll never forget your heroic actions in the mines.$5",
  "winter_Sun": "Hello, Mr. @. I hope you're making the most out of your day!$1^Hello, Ms. @. I hope you're making the most out of your day!$1",
  "winter_Sun6": "Oh, you use your hoe to unearth artifacts?$5#$e#I have a handy shovel I could lend you.$1",
  
  //EVENT DIALOGUE
  "gunther_event1": "Yes. Several civilizations lived in this valley many hundreds of years ago. Elves, dwarfs, void spirits...$5#$b#I'm determined to unravel the mysteries surrounding these ancient societies.$5",
  "gunther_event2": "I concur, Mr. @.$5^I concur, Ms. @.$5",
  "gunther_event3": "Hmm... yes. Many weapons lie beneath the very soil we stand upon.$5#$b#Perhaps one day, we'll discover the origin of these ancient wars between other races...$5",
  "gunther_event4": "Hmm...#$b#Allow me to draw my own conclusion in that case, Mr. @.^Allow me to draw my own conclusion in that case, Ms. @.$5",
  "gunther_event5": "Well... yes. I am nervous.$2#$b#This is my first time exploring the mines.$5#$b#I'm honored a revered adventurer such as yourself is escorting me.$1",
  "gunther_event6": "That's reassuring.$5#$b#I'm honored a revered adventurer such as yourself is escorting me.$1",
  "gunther_event7": "I'll be right behind you.$5",
  "gunther_event8": "I'll be right behind you.$5"
  
}

