
{
  //SPECIAL DIALOGUE
  "Introduction": "Would you look at that? It's the new farmer everyone has been talkin' about. Finally moved to the valley, I see.$0#$b#I've been workin' Fairhaven Farm here for many years. It ain't much, but it's honest work.$1#$e#You're lucky you got that free property from your grandpa.$2",
  "claireSaloonPaid": "That was mighty kind of ya to buy that woman's meal, farmer.$0#$e#Gus can't make exceptions for everyone. It's tough bein' a business owner.$0",
  "claireSaloon": "Overheard that woman in the saloon.$0#$e#20g Might not seem like much, but to some it's the difference between having a meal or not.$0",
  "pamHouseUpgrade": "I heard Pam got an upgrade thanks to you, farmer$0#$b#Keep doin' right by the commnunity.$1",
  "pamHouseUpgradeAnonymous": "I heard Pam got an upgrade thanks to an anonymous donor.$0#$e#Hmm... I wonder who it was?$2",
  "Resort_Entering": "Willy said you helped 'em repair their boat. Mighty kind of you, farmer!$0",
  "Resort_Leaving": "Now that there was a vacation!$1",
  "Resort_Shore": "This heat is takin' a toll on me. Might take a dip in the ocean.$2",
  "Resort_Chair": "%Andy is gazing at the gem sea.",
  "Resort_Bar": "*glug glug glug*$6",
  "Resort": "I reckon there's good forage on this island if you look hard enough.$0#$e#Huh? What in the name of Yoba is a 'golden walnut'?$2",
 
  //SPECIFIC MAP AND COORDINATES DIALOGUE
  "Custom_AndyHouse_9_6": "What in Yoba's name are ya doin'!? I'm in bed! Leave now!$7",
  "Custom_AndyHouse6_9_6": "Tryin' to sleep. Come back later, farmer.$5",
  "ForestWest_58_22": "Sorry, farmer. Not in a talkin' mood.$0",
  "SeedShop_37_22": "I didn't always used to believe in Yoba. I came to my senses when I was in dire need of help.$2#$b#Yoba saved me. Leas' I can do is show respect.$1",
  "JojaMart": "Joja has the best and cheapest products. If I shopped at Pierre's I would go out of business.$2",
  
  //SPRING AND GENERAL DIALOGUE
  "spring_1": "Not now, farmer. Busy. Start of a new season!$1#$e#Go get some dirt on ya. Best of luck.$3",
  "spring_7": "Spring onions sprout outta the ground in the dirt outside my farm durin' spring.$0#$e#If I can grab several of 'em, I can make a good meal!$1",
  "spring_12": "You participatin' in the egg hunt tomorrow, @?$3#$e#You should do the right thing and let Vincent or Jas win. That's what I would do.$0#$e#I don't understand why you, Sam, and Abigail participate. It's unfair to the kids.$2",
  "spring_18": "Fairhaven Farm prides itself in supplyin' a lot of forage to the surroundin' provinces.$0#$b#George in particular buys all my leeks.$3#$e#George loves leeks, @. If you wanna get on his good side, give him a leek or two. You'll see that face of his beamin'.$0",
  "spring_23": "We're goin' into the forest tomorrow for the Dance Festival, farmer. I know my way in and out with my eyes closed.$1#$e#Maybe I'll find some good forage on our way there.$3",
  "spring_28": "I heard on the news the summer heat this year will be more intense than an egg on a skillet.$0#$e#Make sure your crops are watered thoroughly, @. Wouldn't want your crops dyin'.$2",

  "Mon": "It's a good day for foragin'. You could make some decent coin.$0#$e#I know my way around Cindersap Forest like the back of my hand.$1",
  "Mon2": "Hi, @. It's the start of a new week.$0#$e#I have a lot of farm work to get done today.$2",
  "Mon8": "Happy Monday, fellow farmer.$1#$e#Start of a new week means start of a new load of work.$1",
  "Tue": "%Andy notices you but isn't saying anything.",
  "Tue2": "How's your work goin' on %farm Farm, @?$0#$e#Glad to hear it.$0",
  "Tue8": "I found some good forage today. I'll eat half of it and ship the rest.$1",
  "Wed": "Need to pick me up some food today. Question is, do I look for forage in the forest or buy somethin' at Joja?$2",
  "Wed4": "You have some dirt on ya. That's a sign of a hard workin' farmer!$1#$e#Keep up the work, @.$0",
  "Wed10": "Hey there. You look like you're full of energy today. Mind sharin'?$3#$e#That was my attempt at a joke. I'm not that funny of a guy.$1#$e#Appreciate our little talks, farmer.$3",
  "Thu": "Uhh. Hello there.$0#$e#%Andy is ignoring you.",
  "Thu4": "It's nice to see you, @.$3#$e#Have a great day.$1",
  "Thu8": "Found me a hefty number of dandelions, leeks, and horseradishes in the forest this morning. I wager these'll fetch a modest price.$1#$e#There's always forage to find in the forest, @. You should try looking around.$1#$e#We can go foragin' together sometime, if you like. I'll show you the good spots.$2",
  "Fri": "If you wanna get on my good side, you should buy me a drink at the saloon.$0",
  "Fri2": "Finally, Friday. Now I can have a drink without feelin' guilty.$2",
  "Fri8": "I'll buy you a drink at the saloon sometime. All your hard work is deservin' of it.$3",
  "Sat": "%Andy sees you but chooses not to say anything.",
  "Sat4": "I slept in this mornin'. Felt like takin' it a bit easy today because it's Saturday.$1#$e#It's no excuse to slack off on my farm work though.$2",
  "Sat10": "We farmers don't got time to lollygag on the weekends. There's too much work to get done.$3#$e#Have a productive day, @. Do this here valley proud.$1",
  "Sun": "I never see you durin' worship hours on Sunday. You don't believe in Yoba, do you?$5",
  "Sun2": "If you want to learn more about Yoba, consider comin' to worship on Sundays.$0#$e#Jodi, George and I are usually the only ones, but we could teach you a thing or two.$3",
  "Sun8": "I enjoy visitin' the Yoba shrine on Sunday. It's a time of self-reflection 'n appreciation.$1#$e#Enjoy the rest of your day, farmer.$3",

  //SUMMER DIALOGUE
  "summer_1": "On days like this I wanna find a nice tree and read passages from my Yoba text.$1#$e#Passage 13:2C is one of my all-time favorites. It teaches strong life lessons.$0",
  "summer_3_1": "That Yoba darn sound last night woke me up! What in tarnation was that!?$5",
  "summer_10": "I'm puttin' some iridium-quality spice berries in that soup tomorrow.$1#$b#It'll add just the right amount of spice to it!$3",
  "summer_20": "Pam had six drinks last night at the saloon. I don't think she's doin' too well. I should check on her.$2#$e#She usually only has four or five drinks. Somethin' is up.$0",
  "summer_28": "Those jellies are showin' up tonight at the beach. You joinin' us there?$0",

  "summer_Mon": "Joja sent me a letter with coupons in it. I get 5 percent off my next purchase!$0#$e#It sure is a great way to start the week.$3", 
  "summer_Mon2": "Don't know how you got all this time to wander around and talk to folks with that big old plot of land you're sittin' on.$2#$e#Some of us would love to have a place like that to spend all day.$2",
  "summer_Mon6": "How's it goin', farmer?$0#$e#Eh, crops aren't doin' as well as I hoped this season. Might be in for a tough year.$2",
  "summer_Mon10": "Sprinklers are amazin' if you want automation on your farm. Fairhaven Farm is a bit too small for those devices though.$0#$e#I don't mind manually waterin' my crops. I actually enjoy it. But a farm as big as yours, you should consider investin'.$0", 
  "summer_Tue": "I lost two crops this morning to some Yoba darn crows. I need to do somethin' bout that.$2",
  "summer_Tue2": "Mayor Lewis and I had a disagreement yesterday. I have a strong feelin' he doesn't like me right now.$2#$e#What was it about? None of your Yoba darn business.$2",
  "summer_Tue4": "Pierre doesn't sell any of my crops or forage in his store. I don't get along with him because of that.$2#$e#Oh, why doesn't he? Because. He isn't a good shop owner. Why else?$2#$e#Times I feel like everyone but you in town just wishes I'd disappear, @.",
  "summer_Tue8": "There was a Yoba darn crow eatin' my crops this mornin'. Blasted flying thieves.$7#$e#Sorry, farmer. Normally I always have time for ya, but I'm not in a good mood to talk.$2#$e#I said not now.$5#$e#%Andy is ignoring you.",  
  "summer_Wed": "Blasted bee stung me today! Next time I need to put on gloves when harvestin' that honey.$2",
  "summer_Wed6": "I need to take a trip to Grampleton soon and have one of them woodcrafters make me a new bee house.$0#$e#I don't have much experience in craftin' my own. I've heard you're good at craftin', though.$0",
  "summer_Thu": "You can always rely on corn for steady and slow profit because it lasts for two seasons.$1#$e#This the reason I plant corn during the summer season. Helps me save on those seed expenses.$0",
  "summer_Thu4": "Did ya know you got a smudge on your face, @? Might wanna check the next mirror you run into.$3#$e#Havin' a lot of dirt on ya is a showcase of a hard workin' farmer.$0",
  "summer_Thu8": "I caught a glimpse of %farm Farm the other day. You've been makin' progress with it, @.$0#$e#I'd love to come take a closer look sometime, if that'd be all right.$3",
  "summer_Fri": "Find anythin' good in the woods lately, farmer?$0#$e#Just don't forage too much. I rely on foragin' for part of my livelihood, y'know.$0",
  "summer_Fri8": "I found a hefty amount of forage in cindersap forest. With what I found; I reckon I might be making a profit this season.$1#$e#Bye, farmer!$3",
  "summer_Sat": "I found some spice berries growin' on the other side of my fence this mornin'.$1#$b#The benefits of havin' a farm in this here forest are beneficial.$0#$e#Have a nice day, farmer.$0",
  "summer_Sun": "Let me know if ya want to borrow my Yoba Text. I got detailed notes on the most popular passages.$0",
  "summer_Sat6": "There's always good forage to find if you know where to look, farmer!$1",

  //FALL DIALOGUE
  "fall_1": "Fall is a good season for foragin', @. There's a mighty number of mushrooms ripe for the pickin'.$0#$e#Don't go grabbin' all of 'em. Save some for me.$2",
  "fall_4": "I seen you walkin' into that there Adventurer's Guild in town. You moonlightin' as one of those monster hunters?$0#$e#That's some dangerous work. I'm thankful you're willin' to put your life on the line for folks like me, keepin' this here valley safe.$1#$b#Thank you.$0",
  "fall_10": "That Sophia girl at the vineyard took over after her parents-$0#$b#Ack, nothin'. You'll need to talk to her about it.$2#$e#You have a good day, ya hear?$0",
  "fall_15": "I'll have my own grange display tomorrow, farmer. Worry not, I don't plan on winnin'.$0#$e#I've never won once; I don't think that'll change tomorrow...$2",
  "fall_23": "I was workin' my crop field yesterday and I saw some military men walk over to the Wizard's Tower.$2#$b#Those scummy government officials are still tryin' to recruit witches and wizards for their war.$5#$e#Pfft. Despicable.$2",
  "fall_27": "Pierre shares his spiced pumpkin cider during Spirit's Eve.$3#$b#He usually only shares it with his 'close' friends.$2#$b#It's nice I'll get to taste some of it after an entire year.$0",
  "fall_28": "Crops are gonna start dyin' soon, farmer. Winter is upon us.$0#$e#I'll see you around, now.$0",

  "fall_Mon": "I harvested several high-quality crops this mornin'. That Joja fertilizer works like a charm every time.$3#$e#I recommend using Joja fertilizer, @. It'll help you turn a profit.$0",
  "fall_Mon2": "Bought a new axe from Clint yesterday. I broke my copper one cutting down some trees in this here forest.$0#$e#Upgrading your tools is important, @. Let this be a lesson for ya.$0",
  "fall_Mon8": "I have a steel hoe Clint crafted for me. He's great at what he does.$0#$e#The upgraded hoe saves me time on my farmwork. You should pick one up if ya haven't already.$1",
  "fall_Tue": "No time to talk, farmer. Not all of us just have the money rollin' in. Gotta earn my livin'.$0",
  "fall_Tue4": "I don't turn my crops into artisan goods like beer or wine. Fairhaven prides itself in supplying high-quality raw crops.$0#$e#Maybe you can teach me how to use some of those contraptions, sometime.$3",
  "fall_Wed": "I found several purple mushrooms in the forest this mornin'.$1#$e#They were real high-quality, too! I reckon they'll fetch a good price.$3",
  "fall_Wed4": "Cindersap Forest is pretty this time of season. It's one of the reasons I choose to live out here, cultivating my land.$3#$e#Have a nice day, farmer.$0",
  "fall_Wed8": "Hey there. Nice of you to speak to me.$3#$e#I have a lot of plannin' to do today.$0", 
  "fall_Thu": "There used to be more farms in the valley before the great recession. Those who couldn't adapt went out of business.$0#$e#I used to have more friends in the valley...$0#$e#%Andy is ignoring you. He looks sad.",
  "fall_Thu8": "Y'know, farmer, used to be when the weekend rolled around I was real lonely. But now we're friends, I look forward to seein' ya.$3",
  "fall_Fri": "Not gonna be able to relax much today. Too much work to do before the week ends.$2",
  "fall_Fri4": "Headin' down to the saloon tonight, @?$0#$e#Maybe I'll see ya there.$3",
  "fall_Fri8": "Y'know, we oughta get together and go on a campin' trip sometime deeper in the forest.$3#$e#Who knows what kinda rare forage we could find?$3",
  "fall_Sat": "%Andy notices you and waves with a smile. He looks busy.",
  "fall_Sat4": "Good day, farmer. I hope this season is treatin' you well.$0#$e#Good luck on %farm Farm. You're doing this here valley proud.$0",
  "fall_Sun": "Only people I get along with well in Pelican Town are George and Pam. Not many people understand me. Maybe it's the age difference.$0#$e#What about Mayor Lewis? That man is a Yoba darn fool if I've ever seen one. Him and I don't meet eye to eye.$2",
  "fall_Sun6": "Livin' in Stardew Valley is the great Ferngillian dream. Beautiful land, natural resources, good people... mostly.$0#$b#What more could someone ask for?$1#$e#Well, I could use more money and land...$2",
  "fall_Sun10": "I go to the saloon every Friday night. It's important to reward yourself for workin' hard.$3#$e#Hope to see ya at the saloon tonight. We can relax and chat instead of talkin' shop.$3#$b#It's good to have a friend around.$1", 

  
  //WINTER DIALOGUE    
  "winter_1": "Winter is my favorite season. It allows me to focus on foragin' instead of managin' my farm.$1",
  "winter_7": "We're gonna be walkin' to that ice fishin' spot in the forest tomorrow, @. I'll be leadin' the way.$1#$e#I know my way in and out of the forest very well. I go in there to forage all the time.$0",
  "winter_12": "Tell me. Do you think that Olivia lady takes an interest in me? I see her eyeballin' me at the saloon sometimes.$3#$e#Maybe I should say hi one of these days.$2",
  "winter_24": "I dislike this time of year. It's a grim reminder to me I don't hold anyone special in my life.$2#$e#I'm not lookin' for your Yoba darn sympathy, farmer.$5#$e#%Andy is now ignoring you.",
  "winter_28": "Are you prepared to plant your crops for spring, farmer?#$e#Good luck to ya! I'll be doin' the same.$1",

  "winter_Mon": "Pierre still refuses to sell my crops in his store, and he wonders why I never shop there.$2#$e#...$2#$e#%Andy is ignoring you. He isn't in a good mood.",
  "winter_Mon4": "I haven't found much forage in the forest today. Is someone else takin' everything?...$2#$e#%Andy is staring at you.",
  "winter_Mon8": "Marnie let me use her seedmaker and I turned my low-quality produce into a lot of seeds.$1#$e#I need to get me one of those machines soon. It'd save me a lot of money.$2#$e#Woodcrafters in Grampleton sell 'em for 6,000G. Expensive, but may be worth the gold in the long run.$0#$e#What? You say maybe you can craft me one sometime? Well, that'd be mighty generous of you.$1",
  "winter_Tue": "Joja sent me several coupons in the mail this mornin'. They treat loyal customers with great care.$1#$e#I need to go to the library and use one of those 'computers'. Needa use their website.$2",
  "winter_Tue8": "Sleepin' in is a luxury I can only afford durin' this season. Not much work to be done around the farm.$0#$e#I see you walkin' up to those mines. You fightin' those monsters?$2#$e#Good luck to ya. There are dangerous creatures in there. Stay safe, @.$0",
  "winter_Wed":  "Ever tried that Blue Moon wine before? I'm not particularly fond of wine, but Sophia does a good job makin' it.$0",
  "winter_Wed4": "I'll never understand how Susan can live right by those there railroad tracks up in the mountain.$2#$b#Those Yoba darn trains would keep me up every night.$2",
  "winter_Wed8": "My drink of choice is Grampleton wheat ale. It's the finest craft beer you'll find in the region.$1#$e#I'll grab ya a bottle next time I pick some up and we can have a sit-down some weekend.$2",
  "winter_Thu": "I dug up several winter roots and snow yams today in this here forest. These'll fetch a nice price.$1",
  "winter_Thu6": "Winter is a mighty fine season to spend time foragin' around the forest. No crops or bee houses to manage!$1#$e#I imagine you appreciate the extra time too, @.$0",
  "winter_Fri": "It's Yoba darn freezin' today. Stay warm, farmer.$0",
  "winter_Fri8": "I recently read a passage in my Yoba text that enlightened me, @: 'Think not ill of others but help them overcome'.$0#$e#There are amazin' lessons to be learned in this here book. Maybe I can share some of my favorite passages with ya, sometime.$3",
  "winter_Sat": "I sometimes see flashy lights comin' from the Wizard's Tower at night. I wonder what he's doin' in there.$2",
  "winter_Sat4": "Tried to chat with Mayor Lewis today and he pretended he didn't even hear me.$2#$e#Won't be mendin' that bridge anytime soon, I s'pose.$2",
  "winter_Sat8": "Too many people these days speakin' nonsense and bein' disrespectful to us older people.$2#$e#I gotta say, I appreciate you act your age instead of your shoe size.$0#$e#You have a great day, @. Keep up the good work on %farm Farm.$0",
}
