
{
//SPECIAL DIALOGUE
"Introduction": "I'm thankful Joja cleared the rockslide. Lewis and I went through so much trouble getting them to remove the rocks.$2#$b#Joja refuses to apologize...$3#$e#I'll see you again soon, dear. I'm happy to have finally met you!$1#$b#It's lovely having another farmer in the valley.$4",
"pamHouseUpgrade": "I envy Robin's craftsmanship. She designed Pam's new home herself!$1",
"pamHouseUpgradeAnonymous": "I envy Robin's craftsmanship. She designed Pam's new home herself!$1",
"Resort_Entering": "I don't usually travel with others in our community. This is fun already!$1",
"Resort_Leaving": "This was a very eventful day!$4",
"Resort_Shore": "I had to conquer my fear of the ocean to get here. I'd say it was well worth it.$0",
"Resort_Chair": "With weather like this, I bet you could grow tropical crops here with ease.$0",
"Resort_Bar": "I'm craving something fruity.$0",
"Resort": "I'm tempted to take an island flower back home with me.$1#$e#No, no, no... I can't separate it from its friends.$2",


//SPECIFIC TILE DIALOGUE
"Custom_SusanHouse_4_15": "I'm thankful Joja cleared the rockslide. Lewis and I went through so much trouble getting them to remove the rocks.$2#$b#Joja refuses to apologize...$3#$e#I'll see you again soon, dear. I'm happy to have finally met you!$1#$b#It's lovely having another farmer in the valley.$4",
"Custom_SusanHouse_24_6": "Excuse me. I'm sleeping.$2",
"SeedShop_14_20": "Wonderful to see you, @! Buying seeds from Pierre today?$0",
"ArchaeologyHouse_16_5": "The library has a few crafting manuals I often reference. They're very helpful.$1",
"Custom_SusanHouse_3_16": "Okay, Sophia! Watch closely!$0",
"Custom_SusanHouse_9_17": "Come back soon, sweetie!$0",

//SPRING AND GENERAL DIALOGUE
"spring_1": "Ah! The beginning of spring, my favorite season. It's lovely seeing the flowers.$1#$e#Good luck farming this year!$0",
"spring_12": "I helped Marnie and Emily paint the eggs for the Egg Festival tomorrow.$0#$e#Jas and Vincent helped too! They're absolute sweethearts!$1",
"spring_23": "We're heading south of Cindersap Forest tomorrow for the Flower Dance Festival. Will you be joining?$0#$e#Gus is making most of the food!$1",
"spring_28": "I've already planned which crops I'll be growing this summer.$0#$e#I'm sure you've done the same.$4",

"Mon": "Hello, @. How goes the day?$0#$e#Happy to hear that!$1",
"Mon4": "There's always so much to do at the start of a new week.$1",
"Mon8": "Happy to see you, @. How's %farm Farm?$0#$e#Wonderful to hear, sweetie. I wish I had your energy.$1",
"Tue": "Hello, @. How's your day?$0#$e#Wonderful!$1",
"Tue4": "I walk up to the summit for exercise. The view there at sunset is positively magical.$0#$e#Have a nice day, dear.$0",
"Tue8": "@! It's wonderful to see you. How are you today?$1#$e#I'm pleased to hear that. I need to do some number crunching tomorrow.$4",
"Wed": "Hi, @. Having a productive day today?$0#$e#I may craft something new soon. Something to challenge myself!$1",
"Wed4": "I have so much to do today, but so little time.$2#$b#How do you manage your time, @? You're always so busy.$0#$e#It's hard to keep up with you!$1",
"Wed8": "Hello. I hope you're having a great day, @.$1#$e#I'll talk to you again soon, honey.$4",
"Thu": "Hi. How are things?$0#$e#Keep up the good work.$1",
"Thu4": "I may need to go get more hardwood from Grampleton soon. I'm running a bit short.$1#$e#Grampleton sells the highest quality wood in the Republic.$4",
"Thu8": "Tomorrow is Friday. I wonder what Gus will cook for the saloon special?$0#$e#Gus never ceases to amaze me. His food gets more delicious every time.$1",
"Fri": "*sigh*... Little sore today. Tweaked my back.$2#$e#Sorry, sweetie. Not the best time to talk.$2",
"Fri4": "I'm on track to finish everything I needed to this week. This weekend will be enjoyable.$1#$e#Enjoy your day, dear.$4",
"Fri8": "Happy Friday, @! Any fun plans for the weekend?$0#$e#I may take the train to visit my brother in Chestervale. My plans aren't set in stone yet.$1#$e#Have a wonderful day!$4",
"Sat": "You're such a hard worker, @.$0#$e#You should take breaks too. It's good for your health!$1",
"Sat4": "I need to start planning my next trip to the Fern Island archipelago.$0#$e#The ring fruit on the island are marvelous. Maybe I can bring some back for you.$1#$e#It's difficult. They spoil so fast...$2",
"Sat8": "Today I'm going to relax and craft something nice.$0#$e#Do you take Saturdays off, @?$1",
"Sun": "Are you ready for the next week? There's so much I need to get done!$1#$e#Good luck to you, @.$4",
"Sun4": "There's a few people in town who visit the Yoba altar on Sundays.$0#$b#I... stopped believing in Yoba a while ago.$2#$e#...$2#$e#%Susan isn't talking. She waves to you.",
"Sun10": "As you get older, time goes by faster and faster.$0#$b#Enjoy every moment of life.$1#$e#Don't take the time you have for granted, honey.$0",

//SUMMER DIALOGUE
"summer_1": "Good luck this summer, @. Make sure your crops don't dry out in the heat!$0",
"summer_10": "I'm bringing my highest quality melons tomorrow for the Luau, @! Chestervale melon seeds are the finest in the region.$1#$e#I'm positive whatever you're bringing will also be a welcome addition to the feast!$4",
"summer_22": "Grampleton has the largest wheat fields in the Ferngill Republic. Wheat gets processed into beer, flour, and sugar.$0#$e#Even though it's cheap, you can make a good profit growing it because it's in such high demand.$0",
"summer_28": "I have a terrible fear of the ocean. I only come to the beach at the end of summer to see the jellyfish.$2#$e#Those docks look like they could give way any minute. I'll be on the beach, where it's safe.$0",

"summer_Mon": "Clint is almost finished upgrading my hoe.$0#$b#It'll improve the efficiency of my morning chores on the farm.$1", 
"summer_Mon2": "There's a family of birds that like to nest on the roof of my house.$0#$e#Maybe my next crafting project will be a bird feeder.$1",
"summer_Mon6": "Do you have any experience crafting, sweetie?$0#$e#It's a handy trick to pick up when you're running a farm.$0#$e#You can automate things, or process produce and animal products into things that are more profitable.$4",
"summer_Mon10": "Grampleton just has the most talented crafters. I take trips there to learn tricks from them.$0#$e#You can join me sometime if you want to learn about crafting, sweetie. It'd be a fun trip.$4",
"summer_Tue": "This summer heat is difficult to work in. Make sure you're keeping yourself hydrated.$0",
"summer_Tue4": "I upgraded my watering can. It took some saving, but I can water my crops much faster now!$1#$e#Clint's smithing work is incredible.$0",  
"summer_Tue8": "I love when it rains, don't you?$4#$e#It gives us farmers a nice break to focus on something besides watering crops in the morning.$0",
"summer_Wed": "I may need to take a trip to Grampleton soon. Short on hardwood.$0#$e#I use hardwood in most of my crafts. There's plenty of it in the forest south of Grampleton.$1",
"summer_Wed8": "I found spice berries growing on the other side of my fence this morning!$1#$b#I'm going to mash them into a yogurt tomorrow. Delicious$4!#$e#Have a great day.$0",
"summer_Thu": "If you live by the railroad long enough, nothing wakes you up in the middle of the night.$0#$e#Except for... a rockslide...$2",
"summer_Thu6": "My melons sold for more than I anticipated.$0#$b#I'll save it to travel or spend it on crafting materials!$1#$e#Anything I can craft for you, @?$4",
"summer_Thu10": "It's wonderful to see you, @. I did a lot of harvesting today.$0#$e#Here's a freshly picked melon from Emerald Farm! I sell most of them in Zuzu City, but I like sharing with my friends, too.$0[254]",
"summer_Fri": "One of my houseplants isn't doing well...$2#$b#She got infected with a fungus I didn't catch until it was too late... I need to do better.$2#$e#%Susan looks sad.",
"summer_Fri6": "It's a little silly, but I treat my houseplants like my family.$0#$e#You've probably noticed I'm pretty independent, @. But I do love my plants. When I travel, I miss them.$2",
"summer_Sat": "Mayor Lewis looked stressed yesterday.$2#$e#That man works harder than any of us... I hope he gets to rest soon.$0",
"summer_Sat6": "I process all of the hops I harvest into beer, then export most of it. Gus sometimes buys some for the Saloon.$0#$e#If you like, sometime I'll give you a few tips on making sure beer comes out just right.$4#$e#Just promise not to tell anyone my secrets.$1",
"summer_Sun": "Summer is nice in Stardew Valley. The temperature stays pretty mild.$0#$e#Closer to the Calico Desert, it gets very hot. We're fortunate to catch the sea breeze.$0",
"summer_Sun8": "Lightning rods may be a good investment if you're looking to expand beyond crops, @.$0#$b#There are a few kinds of machines I want to craft that require batteries.$0#$e#Robin used to sell them, but she stopped because of the Joja monopoly.$2",

// FALL DIALOGUE
"fall_1": "Feel that chill in the air, @? Fall has arrived!$1#$b#I wish you the best of luck this season, honey.$0#$e#I highly recommend growing cranberries and pumpkins. They can make fall extremely profitable.$0#$e#Good luck!$4",
"fall_3": "The crows come out in droves during this season. I hope you have plenty of scarecrows, sweetie.$0#$e#Take care!$1",
"fall_7": "Did you do anything memorable this week?$0#$e#I try to do at least one interesting thing every week that sticks with me.$4",
"fall_15": "Have you decided what you'll be putting in your grange display tomorrow, @?$0#$e#Pierre is difficult competition.$1",
"fall_20": "I just love how colorful fall is, don't you?$1#$e#As farmers we see plenty of green things. It's nice to see the world in a more vibrant palette.$4",
"fall_26": "Spirit's Eve is tomorrow, sweetie.$1#$b#I heard from Mayor Lewis that Marlon and a friend from Castle Village are capturing monsters for us.$0#$e#We'll be able to look at them through steel cages. So scary!$4",
"fall_27": "Flashing lights were coming from Pelican Town earlier today. I believe the Wizard is summoning the maze.$1#$e#Not sure how that 'magic' stuff works.$2#$e#See you tonight, @.$4",
"fall_28": "Hello, @. Fall is just about at a close. Crops won't last much longer.$0#$e#Are you spending this winter fishing or mining?$1",

"fall_Mon": "Hiking up to the summit is great cardio. I go up there every week.$1#$e#Seeing the whole valley spread out beneath you lets you appreciate how beautiful this place is.$4",
"fall_Mon4": "Have you been all the way up to the top of the summit?$0#$e#I know it's a beautiful view, but... passing all those graves makes me feel a little glum.$2",
"fall_Mon10": "Passing all of those adventurers up on the summit makes me worry about you, sweetie.$0#$b#Make sure you take care of yourself when you're adventuring. You're a treasure to have around.$0", 
"fall_Tue": "Don't forget that fall season is mushroom season, honey.$0#$e#You can turn quite a profit, if you're quick about it.$4",
"fall_Tue4": "I found mushrooms at the summit today. Still need to decide if I'll sell or cook them.$0#$e#The summit produces forage because of the rich soil. I'd check up there regularly if I were you.$1",
"fall_Wed": "It's lovely there's a pumpkin patch during the town fair for the tourists.$0",
"fall_Wed6": "Don't take these moments for granted. Make every day count, sweetie.$0#$e#When you get to my age, you'll appreciate the memories you made when you were young.$1",
"fall_Wed10": "I like you because you understand that life should be an adventure, @.$4#$b#Some people might think that running a farm is boring, but you and I know that it takes so much time, patience, and creativity to do well.$4#$e#May our lives continue to be as rich as they have been so far, sweetie.$4", 
"fall_Thu": "*sigh*... Andy was a bit much at the saloon last night. He just doesn't have a filter.$2#$e#We're all special in our own little ways.$0#$e#Have an enjoyable day, dear.$1",
"fall_Thu8": "I saw Andy walking with Joja boxes the other day. He seemed to be having a nice day.$0#$b#I don't support Joja, but that doesn't mean I'll judge others who do.$0#$e#Why don't I support Joja? Well...the world is a precious place with limited resources, sweetie. I think they're squandering it.$2",
"fall_Fri": "Mushrooms pop up in Cindersap Forest this time of year. Might forage for some soon.$0#$e#Andy and Leah usually take all of them, though...$3",
"fall_Fri4": "There were hazelnuts around the mountain river today. I'm going to roast them!$0#$e#Roasted hazelnuts are rich and delicious. I'll share some with you sometime.$1",
"fall_Fri10": "I found another bounty of hazelnuts and roasted them this morning! Here's some for you!$1[607]#$e#Enjoy, sweetie.$4",
"fall_Sat": "Managing grape trellises is different from ordinary crops. I need to think about how to correctly route the vines.$2#$e#I'll try asking Sophia. She knows everything there is to know about grapes.$1",
"fall_Sat8": "The fences by the railroad need to be repaired soon. I need to stock up on wood.$0#$e#How often do you repair your fences, @?$0#$e#Oh! I see! You're clever, aren't you?$1",
"fall_Sun": "Leaves keep finding their way into my house! Good thing I have a broom.$1",
"fall_Sun4": "Stardew Valley has the richest soil in the Ferngill Republic. Crops grown here are bigger and tastier.$0#$e#If you use fertilizer, your crops will be even healthier!$1",
"fall_Sun10": "I was meaning to talk to you, @.$0#$b#I fertilized my crop fields and I had some left over. I wanted to give it to you.$4#$b#No need to thank me! Have a wonderful day, sweetie!$1[369]", 

//WINTER DIALOGUE    
"winter_1": "Up in the mountains, Robin and I get lots of snow.$0#$e#I may build a snowman soon. Wouldn't that be cute?$1",
"winter_7": "Are you participating in the fishing contest tomorrow?$1#$b#I used to fish when I was younger, but never got back into it.$0#$e#Best of luck tomorrow!$4",
"winter_12": "My brother is visiting soon. His daughter is adorable!$1#$b#She loves playing video games. I have a Super Neendo she plays when she visits.$0#$e#I don't play it myself. I'm too old for those electronic contraptions.$4",
"winter_17": "A merchant sold me a houseplant.$0#$b#You can always find something amazing at the night market!$1",
"winter_24": "The Winter Star Feast is tomorrow! It's such a joyous day.$0#$e#I picked up the perfect gift! I hope he loves it.$1",
"winter_28": "Ready to sow seeds soon?$0#$e#I finished planning weeks ago. Just need to wait for the snow and ice to thaw - won't be long now.$1",

"winter_Mon": "I feel bad for all those poor animals out there, freezing in this cold weather.$2#$e#I have a soft spot for little critters.$0",
"winter_Mon4": "Sautine City has beautiful shores and tourists from around the world.$0#$b#Every time I go there I meet someone whose life is completely different from mine. It's like a window into a different world.$4#$e#You should try traveling, @. Tickets can be expensive, but the experience is well worth it.$1",
"winter_Mon8": "I've almost saved up enough money to take a trip across the country.$0#$e#Travelling is a big hobby of mine, so living by the railroad is convenient.$4#$e#Think you'd ever want to take a trip with me, sweetie? I'm a great traveling companion!$1",  
"winter_Tue": "How's your winter, @? Are you enjoying your time off?$1#$e#I've been crafting and traveling. It's a wonderful time of year.$0",
"winter_Tue6": "I'm glad I have wood stockpiled. My house doesn't have a fancy heater system. I rely on the fireplace.$0#$e#Stay warm this winter, @! You're always welcome to stop by and sit with me by the fire for a little while.$4",
"winter_Wed":  "I love stepping outside at night when it snows. Since snow absorbs sound, it's very quiet.$1#$e#Stay warm, @.$0",
"winter_Wed4": "I enjoy reading books during winter. Don't have to worry about the crops.$0#$e#I know you don't take weekends off, but you should enjoy some time for yourself too! You deserve it.$1",
"winter_Wed8": "We both work too hard, don't we?$0#$e#Let's make a pact to both take it easy this weekend. No long hours in the mines, no hikes up the summit... just cozy days in front of the fireplace with a nice book or some memories.$4#$e#It'll be tough to sit still for a while, but I think we can both manage it.$1",
"winter_Thu": "I often see Alex visiting the bath house.$0#$b#The workout room is kept in good condition.$4#$e#Maybe because no one but Alex uses it.$0",
"winter_Thu6": "I hike up to the summit pretty often, even in the winter.$0#$e#There's lots of crafting materials and forage, and the view is just breathtaking.$1#$e#Join me sometime, @?$4",
"winter_Fri": "Do you go to the saloon on the weekends often?$0#$e#In the winter, it's tempting. A little bit of cider or ale knocks the chill right out of my bones.$4",
"winter_Fri8": "I'm not sure if I'm just getting older, but this winter seems colder than usual.$2#$e#I'm itching to take off and travel somewhere warm.$4#$e#Maybe someday we'll both just get on the train and ride it until we're somewhere we've never been, @. What do you think?$4",
"winter_Sat": "Call me old-fashioned, but I prefer writing letters instead of emailing.$0#$e#All of this new technology is advancing too fast for me to keep up with.$2",
"winter_Sat8": "Do you keep in touch with your family, @?$0#$e#Life here in the valley is a little like living in a bubble. It's easy to forget the outside world, surrounded by the mountains.$4#$e#It's important to make sure you stay connected with the world, whatever way works best for you.$4",
"winter_Sun": "Almost time to start preparing for the next year.$1#$e#Hmm... what should I grow this spring?$0",
"winter_Sun6": "I was clearing my crop fields this morning, preparing for spring, and I dug up several snow yams.$0#$b#I think I'll eat this with dinner tonight after I wash them!$1#$e#Try and dig a few up while you can, @. They taste great roasted with a little butter and brown sugar.$4"
}