{
  //SPECIAL DIALOGUE
  "patio_Claire": "What a lovely view of the farm. The weather today is perfect.$1",
  "spouseRoom_Claire": "Mmm... what's on the agenda today?$1#$e#My schedule is always busy... it's nice to be organized, though. Otherwise I'd forget things.$5",
  "funReturn_Claire": "Work was exhausting today... but I did talk to some interesting people.$0",
  "funLeave_Claire": "Good morning, dear.$1",
  "OneKid_0": "I envy %kid1. Growing up on %farm farm would make for an incredible childhood.$1",
  "OneKid_1": "%kid1 made a bit of a mess in the living room...$2#$e#Don't worry. I'll take care of it.$1",
  "OneKid_2": "%kid1 has your eyes...$1#$e#Hehe...$7",
  "OneKid_3": "I don't think anyone is ever ready to be a parent... but we're doing a good job.$1#$e#%kid1 loves being carried around the house.$5",
  "TwoKids_0": "I fed %kid1 and %kid2 their organic apple yogurt. They eat so much!$1",
  "TwoKids_1": "Our children are so wonderful... it's our responsibility to raise them the right way.$1",
  "TwoKids_2": "We're fortunate %kid1 and %kid2 are healthy.$1",
  "TwoKids_3": "%kid1 started walking at such an early age... maybe they'll become a dancer like their mother?$1#$e#%You hug Claire.#$e#Hehe...$7",
 
  //SEASONAL DIALOGUE
  "spring_Claire": "I drank a cup of green tea this morning. I feel much more energetic.$5",
  "spring_1": "Happy new year. I have a feeling this year will be eventful...$1",
  "spring_7": "The weather is getting warmer!$6",
  "spring_13": "The egg festival is today? Are we attending?$1",
  "spring_24": "This weather will be perfect for the flower dance.$1",
  "summer_Claire": "I want the weather to stay sunny and hot forever.$1",
  "summer_1": "I'm ready for hot weather, perfect blue skies, and apricot pies!$5#$e#I'll do what I can to help around the house. I know the start of a season is a lot of work.$1#$e#Good luck today!$6",
  "summer_11": "I hope there's apricot pie at the Luau.$1#$e#Have you decided what you'll add to the soup?$5",
  "summer_28": "As gorgeous as the moonlight jellyfish are, they still mean summer is ending...$0#$e#I need to sort through my wardrobe and put together some cute outfits for the fall.$1",
  "fall_Claire": "I may go foraging for mushrooms in the forest today.$1#$b#There's a dish I want to make that calls for a variety of mushrooms.$5",
  "fall_1": "It's starting to get colder...$2#$e#Um. Let's keep the fireplace on. Okay?$0",
  "fall_16": "Good luck today at the Stardew Valley Fair, dear.$1#$b#It must feel good to show off your hard work!$5",
  "fall_27": "Magic is intriguing. I wonder how someone summons a maze...$1#$e#I know you talk to the local wizard from time to time. Maybe you could ask them?$5",
  "winter_Claire": "I don't know how you can work outside in this cold.$1",
  "winter_1": "*sigh*... it's cold.$0#$e#Would you mind if I turned the thermostat up?#$e#%You hug Claire to warm her.#$e#Hehe...$7",
  "winter_8": "Why does the ice fishing contest have to be so deep in the woods where it's extra freezing...$2#$e#I'll be huddled up at the campsite fire...$1",
  "winter_12": "I took out the garbage and I almost slipped on some ice...$2#$e#I'm okay. It just startled me...$1",
  "winter_25": "Merry Winter Star, @. I brewed us a special blend of caffeinated green tea.[614]$4#$e#You're the best gift of all...$4#$e#%You hug Claire.#$e#I love you...$7",
 
  //DAY DIALOGUE
  "Indoor_Day_0": "Good morning. I got up early and made coffee. [395]$1",
  "Indoor_Day_1": "You're always growing new things and changing the scenery of our farm... I love it.$1",
  "Indoor_Day_2": "Can you hear the birds chirping outside?$1",
  "Indoor_Day_3": "I have a feeling something good will happen today.$1",
  "Indoor_Day_4": "The smell of breakfast woke you? Well, dig in! [201 195 194 210 211]$5#$e#I made it the way you like it...$1",
  "Outdoor_Claire": "I'm just admiring the farm. Don't worry about me!$1#$e#Are you going into town today?$0",
  "Outdoor_0": "Good morning. You managed to roll out of bed early...$1#$e#I have the day off to do whatever I like.$6",
  "Outdoor_1": "My skin is getting a bit pale. Too much time indoors... a little sunshine should help.$1",
  "Outdoor_2": "What's on the calendar today for you?$1#$e#Sounds fun!$5",
  "Outdoor_3": "I enjoy waking up early in the morning, listening to the birds start their day.$1",
  "Outdoor_4": "This place reminds me of the countryside. There's so much room!$1",
  "Rainy_Day_0": "Oh, you have work to do outside? Don't catch a cold...$1#$e#And don't forget to wipe your shoes!$5",
  "Rainy_Day_1": "I enjoy staying inside with a hot cup of green tea on days like this.$1",
  "Rainy_Day_2": "I'm going to try a new recipe I found online the next time I cook dinner.$1#$b#I know you'll love it.$5#$e#Oh? Yes?$1#$e#...$4#$e#Oh! You're silly!$7",
  "Rainy_Day_3": "Oh, good morning. It's rainy weather today...$0",
  "Rainy_Day_4": "My goal today is to stay inside and be productive. Maybe try something new...$1",
 
  //NIGHT DIALOGUE
  "Indoor_Night_0": "Welcome home! How was your day?$1",
  "Indoor_Night_1": "Oh, it's %time? The day went by so fast...$0",
  "Indoor_Night_2": "I washed the dishes and swept the house while you were out.$1#$e#I had a pretty productive day!$5",
  "Indoor_Night_3": "Hello, dear. Welcome back.$1#$e#Oh, mine? My day was gratifying.$5",
  "Indoor_Night_4": "I made dinner while you were away. Here's your plate. [606 209 207 214 224 235 236]$1#$e#So? How is it? I hope you think it's delicious.$5#$e#!!!$7",
  "Rainy_Night_0": "I wonder how birds sleep during these cold wet nights...$0",
  "Rainy_Night_1": "Oh! You're soaked. Let me fetch a towel for you.$1",
  "Rainy_Night_2": "Hear the rain hitting the roof? It's soothing...$1#$e#Um. Shall we head to bed soon?...$4",
  "Rainy_Night_3": "I just finished making dinner. I thought we'd eat something healthy tonight. [196 609 610 200 607 650]$1",
  "Rainy_Night_4": "*yawn*... I'm ready to sleep soon.$0",
 
  //AFFECTION DIALOGUE
  "Good_0": "You know, I never imagined I'd move to Stardew Valley. Do you think destiny brought me here?$1",
  "Good_1": "Oooh... You look handsome today, @. I see you shaved.$4^Oooh... You look beautiful today, @. I love the way you did your hair.$4",
  "Good_2": "Is there room on the farm to raise some birds? I'd handle all the work!$5",
  "Good_3": "I envy your skills in craftsmanship. All the lovely machines and devices you've made are wonderful creations.$1",
  "Good_4": "I feel like I can understand what animals are thinking when I look at them...$1#$b#I wonder if there's a wizard or witch who can talk to animals?$0#$e#You talk to the local wizard... can they understand animals?$1",
  "Good_5": "You smell like fresh air, sunshine, rain, and the seaside... I could recognize you with my eyes closed.$7#$e#...$4",
  "Good_6": "I discovered a beautiful piece of classical music we could dance to together.$1#$e#It gets easier when you get into the rhythm.$5",
  "Good_7": "The mermaid's pendant you gave me is beautiful. I'll always cherish it.$1",
  "Good_8": "You always watch out for me. It's very encouraging...$1#$e#Please... you're making me blush...$4",
  "Good_9": "Oh. You smell something sweet? It's coming from this...[220 221 222 223 234 611 612 608]$1#$e#The look on your face... Hehe!$7",
  "Neutral_0": "I used to eat frozen meals for dinner... but now I find myself reading cook books and making real meals.$1#$e#I have a surprise planned for you the next time I make dinner!$6",
  "Neutral_1": "It's fun living with you. I... thought I'd be alone all my life.$1#$e#%You hug Claire.#$e#Hehe!$7",
  "Neutral_2": "We should take a trip to Zuzu City in the future and watch the opera.$1",
  "Neutral_3": "My diet's improved since I met you. I used to eat frozen Joja meals everyday.$1#$e#I love cooking from scratch with produce we grow ourselves.$5",
  "Neutral_4": "I... don't regret moving to the valley to spend my life with you.$1#$e#It's... different from the countryside, but in a good kind of way.$5#$e#%You hug Claire.#$e#Hehe...$7",
  "Neutral_5": "Will we live in the valley forever?$1#$e#Sorry. That was a strange question to ask.$0#$e#%You smile at Claire.#$e#...$5",
  "Neutral_6": "I get all the dance practice I need at aerobics class on Tuesdays.$1#$e#My favorite part is talking to everyone before and after...$5",
  "Neutral_7": "We should bake something together soon. I know the perfect recipe...$4",
  "Neutral_8": "I've become good friends with some of the ladies at my weekly aerobics class.$1#$e#Um... You should join me sometime.$5",
  "Bad_0": "I get nervous when you go down into the mines...$2#$e#I can't lose you...$2#$e#%You tell Claire nothing bad will happen.#$e#I'll hold you to that.$1",
  "Bad_1": "*Sigh*... I don't feel well today.$3#$e#I might have caught something...$2",
  "Bad_2": "Please... If you need quiet time to yourself, that's okay with me...$2",
  "Bad_3": "Did I do something wrong? You seem so... distant lately.$2",
  "Bad_4": "...$0#$e#...$3#$e#%You ask Claire what's wrong.#$e#I feel like you value your farm work more than me...$2",
  "Bad_5": "I'm sick and tired of being so cold all the time...$2",
  "Bad_6": "...$2#$e#I'm not avoiding you. I'm just not very good at talking about my feelings.$2#$e#Sorry...$2#$e#%Claire edges away from you.",
  "Bad_7": "Can you make dinner tonight please? I don't feel like cooking...$0",
  "Bad_8": "Spending this much time with me must be boring...$2#$e#Sorry...$2#$e#%Claire doesn't want to talk.",
  "Bad_9": "Do you... think I'm too skinny?$2#$e#I'm just... thinking to myself. Don't mind me.#$e#%You take Claire's hand.#$e#...$1",
}