{

//Scarlett is usually working in the valley during these days, but players can catch her walking back home or in her house.
"Mon": "I'm really craving some cherries right now.$0#$e#They're like one of my favorite fruits!$1#$b#One of my neighbors has a giant cherry tree in their backyard. When they're in season they give us a basket of them.$0",
"Mon4": "Not gonna lie, I'm like low key jealous of Sophia's cosplay room.$0#$e#My papa is kind enough to let me use his work bench in the garage for my projects.$1#$e#The sewing machine in my room was a handy down from a close family friend.$0#$b#It does the job!$1",
"Mon8": "Keeping a clean and tidy room is kinda tough, but it's nice knowing where everything is now I guess.$0",
"Tue": "My papa cherishes his pickup truck. It's like his most prized possession.$0#$e#Even though I have my driver's license, he won't let me take it out.$2#$e#*sigh* Maybe someday. I'd like to take a trip somewhere.$0",
"Tue8": "I've been itching to take a long road trip across the country. I want to see something new!$0#$e#If I ask really nicely, maybe my papa will let me borrow his truck.",
"Wed": "Most folks who live in the suburbs work in downtown Grampleton.$0#$e#My papa is one of those people! He owns his very own store!$1",
"Wed4": "%Scarlett is chewing food and notices you.#$e#*munch* Hey! Sorry, I was eating goat cheese.$0#$e#Here, want some? This stuff is seriously my favorite.[426]$1",
"Wed8": "Hey, it's one of my favorite people! What's the latest gossip?$1#$e#That sounds super important. You make a huge difference for a bunch of people, did you know that?$0",
"Thu": "You look like you're on a mission today! What do you have going on that's so important?$0#$e#You're a busy bee!$1",
"summer_Thu": "Ugh. I just... Ugh!$3#$e#My dad and I had a disagreement about something. We don't always see eye to eye on things...$2#$e#I'm not in the mood to talk.$3#$e#%Scarlett doesn't want to talk anymore.",
"Thu6": "I'm learning so much working as a farmhand for Susan and Andy.$1#$e#I feel like I can really use these skills in the future.$0",

//Scarlett is always home during these days (except Sat during winter when she's sleeping over at Sophia's)
"Fri": "I feel like having a lazy Friday.$0#$e#I should probably take out the trash soon.$0",
"Fri2": "Sorry my room is kinda messy.$7#$e#So, you're here in Pondwood! Is there anything you want to do?$0#$e#Oh! I can show you my manga collection!$1#$e#I've been collecting manga since I was like seven years old.$0#$b#It all started when I took a wrong turn at a public library and found what I thought were picture books!$1",
"winter_Fri4": "I'm super tempted to make a snow angel.$0",
"Fri8": "Next time Pondwood has a 'get-together', I'll give you a holler. We'd like to have you!$1",
"spring_Fri8": "You know, I've never really been interested in going to college.$0#$b#It's something my papa wants me to do. To get an 'education'...$2#$e#I'm more of a 'hands-on approach' type of gal.$1",
"fall_Fri8": "There's a cool carnival in Grampleton during this time of the season.$0",
"winter_Fri8": "The kickoffs are happening soon! Go Tunnelers!$1#$e#Do you watch gridball, @?$0",
"Sat": "Hey, it's awesome to see you! What are you up to?$1#$e#I don't know how you do it, @. You always know how to keep yourself busy.",
"summer_Sat": "The river by our house keeps the yard nice and cool during hot summer days.$0",
"fall_Sat": "*sigh* leaves keep finding their way into the garage.$2#$e#My papa really should close the garage door, but he likes to show off his truck.$3",
"winter_Sat": "Hey, it's awesome to see you! What are you up to?$1#$e#I don't know how you do it, @. You always know how to keep yourself busy.$0",
"winter_Sat2": "I always try to make time in my schedule to visit Sophia.$0#$e#I wished we lived by each other. Maybe when I save up enough money I can move to Stardew Valley.$0",
"winter_Sat8": "One day, Sophia visited and we had grampleton orange chicken for dinner. She never had it before.$0#$b#She ate her entire plate in like two minutes!$1#$e#I offered her some of mine and she ate half of that.#$b#It's probably one of my favorite memories of her!$1",
"Sun": "Hey! It's great to see you. How was the train trip?$1#$e#Not everyone has a car. Most of our neighbors rely on the local train station to commute to work.",
"Sun4": "Our neighbor's dog down the road is a wild one.$0#$e#She always gets the zoomies!$1",
"Sun8": "Hey there! It's nice of you to visit.$1#$e#You can help yourself to anything in the fridge if you're hungry.$0#$e#Oh, don't get into the sponge cake. My papa made that for one of his friends down the road.$1",
"summer_Sun8": "%Scarlett is chewing food and notices you.#$e#*munch* Hey! Sorry you just saw me stuffing my face with goat cheese.$0#$e#Here, want some? This stuff is seriously my favorite.[426]$1",
"fall_Sun8": "We should totally have a slumber party sometime!$1#$b#I know this really good popcorn seasoning recipe.$0#$e#I learned it from Hank. It's a mix of coconut curry, gingerbread, and cinnamon sugar.$0",
"summer_Sun8": "My dad and Hank would like to have you over for dinner sometime.$0",

//schedule dialogue
"Custom_BlueMoonVineyard_27_33": "Ready to get to work, Sophia!?$1",
"Custom_SophiaHouse_3_25": "I'm helpin' Sophia today!$1",
"Custom_SophiaHouse_10_25": "We're gonna go to the saloon this evening. Want to join?$0",
"Custom_SophiaHouse_15_24": "That was a tough day, huh Sophia?$1",
"Custom_SophiaHouse_5_22": "Isn't Sophia's cosplay room cool or what?$0",
"Custom_SophiaHouse_17_21": "This hardwood came all the way from Grampleton, my home town!$1",
"Custom_SophiaHouse_20_7": "Whoa! She didn't tell me she had this volume!$1",
"Custom_SophiaHouse_23_6": "Not cool, @! I'm sleeping.$2",
"Custom_SophiaHouse_20_37": "Yeah! Let's go to the saloon!$1",
"Saloon_24_18": "I'm lovin' the ambience of this place.$0",
"Custom_GrampletonSuburbs_21_15": "I'm taking out the trash right now. Let's talk again in a sec okay?$0",

//event dialogue
"scarlett_event1": "You're kinda like me then! I bet you get nice payouts!$1",
"scarlett_event2": "Whoa, that's public information in Pelican Town? That's a cool idea!$1#$b#Maybe that's something Pondwood can do too.$0",
"scarlett_event3": "Festival postings are my absolute favorite! There's always new flyer designs each year.$1",
"scarlett_event4": "I guess it's not something for everyone. That's okay though!$0",
"scarlett_event5": "...$2#$b#I don't blame you. I probably would have done the same if I overheard something like that.$2",
"scarlett_event6": "Uh huh... Sure.$3#$b#...$3#$b#...$2#$b#I guess I don't blame you. I probably would have done the same if I overheard something like that.$2#$b#But at least I would have been upfront.$3",
"scarlett_event7": "I bet! You have so much space to do whatever you want.$0",
"scarlett_event8": "I know right? My papa let's me use the flower bed outside the house to grow things so I totally get what you mean.$0",
"scarlett_event9": "I've always wanted my own goats. I'd get to eat all the goat cheese I want!$1#$b#I wish Marnie needed help at her ranch, but she has it all handled.$0",
"scarlett_event10": "Yeah, I'm kinda the same way. I don't know what I'd do with myself if I had nothing to do.$0",

//Resort Dialogue
"Resort_Entering": "I can't wait to stretch out my toes on the warm sand.$0",
"Resort_Leaving": "It's a long way back home. I had fun today though.$1",
"Resort_Shore": "What's up with the wrecked pirate ship?$0",
"Resort_Chair": "You don't get weather like this in Grampleton!$1",
"Resort_Bar": "Do all the drinks come with those small umbrellas?$0",
"Resort": "The coral reefs are pretty.$0",

}
