{
    //Frontier Farm Menu
	"FrontierFarm.Description": "Grenzfarm_Ein weitläufiges Grundstück an der Grenze zur 'Ferngill Republic Frontier'. Viele verschiedene wilde Bäume sind hier verwurzelt und es gibt Geheimnisse zu entdecken. Du beginnst mit einem Birnbaum.",

	//Internal Map Data
	"FrontierName": "Ferngill Republic Frontier",
	"FrontierName.HotSpring": "Heiße Quelle",
	"FrontierName.Cave": "Klippenhöhle",
	"FrontierName.FarmCave": "Farmhöhle",
	"FrontierName.DesertTunnel": "Wüstentunnel",
	"FrontierName.HiddenCave": "Versteckte Höhle",
	
	//Map Strings
    "SignPost": " Farm^` Berg^> Pelikan Stadt^= Marnies Ranch",
	"Minecarts": "Der Lorenwagen funktioniert nicht...",
	"minecart.Right": "Bauernhof - Rechts",
	"minecart.Left": "Bauernhof - Links", 
	"minecart.Middle": "Bauernhof - Mitte",
	"minecart.Ravine": "Grenzland - Schlucht",
	"minecart.Mountain": "Grenzland - Berge",
	"minecart.Grassland": "Grenzland - Grasland",
	"minecart.Beach": "Grenzland - Strand",
	
	//Events
	"OpeningEvent.01": "Hallo! Du musst @ sein.#$b#Ich bin Robin, die örtliche Schreinerin. Bürgermeister Lewis hat mich hierher geschickt, um dich abzuholen und dir den Weg zu deinem neuen Zuhause zu zeigen. Er ist gerade dort und räumt für deine Ankunft auf.#$b#Der Hof ist gleich hier drüben, wenn du mir folgen möchtest.",
    "OpeningEvent.02": "Das ist %farm Farm.",
    "OpeningEvent.03": "Was ist los?#$b#Sicher, es ist etwas zugewachsen, aber unter all dem Durcheinander ist guter Boden!#$b#Mit ein wenig Hingabe wirst du es im Handumdrehen aufgeräumt haben.",
    "OpeningEvent.04": "...Und hier sind wir, dein neues Zuhause.$h",
    "OpeningEvent.05": "Ah, der neue Bauer!$h",
    "OpeningEvent.06": "Willkommen! Ich bin Lewis, Bürgermeister von Pelikan Stadt.#$b#Weißt du, jeder hat nach dir gefragt.#$b#Es kommt nicht jeden Tag vor, dass jemand Neues einzieht. Das ist eine ziemlich große Sache!",
    "OpeningEvent.07": "Also... Du ziehst in das alte Häuschen deines Großvaters ein.#$b#Es ist ein gutes Haus... sehr 'rustikal'.",
    "OpeningEvent.08": "Rustikal? Das ist eine Art, es auszudrücken... $4#$b#'Verkrustet' wäre vielleicht etwas treffender.$4",
    "OpeningEvent.09": "Unhöflich!",
    "OpeningEvent.10": "Hör nicht auf sie, @. Sie versucht nur, dich unzufrieden zu machen, damit du eine ihrer Hauserweiterungen kaufst.$u",
    "OpeningEvent.11": "Hmpf.",
    "OpeningEvent.12": "Jedenfalls... Du musst von der langen Reise müde sein. Du solltest dich etwas ausruhen.#$b#Morgen solltest du die Stadt ein wenig erkunden und dich vorstellen.#$b#Die Stadtbewohner würden das zu schätzen wissen.",
    "OpeningEvent.13": "Oh, ich hätte fast vergessen. Wenn du etwas zu verkaufen hast, leg es einfach in diese Kiste hier. Ich komme nachts vorbei, um es abzuholen.#$b#Nun... Viel Glück!",
    "Marnie.Event.01": "Hallo @! Jetzt, da du Nutztiere besitzt, dachte ich, ich verrate dir ein kleines Geheimnis.$0",
    "Marnie.Event.02": "Sie werden nicht aus den eingezäunten Bereichen deines Hofes entkommen, also kannst du sie ruhig offen lassen!$1",
	
	//Questlines
	"GilMinecarts.01": "Ackerland-Loren",
	"GilMinecarts.02": "Gil kann die Loren auf meinem Hof reparieren, aber er braucht Ressourcen.",
	"GilMinecarts.03": "Liefere 24 Eisenbarren in die Lagerkiste östlich meines Hofes.",
	"GilMinecarts.04": "Liefere 24 Kupferbarren in die Lagerkiste östlich meines Hofes.",
	"GilMinecarts.05": "*gähn* Ein Vögelchen hat mir gezwitschert, dass die Loren auf deinem Hof außer Betrieb sind...",
	"GilMinecarts.06": "Ich habe früher selbst in diesen Tunneln gearbeitet, als ich noch ein junger Bursche war.#$b#Ich kenne mich mit diesen robusten Karren aus und kann sie für dich wieder flottmachen.",
	"GilMinecarts.07": "Großartig. Ich brauche zwei Dutzend veredelte Eisen- und Kupferbarren, um die Räder zu reparieren. Marlon wird eine Lagerkiste östlich deines Hofes abstellen.#$b#Ich bringe deine Karren wieder zum Laufen, Bauer. Ach. Oder war es Abenteurer? Ich komme durcheinander.",
	"MarlonMinecarts.01": "Morgen, @. Komm bei Gelegenheit zur Gilde. Gil möchte mit dir über etwas reden.",
	"MarlonMinecarts.02": "Die Loren in den Minen waren laut Gil irreparabel beschädigt.$2#$b#Und doch haben sie irgendwie wieder angefangen zu funktionieren...$0#$e#Weißt du etwas darüber, @?$0",
	"MarlonMinecarts.03": "Alles scheint in Ordnung zu sein. Gil wird heute mit der Arbeit an deinen Loren beginnen.$0#$b#Er sollte bis morgen fertig sein.$0",
	"MarlonMinecarts.04": "Ziemlich praktisch, Loren auf seinem Ackerland zu haben.$0",
	"DwarfTunnel.01": "Kaliko-Wüste-Abkürzung",
	"DwarfTunnel.02": "Der Zwerg sagte, er würde eine Abkürzung zur Wüste in der Nähe meines Bauernhauses mit 'Höhlenräumbomben' öffnen, im Austausch gegen Diamanten.",
	"DwarfTunnel.03": "Liefere 36 Diamanten direkt an den Zwerg.",
	"DwarfTunnel.04": "Hallo. Ich habe einen Vorschlag zu machen. Besuche mich morgen bei mir zu Hause...$0",
	"DwarfTunnel.05": "Die Sonne ist noch nicht aufgegangen... bis dahin, Mensch.$0",
	"DwarfTunnel.06": "Ah... du bist hier. Ja, ich möchte mit dir sprechen.$0",
	"DwarfTunnel.07": "Dein Land beherbergt viele Höhlennetzwerke. Eines davon ist blockiert und führt zu den Sonnenlanden...#$b#Ich glaube, Menschen nennen es eine 'Wüste'.",
	"DwarfTunnel.08": "Ich könnte mit Hilfe meiner speziellen Höhlenräumbomben einen Weg für dich freimachen.#$b#Ich werde jedoch drei Dutzend Diamanten als Bezahlung benötigen.",
	"DwarfTunnel.09": "Verstehe. Gut... Ich werde einen neuen Höhleneingang auf deinem Hof für dich öffnen, sobald ich meine Diamanten habe...$0",
	"DwarfTunnel.10": "Warum ich Diamanten brauche? Das geht dich nichts an.$0",
	"DwarfTunnel.11": "Ich habe die Diamanten inspiziert... gute Arbeit. Ich werde heute Nacht eine neue Höhle öffnen, die zu den Sonnenlanden in der Nähe deines Hauses führt.$0",
	"DwarfTunnel.12": "Meine Höhlenräumbomben sind nicht verkäuflich.$0#$e#Ich traue Menschen nicht zu, verantwortungsvoll damit umzugehen...$0",
	"DwarfTunnel.13": "In der Nähe meiner Farmhöhle sind Explosionsgeräusche zu hören...",
	"CamillaBridge.01": "Brückenmagie",
	"CamillaBridge.02": "Camilla wird die Brücke auf meinem Ackerland renovieren, wenn ich ihr die gewünschten Gegenstände zu einer Steintruhe bringe, die sie hinterlassen hat.",
	"CamillaBridge.08": "Die Ländereien jenseits dieser baufälligen Brücke sind ziemlich atemberaubend.$0#$b#Es ist so schade, dass man nicht einfach-$2",
	"CamillaBridge.09": "...$1",
	"CamillaBridge.10": "Was wäre, wenn ich einen Handel mit dir abschließe, @?$0#$b#Liefere mir die Beute deiner Abenteuer aus verschiedenen Ländern und ich werde meine Magie benutzen, um diese Brücke zu renovieren.$1",
	"CamillaBridge.11": "Ausgezeichnet... Ich werde hier eine Steintruhe hinterlassen, in die du meine gewünschten Gegenstände liefern wirst.$0#$b#Viel Glück, @. Nicht, dass ich denke, du brauchst es...$5",
	"CamillaBridge.item.01": "Liefere 20 Leeren-Seelen ab.",
	"CamillaBridge.item.02": "Liefere 25 rote Schleim-Eier ab.",
	"CamillaBridge.item.03": "Liefere 10 Monsterfrüchte ab.",
	"CamillaBridge.item.04": "Liefere 40 Sumpfessenzen ab.",
	"CamillaBridge.item.05": "Liefere 1 Schnappwurm ab.",
	"CamillaBridge.item.06": "Liefere 30 Glutsteinsplitter ab.",
	"CamillaBridge.item.07": "Liefere 15 Iridiumbarren ab.",
	"CamillaBridge.item.08": "Liefere 100 Hartholz ab.",
}