{
    //Frontier Farm Menu
	"FrontierFarm.Description": "Frontier Farm_An expansive plot of land bordering the 'Ferngill Republic Frontier'. Many different wild trees are rooted here and there's secrets to discover. You start with one pear tree.",

	//Internal Map Data
	"FrontierName": "Ferngill Republic Frontier",
	"FrontierName.HotSpring": "Hot Spring",
	"FrontierName.Cave": "Cliff Cavern",
	"FrontierName.FarmCave": "Farm Cave",
	"FrontierName.DesertTunnel": "Desert Tunnel",
	"FrontierName.HiddenCave": "Hidden Cave",
	
	//Map Strings
    "SignPost": " Farm^` Mountain^> Pelican Town^= Marnie's Ranch",
	"Minecarts": "The minecart doesn't work...",
	"minecart.Right": "Farm - Right",
	"minecart.Left": "Farm - Left", 
	"minecart.Middle": "Farm - Middle",
	"minecart.Ravine": "Frontier - Ravine",
	"minecart.Mountain": "Frontier - Mountains",
	"minecart.Grassland": "Frontier - Grassland",
	"minecart.Beach": "Frontier - Beach",
	
	//Events
	"OpeningEvent.01": "Hello! You must be @.#$b#I'm Robin, the local carpenter. Mayor Lewis sent me here to fetch you and show you the way to your new home. He's there right now, tidying things up for your arrival.#$b#The farm's right over here, if you'll follow me.",
    "OpeningEvent.02": "This is %farm farm.",
    "OpeningEvent.03": "What's the matter?#$b#Sure, it's a bit overgrown, but there's some good soil underneath that mess!#$b#With a little dedication you'll have it cleaned up in no time.",
    "OpeningEvent.04": "...And here we are, your new home.$h",
    "OpeningEvent.05": "Ah, the new farmer!$h",
    "OpeningEvent.06": "Welcome! I'm Lewis, Mayor of Pelican Town.#$b#You know, everyone's been asking about you.#$b#It's not every day that someone new moves in. It's quite a big deal!",
    "OpeningEvent.07": "So... You're moving into your grandfather's old cottage.#$b#It's a good house... very 'rustic'.",
    "OpeningEvent.08": "Rustic? That's one way to put it... $4#$b#'Crusty' might be a little more apt, though.$4",
    "OpeningEvent.09": "Rude!",
    "OpeningEvent.10": "Don't listen to her, @. She's just trying to make you dissatisfied so that you buy one of her house upgrades.$u",
    "OpeningEvent.11": "Hmmph.",
    "OpeningEvent.12": "Anyway... You must be tired from the long journey. You should get some rest.#$b#Tomorrow you ought to explore the town a bit and introduce yourself.#$b#The townspeople would appreciate that.",
    "OpeningEvent.13": "Oh, I almost forgot. If you have anything to sell, just place it in this box here. I'll come by during the night to collect it.#$b#Well... Good luck!",
    "Marnie.Event.01": "Hi @! Now that you own farm animals, I thought I'd let you in on a little secret.$0",
    "Marnie.Event.02": "They won't wander out of the fenced areas on your farm, so you're free to leave them open!$1",
	
	//Questlines
	"GilMinecarts.01": "Farmland Minecarts",
	"GilMinecarts.02": "Gil can repair the minecarts on my farm but he needs resources.",
	"GilMinecarts.03": "Drop off 24 iron bars in the storage chest east of my farm.",
	"GilMinecarts.04": "Drop off 24 copper bars in the storage chest east of my farm.",
	"GilMinecarts.05": "*yawn* A little birdie told me the minecarts on your farm are out of order...",
	"GilMinecarts.06": "I use' to work in these tunnels myself when I was a young lad.#$b#I know a thing or two about those rugged trolleys and can fix them up good for you.",
	"GilMinecarts.07": "Great. I need two dozen refined iron and copper bars to fix the wheels. Marlon will drop off a storage chest east of your farm.#$b#I'll get your carts workin' again, farmer. Ack. Or was it adventurer? I'm getting mixed up.",
	"MarlonMinecarts.01": "Stop by the guild when you have the time. Gil needs to speak with you about something important.",
	"MarlonMinecarts.02": "The minecarts in the mines were beyond repair from what Gil told me.$2#$b#Yet somehow they started working again...$0#$e#Do you know anything about this, @?$0",
	"MarlonMinecarts.03": "Everything seems to be in order. Gil will start working on your minecarts today.$0#$b#He should be finished by tomorrow.$0",
	"MarlonMinecarts.04": "Pretty convenient having minecarts on your farmland.$0",
	"DwarfTunnel.01": "Calico Desert Shortcut",
	"DwarfTunnel.02": "The dwarf said they'd open a shortcut to the desert near my farmhouse with 'cavern clearing bombs' in exchange for diamonds.",
	"DwarfTunnel.03": "Deliver 36 diamonds directly to the dwarf.",
	"DwarfTunnel.04": "Hello. I have a proposition to make. Visit me at my home tomorrow...$0",
	"DwarfTunnel.05": "The sun hasn't risen yet... until then, human.$0",
	"DwarfTunnel.06": "Ah... you're here. Yes, I wish to speak to you.$0",
	"DwarfTunnel.07": "Your land is home to many cave networks. There is one blocked off that leads to the sunlands...#$b#I think humans call it a 'desert'.",
	"DwarfTunnel.08": "I could clear a pathway for you with the help of my special cavern clearing bombs.#$b#I will, however, require three dozen diamonds as payment.",
	"DwarfTunnel.09": "I see. Good... I will reveal a new cave entrance on your farm for you once I have my diamonds...$0",
	"DwarfTunnel.10": "Why do I require diamonds? That is none of your concern.$0",
	"DwarfTunnel.11": "I inspected the diamonds... good work. I will open a new cavern leading to the sunlands near your home tonight.$0",
	"DwarfTunnel.12": "My cavern clearing bombs are not for sale.$0#$e#I don't trust humans to be responsible with these...$0",
	"DwarfTunnel.13": "There's the sound of explosions near my farm cave...",
	"CamillaBridge.01": "Bridge Magic",
	"CamillaBridge.02": "Camilla will refurbish the bridge on my farmland if I deliver her requested items to a stone chest she left.",
	"CamillaBridge.08": "The lands beyond this dilapidated bridge are quite breath taking.$0#$b#It's such a shame you can't just simply-$2",
	"CamillaBridge.09": "...$1",
	"CamillaBridge.10": "What if I were to strike a deal with you, @?$0#$b#Deliver to me the spoils of your adventures from various lands and I'll use my magic to refurbish this bridge.$1",
	"CamillaBridge.11": "Excellent... I'll leave a stone chest here where you'll deliver my requested items.$0#$b#Good luck, @. Not that I think you need it...$5",
	"CamillaBridge.item.01": "Drop off 20 void souls.",
	"CamillaBridge.item.02": "Drop off 25 red slime eggs.",
	"CamillaBridge.item.03": "Drop off 10 monster fruits.",
	"CamillaBridge.item.04": "Drop off 40 swamp essence.",
	"CamillaBridge.item.05": "Drop off 1 snatcher worm",
	"CamillaBridge.item.06": "Drop off 30 cinder shards.",
	"CamillaBridge.item.07": "Drop off 15 iridium bars.",
	"CamillaBridge.item.08": "Drop off 100 hardwood.",
}