{
"Introduction": "Ah, the newest resident of Stardew Valley. Pleased to meet you.$0#$b#Name is Marlon, leader of the Adventurer's Guild. People in town mostly call me the 'monster hunter'.$0#$e#If fighting monsters interests you, consider joining the guild. Before you join, though, I want to see you prove your might in real combat.$0",

//SPRING AND GENERAL DIALOGUE

"spring_1": "Unfortunate to see the snow melt away as fast as it did.$0#$e#Need to make my rounds at the mountain. There's a slight chance monsters could be thawing out.",
"spring_12": "Egg festival is tomorrow.$0#$e#Hmm. I wonder what food and drink Gus is preparing.$1",
"spring_23": "Hmm? What's that?$0#$e#Yes, I'm aware the flower festival is tomorrow. My attendance was requested by Mayor Lewis.$0",
"spring_28": "It's getting hotter...$2#$e#Spring is coming to an end soon.$0",

"Mon": "Hello.$0#$e#Can I help you with something?$0",
"Mon2": "Hey there. How's adventuring?$0#$e#If you find yourself needing a stronger weapon, take a look in our weapons cache.$0",
"Mon8": "Watch those corners in the mines, @. You never know what may be waiting for you.$0#$e#Take care.$0",
"Tue": "Hi.$0#$e#Err... enjoying the weather today?$0#$e#%Marlon turns away. He seems busy.$0",
"Tue2": "Hello, @.$0#$e#If you have questions about the local monsters or combat techniques, don't hesitate to ask.$0",
"Tue8": "You remind me of Alesia. Always prepared to protect people, no matter the cost.$0#$e#Keep up the good work, @.$0",
"Wed": "My sword's really taken a beating. Clint will need to take a look at it soon.$2#$e#He's skilled in his craft.$0",
"Wed4": "I scout the mines several times a week, trying to gauge monster populations.$0#$e#Wouldn't want too many of them grouped up. They could start trickling out of the caves into the valley.$1",
"Wed8": "Hey, @. We should go on an expedition together sometime. I could use the help.$0#$e#Always eager to lend assistance. I appreciate your fighting spirit.$0",
"Thu": "Hi.$0#$e#I'm not what you'd call the 'chatty' type.$0",
"Thu2": "In some fights, the best strategy is to retreat. Know your exits.$0#$e#...$2#$e#%Marlon turns away from you.",
"Thu8": "It's imperative to keep a good stock of potions on hand when adventuring.#$b#It could be the difference between life and certain demise.$2#$e#Take care, @.",
"Fri": "If you spot any monsters outside the mine cave, alert me at once.$0#$e#I'll make quick work of them.$0",
"Fri4": "Gus serves good food and drink at the Stardrop Saloon.$0#$e#If you find yourself needing rations in the mines, there's no better place than the saloon to get them.$0",
"Fri8": "Thankless job we have, @. I appreciate everything you've done.$0#$e#Have a nice day.$0",
"Sat": "Hello.$0#$e#Err... any plans for the weekend?$0#$e#Hmm. I see. Sounds interesting.#$e#...$0#$e#%Marlon doesn't feel like talking.",
"Sat4": "Need to visit Rasmodius at his abode soon. Need to refresh the enchantments on a few weapons in the armory.$0",
"Sat8": "You're doing the guild proud, @. Keep up the good work.$0",
"Sun": "Hmmm?$0#$e#Oh, hello.$0",
"Sun2": "Sword, dagger, or hammer? The weapon you choose will dictate your fighting style.$0#$e#I prefer swords. Short range on daggers gets me too close to monsters for comfort, and hammers slow me down.$0",
"Sun8": "I want to introduce you to some folks in Castle Village sometime, @. The feats you've accomplished are impressive.$0#$e#The village is invitation only to those who have proven themselves in the field of combat. I'll talk to my connections and see what I can do.$0", 
 
//SUMMER DIALOGUE
"summer_1": "With heat like this, I prefer being deep down in the mines where it's cool.$0",
"summer_10": "Still need something to drop into the festival's soup, @?#$e#I wonder how the soup will turn out tomorrow.$0#$b#Perhaps the cave carrots I dug up would make a good addition?$1",
"summer_28": "The moonlight jellies are visiting the beach today. Beautiful little creatures.$0#$e#They look similar to zines, poisonous jellyfish that occupy deep ocean caverns at the Fern Islands.",

"summer_Mon": "Whatever you do, don't gift me ice cream.$0#$e#I'm not fond of the stuff.$2",
"summer_Mon6": "Insects outside get into the caves and are corrupted by dark magic.$2#$b#It's the very reason why the top floors are nothing but oversized bugs.#$e#Easily defeated, though. One quick slash with a good enchanted weapon and they're done for.",
"summer_Tue": "...$2#$e#Hmm? Oh. Just thinking about something.#$e#Can I help you, @?",
"summer_Tue6": "*sigh* Missed a swipe of my sword on a slime yesterday and it got a hit on me. Nothing too serious.$2#$e#Need to apply myself more to practicing my sword stances.$2#$e#Never thought I'd say it, but maybe I should be taking some tips from you...$1",
"summer_Wed": "Blue Moon Vineyard is a pretty site on our dock.#$e#I remember the early days before the vineyard was built. Nothing but a grass field with trees.$0",
"summer_Wed6": "The town's come a long way since I first came here.$0#$e#I miss the early days a little. Most of the changes are good.$1",
"summer_Thu": "Guild used to be a lot bigger. Stardew Valley wasn't always as 'monster-free' as it is now.#$e#Rasmodius played a big part in the security here.",
"summer_Thu8": "Folks in this village don't understand just how much Rasmodius does for them.$0#$e#Without him, this place probably would have been overrun by monsters long ago.$0",
"summer_Fri": "Mines are dangerous if you're not prepared.#$e#I recommend bringing extra supplies on your expeditions.",
"summer_Fri8": "It's a pleasure, @.#$e#Farewell.",
"summer_Sat": "Hey there, @. We just received a new stock of weapons.#$e#The blacksmith at Castle Village is as talented as they come.",
"summer_Sat6": "During the time I've spent traveling and fighting monsters, I've come across many interesting people.$0#$e#Some of the most interesting are here in this valley. Including you, of course.$2",
"summer_Sun": "Hey there, @. Any plans for the upcoming week?$0#$e#If you fight, fight safely.$2",

//FALL DIALOGUE

"fall_1": "Hello, @.$0#$e#Start of a new season.",
"fall_15": "Heard news from Mayor Lewis. There's many tourists visiting Pelican Town tomorrow for the festival.$0#$e#I get nervous around large crowds.$2",
"fall_26": "Need to gather my supplies soon. Heading out to the mines with a Castle Village adventurer. We're capturing monsters for the festival.$0#$e#Spirit's Eve presents a good opportunity to show the townsfolk just how dangerous monsters are.$0",
"fall_27": "Cages are bein' set up in town as we speak. Caught several shadow brutes and skeleton walkers.$0",
"fall_28": "Winter arrives soon, @. With your freed up time, are you planning on adventuring more than usual?$0#$e#If so, please be careful. Don't get yourself in a position you can't get out of.",

"fall_Mon": "You ever get scared, down in the mines alone?$0#$e#Even I do, still. Never know what could come creepin' up on you.$0",
"fall_Mon4": "Find yourself a trusty weapon and take enough supplies and there's nothing you can't tackle.$0#$e#You're shapin' up to be a fine adventurer, @.$2",
"fall_Tue":  "Good ore deep in the mines. Easy to strike it rich, but it's risky.#$e#If you're in a situation where a horde is guarding a treasure, even a big one, take my advice: Turn away.$2",
"fall_Tue6": "Willy said he'd pay me good coin if I caught him a stonefish in the mines.#$b#I don't fish though. Could never catch something that difficult.$2#$e#Hmm. Maybe if I used my bow...?$1",
"fall_Wed": "Careful on your adventures today, @.$0",
"fall_Wed4": "Ever found any artifacts, down in the mines?$0#$e#I don't know too much about them, but Gunther does. You can find some strange things, if you go deep enough.$0", 
"fall_Thu": "I don't recommend using bombs in the mines. Good chance the cave may collapse.$0",
"fall_Thu6": "Hope you're taking enough precautions down in the mines, @.$0#$e#Last thing I need is another spot to visit up on the summit. Crowded enough up there already.$2",
"fall_Thu10": "You're doing the valley proud, @. Keep it up.$0",
"Fall_Fri": "Black slimes are a rare phenomenon - corrupted by dark magic for hundreds of years.$0#$e#If you encounter a black slime, don't let it touch you.$2",
"fall_Fri6": "Insects outside get into the caves and are corrupted by dark magic.$2#$b#It's the very reason why the top floors are nothing but oversized bugs.#$e#Easily defeated, though. One quick slash with a good enchanted weapon and they're done for.",
"fall_Sat": "You make a lot of friends in town yet?$0#$e#For me, they come and go. The current crowd is nice and friendly, though.$2",
"fall_Sat6": "Need to visit the friends I've lost at the summit soon.#$b#Bein' an adventurer is dangerous work.$2#$e#I'm glad you joined our cause.",
"fall_Sun": "Slimes are easilly defeated one-on-one, but you must be careful if they're grouped up.#$b#You could be overwhelmed in an instant.$2",
"fall_Sun8": "Maybe it's time to retire soon... you ever try raising slimes?$2#$b#Might make a nice change from just fighting 'em.$2#$e#%Marlon scratches his beard, looking thoughtful.", 

//WINTER DIALOGUE

"winter_1":  "I wear my favorite uniform during winter. What do you think?$0#$e#What? You think it looks the same? Heh.$0",
"winter_7":  "I object to the town's ice festival gathering every year.$0#$b#The magic barrier that far out in the forest is weak. Monsters could slip through.$0#$e#I'll be keeping close watch. Don't worry.$0",
"winter_24": "Not particularly fond of gift giving, but if it puts a smile on someones face, I'll do it.$0",
"winter_28": "Snow is clearing soon. I trust you'll devote more of your time to farmwork?$0",

"winter_Mon": "Doin' well today, @?$0#$e#Lemme know if me and Gil can do anything for you.$2",
"winter_Mon6": "Gil and I have known each other for a long time. Been through lots together.$0#$e#Good friends are some of the best things to have, in this business. You can watch each other's backs.$2",
"winter_Tue": "Any recent feats in battle you wanna brag about, @?$0#$e#Well, lemme know if you come up with any good ones. No tall tales, though.$2",
"winter_Tue6": "Singlehandedly took out several floors of monsters and secured a pile of diamonds yesterday in the mines.#$b#These diamonds will prove useful in Rasmodius' arcane studies.$0",
"winter_Wed":  "Gil tends to sleep more than usual during winter.#$e#Well, he's always like that, actually.$2",
"winter_Wed8": "Gil is taking a trip to Castle Village. Much business to attend to regarding new adventurers.$0#$e#He doesn't get out as much nowadays. Good for him.$0",
"winter_Thu": "You enjoy the winter, @? I know I do, even though it's not the most popular of seasons.$0",
"winter_Thu6":  "Silence of winter is mesmerizing.$2#$e#I enjoy taking late night strolls in the dead of night, nothing lighting my path but my lantern.$0",
"winter_Fri": "Some arcane scholars believe ghosts in the mines are the lost spirits of travelers who never returned.$0",
"winter_Fri8": "Legends tell of civilizations of the shadow people underground, similar to the dwarves.#$e#All that remains are their outer shells, mercilessly attacking any soul in their path.$2#$e#They are of the same creature as Krobus.$0",
"winter_Sat": "Talked to Rasmodius up in his tower yet?$0#$e#I know lotsa things come to mind when you think 'wizard', but he might surprise you.$2",
"winter_Sat4": "Rasmodius spends most of his days studying arcane properties.#$e#If you want to get on his good side, I recommend giving him void essence.",
"winter_Sun": "Freezing today.$0#$e#One of those days it can be warmer underground than above.$2",
"winter_Sun6": "Stay bundled up today, @, especially if you go battlin'.$0#$e#...Just don't bundle up so well you can't swing a weapon.$2",

"marlon_event1": "Then in that case...!",
"marlon_event2": "Hmm...",
"marlon_event3": "Haha! Good answer.",
"marlon_event4": "Yes, there are. The further down you go, the more monsters you'll encounter that have been...#$b#That have been corrupted for many years. It gives them supernatural strength.",
"marlon_event5": "Hmm...",
}
