{
	"Format": "1.10",
  "Changes": [
    {
      "LogName": "Marlon Disposition",
      "Action": "EditData",
      "Target": "Data/NPCDispositions",
      "Entries": {
      "MarlonFay": "adult/polite/neutral/positive/male/not-datable/null/Other/winter 19//AdventureGuild 6 17/Marlon"
      }
    },
	{
      "LogName": "Marlon's Gift Tastes",
      "Action": "EditData",
      "Target": "Data/NPCGiftTastes",
      "Entries": {
      "MarlonFay": "This is a mighty gift, @. Thank you./244 413 437 439 680/Thanks. I'll find some use of this./346 303 348 459 205 422 287 288/Hmmm... that will be a hard pass. My apologies./-81/This unfortunately doesn't suit me./-80 283 233/Thanks./286 424 426 436 438 803 184 186 420 -28/"
      }
    },
	{
      "LogName": "Marlon's Animations",
      "Action": "EditData",
      "Target": "Data/animationdescriptions",
      "Entries": {
      "Marlon_Invisible": "27/27/27",
	 }
    },
	{
      "LogName": "Marlon's Portraits",
      "Action": "Load",
      "Target": "Portraits/MarlonFay",
      "FromFile": "assets/Image/MarlonFay.png"
    },
	{
      "LogName": "Marlon's Portraits",
      "Action": "Load",
      "Target": "Portraits/Marlon",
      "FromFile": "assets/Image/MarlonFay.png"
    },
    {
      "LogName": "Marlon's Sprites",
      "Action": "Load",
      "Target": "Characters/MarlonFay",
      "FromFile": "assets/Image/Sprite.png"
    },
	{
      "LogName": "Marlon's Sprites",
      "Action": "Load",
      "Target": "Characters/Marlon",
      "FromFile": "assets/Image/Sprite.png"
    },
	{
      "LogName": "Marlon's Schedule",
      "Action": "Load",
      "Target": "Characters/schedules/MarlonFay",
      "FromFile": "assets/Schedule/Schedule.json"
    },
    {
      "LogName": "Marlon's Dialogue",
      "Action": "Load",
      "Target": "Characters/Dialogue/MarlonFay",
      "FromFile": "assets/Dialogue/Dialogue.json"
    },
	{
      "LogName": "Marlon's Dialogue",
      "Action": "Load",
      "Target": "Characters/Dialogue/Marlon",
      "FromFile": "assets/Dialogue/Dialogue.json"
    },
	
	{
	 "Action": "EditData",
     "Target": "Data/Festivals/Winter8",
     "Entries": {
	 "MarlonFay": "If you spot any frost slimes, alert me.$0#$e#We're deep in the forest. Anything can be out there in the woods.",
		 }
	 },	
	 
	 
{       //ADVENTURER'S GUILD INITIATION
	 "Action": "EditData",
	 "Target": "data/events/adventureguild",
	 "Entries": {
     "1000034/e 100162/j 8": "MarlonsTheme/-500 -500/farmer 6 19 0 Marlon 6 13 2/pause 500/showFrame Marlon 17/viewport 6 14 true/skippable/playSound doorClose/pause 800/shake Marlon 600/textAboveHead Marlon \"You've proven yourself!\"/pause 150/move farmer 0 -4 0/pause 700/showFrame Marlon 0/pause 600/speak Marlon \"You've ventured into the mines with utmost courage, @!#$b#We could use someone with your skills. Do you want to join the Adventurer's Guild?\"/pause 1000/jump farmer/pause 800/jump farmer/pause 1200/speak Marlon \"@...$2#$b#Do you swear under oath, to protect humanity from monsters, and to do everything in your power to uphold the traditions, values, and ideology of the Adventurer's Guild?$0\"/pause 500/jump farmer/pause 1400/move Marlon 0 1 2/pause 700/speak Marlon \"On behalf of Stardew Valley and the Order of the Knights of Pythagoras, I officially accept you as the 23rd Adventurer's Guild member!$1\"/pause 1000/speak Marlon \"As a member of the Adventurer's Guild, you will be allowed to purchase rare weapons we commission and discover!#$b#There are also bounties and quests you can access from the notice board behind me!\"/pause 700/move farmer 0 0 1/pause 350/emote farmer 8/speak Marlon \"Don't mind Gil. He just took some of his meds and he's dozing off. I'll inform him of our new member when he awakens.\"/pause 700/move farmer 0 0 0/pause 750/speak Marlon \"Welcome to the guild, @. I expect great things from you.\"/pause 500/globalFade/viewport -1000 -1000/pause 700/end dialogue Marlon \"How is adventuring? If you need a sharper sword, I can put in a good word with Clint.\"",
        },
},

{       //MARLON 1 HEART EVENT
	 "Action": "EditData",
	 "Target": "data/events/adventureguild",
	 "Entries": {
     "1050034/e 1000034/j 30/k 1090501/f MarlonFay 250": "MarlonsTheme/-500 -500/farmer -200 -200 0 Marlon 4 11 2/pause 1000/viewport 6 14 true/skippable/pause 3000/warp farmer 6 19/playSound doorClose/pause 500/textAboveHead Marlon \"Ah. You're back.\"/pause 330/move farmer 0 -5 3/move farmer -2 0 0/move farmer 0 -1 0/pause 1000/speak Marlon \"@. I've been meaning to have a conversation with you.#$b#I'm sure you have several questions as to who we are, what we do, and the history of this guild.#$b#If you would please join me in my quarters, I'll explain all of this to you.\"/pause 500/question fork0 \"#I'd like to hear the history of the guild.#Sounds like a long talk. No thanks.\"/fork 1050034_GuildHistory/pause 800/speak Marlon \"Hmm. I see. If that's your choice, so be it.$2\"/pause 1200/speak Marlon \"Do you need a new weapon? Take a look at what we have in stock.\"/pause 300/globalFade/viewport -1000 -1000/pause 1000/end position 4 13",
	 
	 "1050034_GuildHistory": "pause 1000/speak Marlon \"Follow me.\"/pause 100/globalFade/viewport -1000 -1000/pause 500/warp farmer 4 5/warp Marlon 6 5/faceDirection farmer 1/showFrame Marlon 18/pause 250/viewport 7 6 true/pause 1500/speak Marlon \"Hmm... where to begin...\"/pause 600/emote Marlon 40/pause 200/speak Marlon \"I'll start with the history of the guild.#$b#I founded the Adventurer's Guild over 25 years ago, after being recognized by the Order of the Knights of Pythagoras.#$b#Our Order is made up of over fifty guilds and clans around the world, spanning every continent.#$b#Our mission is to protect humanity from monsters corrupted by ancient dark magic. No one knows when this corruption started, or how it began.#$b#Some ancient legends speak of a past time when monsters and humans lived in peace. If those times were ever real, they now only exist in stories.#$b#So we, the Order of the Knights of Pythagoras, have sworn an oath to protect humans from those monsters. We are, in a way, monster hunters.\"/pause 1050/speak Marlon \"This guild in particular works closely with M. Rasmodius. You may know him as the 'Wizard'.#$b#Every guild has a wizard or witch that supports them. It's paramount our weapons are imbued with magic to pierce the life force of monsters.#$b#You may wonder why we use swords instead of conventional weapons.#$b#To destroy the life force of a monster, you must pierce their life force fibers in a slashing movement.#$b#This is the only way to ensure the monster is defeated, or else it will regenerate.#$b#Projectile weapons unfortunately don't do the trick. They are able to stun monsters, but they still require a good horizontal slash to finish them off.#$b#If you ever use a projectile weapon, you may understand what I mean, unless you use explosives or iridium ammunition.\"/pause 1000/speak Marlon \"Alesia was a gifted sniper who used magic-imbued arrows. She used to be a member of this guild before she moved to Castle Village in the desert.#$b#She used her arrows to stun monsters before finishing them with her dagger.\"/pause 1000/showFrame Marlon 0/pause 800/showFrame Marlon 18/pause 1000/speak Marlon \"You may have noticed you're the 23rd adventurer, but there are only a few of us here. We used to have many more members.#$b#Over time, people have left to join other guilds and... and we...\"/pause 500/showFrame Marlon 19/pause 650/speak Marlon \"We have lost a lot of good people over the years. What we do is dangerous, and it's a thankless job.#$b#Thanks for joining our cause. Your help in protecting the valley is greatly appreciated. I feel as if we're a fully functioning guild again.\"/pause 800/speak Marlon \"$q -1 null##$r -1 0 marlon_event2#I'll do everything I can to protect people.#$r -1 0 marlon_event5#It's dangerous and risky. Someone needs to do it.\"/pause 1000/showFrame Marlon 0/pause 1000/showFrame Marlon 18/pause 500/speak Marlon \"I'm proud to hear that from you. You have the potential to be an excellent swordsman.\"/pause 1250/speak Marlon \"We saw each other at the mines of Corneal Mountain. You may be wondering why we don't just seal off the entrance to the mines.#$b#Unfortunately, Joja owns the rights to the mines and won't allow us to seal it.#$b#It's strange. They don't utilize the mines in any way, despite bountiful amounts of ore.#$b#Because of this, we must venture into the mines and slay monsters before they accumulate in mass.\"/pause 600/speak Marlon \"$q -1 null##$r -1 0 marlon_event4#There must be strong monsters deep in the mines...#$r -1 0 marlon_event3#I'll make it past that floor!\"/pause 1000/speak Marlon \"I must disclose to you that not every monster is corrupted and hostile.#$b#There is a Shadow Person living the sewer. His name is 'Krobus'. Rasmodius and I have been harboring him.#$b#This is to remain a secret. You'll meet Krobus soon enough. I need to see you prove your worth before I introduce you to him.$2\"/pause 1200/speak Marlon \"I believe that's enough conversation for you today. I'll speak with you again soon on other matters.#$b#I need to check on a new stock of weapons we just received from the new blacksmith in Castle Village.\"/pause 100/globalFade/viewport -1000 -1000/pause 700/end dialogue Marlon \"Remember what I said. Krobus is to remain a secret. There would be dire consequences if anyone got wind of him.\"",
     },
},

{       //MARLON 4 HEART EVENT
	 "Action": "EditData",
	 "Target": "data/events/railroad",
	 "Entries": {
     "1004200/y 2/b 1/w rainy/f MarlonFay 1000": "continue/-500 -500/farmer 22 37 0 Marlon 22 15 2/pause 1000/skippable/viewport 22 28 true/viewport move 0 -1 4000 true/move Marlon 0 9 2 true/move farmer 0 -11 0 true/pause 5000/speak Marlon \"Greetings, @. I don't believe I've seen you up here before.\"/pause 1150/speak Marlon \"I visit this graveyard to pay my respects to those who sacrificed their lives to keep the valley safe.\"/pause 1200/showFrame Marlon 19/pause 1600/speak Marlon \"Many of these adventurers were my friends...$2\"/pause 750/showFrame Marlon 0/pause 1250/speak Marlon \"I went on an expedition in the mines with a couple First Slash adventurers who were eager to test their mettle.#$b#Imagine their disappointment when we found that the monsters have been thinned out! The progress you've made single-handedly is impressive.$1#$b#Your assistance in keeping the valley safe is a debt I don't think I'll ever be able to repay.$0#$b#To tell you the truth, you remind me of myself when I was your age.$2\"/pause 500/emote Marlon 40/speak Marlon \"Rasmodius and I privately meet regarding new monster hunters, wizards, witches, and adventurers who join our order.\"/move Marlon 0 1 2/pause 700/speak Marlon \"I want you to join our meetings, @. Your insight would prove most helpful. What do you say?\"/pause 500/question fork0 \"#I would be honored to join the meetings.#I'm humbled, but I'll leave that to you two.\"/fork 1004200_Agree/pause 1000/speak Marlon \"I understand, @. Keep up the good work protecting Stardew Valley.\"/pause 1200/speak Marlon \"I'll speak to you again regarding other matters.$2\"/move Marlon 0 8 2 true/move farmer -1 0 2 true/pause 2000/globalFade/viewport -1000 -1000/pause 1200/end position 21 27",

     "1004200_Agree": "pause 1000/speak Marlon \"I'll let you know when we have our next meeting.#$b#We usually meet at the guild building or at Rasmodius' tower.#$b#Sometimes we rent a room at the Stardrop Saloon so we can enjoy good food and drink too.\"/pause 1500/showFrame Marlon 18/pause 1500/showFrame Marlon 0/pause 1200/speak Marlon \"I must be on my way, @...$2\"/pause 800/move Marlon 0 8 2 true/move farmer -1 0 2 true/pause 2000/globalFade/viewport -1000 -1000/pause 1200/end position 21 27",
	 },
},
	
{   //MARLON 8 HEART EVENT
    "Action": "EditData",
    "Target": "Data/Events/summit",
    "Entries": {
    "0002577/w rainy/y 4/b 1/f MarlonFay 2000": "continue/15 20/Marlon 22 25 3/skippable/pause 3000/speak Marlon \"...$2#$b#I'm sorry I have not visited lately. My bad leg is... proving troublesome.$2#$b#The hikes to the summit are becoming more difficult. My age is starting to show.$2\"/pause 2200/speak Marlon \"I was reminiscing of the old group with Gil...$2#$b#Jonathan, Boris, Alesia, Barin, Ketra, Gerta...$2#$b#My guilty pleasure of recalling the past - back when you were still...\"/pause 800/shake Marlon 1000/pause 1000/speak Marlon \"I had the nightmare again, Isabelle...$2#$b#...$2#$b#The moment I lost you...$2\"/pause 2000/speak Marlon \"...Soon, I'll be with you again. But there is work to do before that time comes.$2#$b#Until next time, my flower.$2\"/pause 1000/move Marlon 0 1 3/move Marlon -7 0 3 true/globalFade/viewport -1000 -1000/pause 600/end dialogue Marlon \"...$2#$e#...$0#$e#Hmm?$0#$b#I was... recalling past events.$2#$e#%Marlon turns away from you.\"",
    },
},

{   //SLIME HUTCH EGGS
    "Action": "EditData",
    "Target": "Data/Events/farm",
    "Entries": {
    "690006/n slimeHutchBuilt/H": "continue/64 15/farmer 64 16 2 Marlon 66 15 0/broadcastEvent/pause 1000/speak Marlon \"Bumped into Robin this morning... she told me you've got a new Slime Hutch!$1#$b#I was into slime breeding at your age. It's a great hobby... but dangerous.$1#$b#How'd you think I lost this eye?$2\"/shake Marlon 1000/showFrame Marlon 16/textAboveHead Marlon \"Hah!\"/pause 1000/textAboveHead Marlon \"Just Kidding.\"/showFrame Marlon 17/pause 700/showFrame Marlon 8/pause 800/speak Marlon \"Here, I've got something for you.\"/itemAboveHead slimeEgg/pause 1000/pause 1000/pause 1300/awardFestivalPrize slimeEgg/pause 300/faceDirection farmer 2 true/pause 500/speak Marlon \"It's a slime egg. You can place that inside a slime incubator to hatch it.#$b#Now, take a good hard look at that egg. Next time you're out slime-hunting keep your eyes peeled for more eggs. They're rare, but slimes do drop them from time to time.#$b#Collect eggs from different slimes to add some variety to your herd!\"/pause 500/end",
	},
},

{      //MARLON MINE EVENT ALTERATION
	"Action": "EditData",
    "Target": "data/events/mine",
    "Entries": {
    "100162/t 600 2600": "MarlonsTheme/21 9/farmer -100 -100 0 Marlon 23 6 2/addQuest 14/skippable/pause 1000/move Marlon 0 2 2/pause 500/showFrame Marlon 19/pause 1000/speak Marlon \"Hmmm... \"/pause 500/warp farmer 18 13/playSound stoneStep/move farmer 0 -3 1/move farmer 5 0 0/pause 500/showFrame Marlon 0/pause 500/speak Marlon \"...I was just wondering how far down this mine shaft goes.#$b#I'm going to take care of some of the monsters in here before they start climbing out into the valley.$0\"/pause 500/showFrame Marlon 18/pause 2000/showFrame Marlon 0/pause 500/speak Marlon \"I've met a lot of adventurers in my time. I recognize that look in your eye.$1#$b#Old age hasn't robbed me of my eyesight, or my skill with a sword, quite yet.$2\"/pause 1500/speak Marlon \"Take this weapon. It may not look like much, but it's imbued with magic. With it, you'll be able to battle the monsters here.\"/playSound dwop/faceDirection farmer 1 true/pause 50/faceDirection farmer 2/itemAboveHead sword/pause 3300/awardFestivalPrize sword/pause 300/faceDirection farmer 1 true/pause 100/faceDirection farmer 0/pause 500/speak Marlon \"I'll keep my eye on you. Prove yourself and I might think about making you a member.\"/pause 750/end",
	    }
},

{       //MARLON GALAXY SWORD EVENT
	"Action": "EditData",
	"Target": "data/events/adventureguild",
    "When": { "HasFlag": "galaxySword" },
	"Entries": { 
    "1337098": "MarlonsTheme/-500 -500/farmer -200 -200 0 Marlon 4 11 2/viewport 6 13 true/skippable/pause 2000/warp farmer 6 19/playSound doorClose/pause 500/showFrame Marlon 17/pause 150/textAboveHead Marlon \"You found something!\"/pause 350/move farmer 0 -5 3/move farmer -2 0 0/move farmer 0 -1 0/showFrame Marlon 0/pause 500/speak Marlon \"That weapon! There's no mistaking it!$1#$b#You received a galaxy sword!\"/pause 1000/showFrame Marlon 18/pause 1000/speak Marlon \"You have been deemed worthy, @. This is a true honor.$2#$b#I obtained my first galaxy weapon after a night of harsh battles at Castle Village.#$b#There was a purple blinding light as a sword slowly fell into my hands. I felt the power of the cosmos for a brief second.#$b#Wizards and scholars believe Yoba gifts these weapons to true peacekeepers of humanity.\"/pause 1200/speak Marlon \"I will allow you to purchase galaxy weapons from our hidden weapons cache, adventurer.$0#$b#I'm proud of you!$1\"/showFrame Marlon 0/pause 500/playSound reward/message \"I can now purchase galaxy weapons from Marlon!\"/pause 500/end",
    },
},
  ]
}